MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h

/****************************************************************************************************//**
 * @file     LPC43xx.h
 *
 * @brief    CMSIS Cortex-M4 Peripheral Access Layer Header File for
 *           LPC43xx from .
 *
 * @version  V9
 * @date     4. September 2013
 *
 * @note     Generated with SVDConv V2.80 
 *           from CMSIS SVD File 'LPC43xx.svd' Version 9,
 *
 *           Modified by KEIL
 *******************************************************************************************************/



/** @addtogroup (null)
  * @{
  */

/** @addtogroup LPC43xx
  * @{
  */

#ifndef LPC43XX_H
#define LPC43XX_H

#ifdef __cplusplus
extern "C" {
#endif

/*
   Following defines are used:
     CORE_M4    LPC43xx M4 Application core
     CORE_M0    LPC43xx M0 Application core
     CORE_M0SUB LPC43xx M0 Subsystem core
 */
// Note: Added for MikroE implementation.
#define CORE_M4
#if !defined (CORE_M4) && !defined (CORE_M0) && !defined (CORE_M0SUB)
  #define CORE_M4
#endif  

/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {
#ifdef CORE_M4
/* -------------------  Cortex-M4 Processor Exceptions Numbers  ------------------- */
  NonMaskableInt_IRQn               = -14, /*!<   2  Non maskable Interrupt, cannot be stopped or preempted    */
  HardFault_IRQn                    = -13, /*!<   3  Hard Fault, all classes of Fault                          */
  MemoryManagement_IRQn             = -12, /*!<   4  Memory Management                                         */
  BusFault_IRQn                     = -11, /*!<   5  Bus Fault                                                 */
  UsageFault_IRQn                   = -10, /*!<   6  Usage Fault                                               */
  SVCall_IRQn                       =  -5, /*!<  11  System Service Call via SVC instruction                   */
  DebugMonitor_IRQn                 =  -4, /*!<  12  Debug Monitor                                             */
  PendSV_IRQn                       =  -2, /*!<  14  Pendable request for system service                       */
  SysTick_IRQn                      =  -1, /*!<  15  System Tick Timer                                         */
// ---------------------------  LPC43xx/M4 Specific Interrupt Numbers  ----------------------------
  DAC_IRQn                          =  0,  /*!<   0  DAC interrupt                                             */
  M0APP_IRQn                        =  1,  /*!<   1  Cortex-M0APP; Latched TXEV; for M4-M0APP communication    */
  DMA_IRQn                          =  2,  /*!<   2  DMA interrupt                                             */

  FLASHEEPROM_IRQn                  =  4,  /*!<   4  flash bank A, flash bank B, EEPROM ORed interrupt         */
  ETHERNET_IRQn                     =  5,  /*!<   5  Ethernet interrupt                                         */
  SDIO_IRQn                         =  6,  /*!<   6  SD/MMC interrupt                                          */
  LCD_IRQn                          =  7,  /*!<   7  LCD interrupt                                             */
  USB0_IRQn                         =  8,  /*!<   8  OTG interrupt                                             */
  USB1_IRQn                         =  9,  /*!<   9  USB1 interrupt                                            */
  SCT_IRQn                          = 10,  /*!<  10  SCT combined interrupt                                    */
  RITIMER_IRQn                      = 11,  /*!<  11  RI Timer interrupt                                        */
  TIMER0_IRQn                       = 12,  /*!<  12  Timer 0 interrupt                                         */
  TIMER1_IRQn                       = 13,  /*!<  13  Timer 1 interrupt                                         */
  TIMER2_IRQn                       = 14,  /*!<  14  Timer 2 interrupt                                         */
  TIMER3_IRQn                       = 15,  /*!<  15  Timer 3 interrupt                                         */
  MCPWM_IRQn                        = 16,  /*!<  16  Motor control PWM interrupt                               */
  ADC0_IRQn                         = 17,  /*!<  17  ADC0 interrupt                                            */
  I2C0_IRQn                         = 18,  /*!<  18  I2C0 interrupt                                            */
  I2C1_IRQn                         = 19,  /*!<  19  I2C1 interrupt                                            */
  SPI_IRQn                          = 20,  /*!<  20  SPI interrupt                                             */
  ADC1_IRQn                         = 21,  /*!<  21  ADC1 interrupt                                            */
  SSP0_IRQn                         = 22,  /*!<  22  SSP0 interrupt                                            */
  SSP1_IRQn                         = 23,  /*!<  23  SSP1 interrupt                                            */
  USART0_IRQn                       = 24,  /*!<  24  USART0 interrupt                                          */
  UART1_IRQn                        = 25,  /*!<  25  Combined UART1, Modem interrupt                           */
  USART2_IRQn                       = 26,  /*!<  26  USART2 interrupt                                          */
  USART3_IRQn                       = 27,  /*!<  27  Combined USART3, IrDA interrupt                           */
  I2S0_IRQn                         = 28,  /*!<  28  I2S0 interrupt                                            */
  I2S1_IRQn                         = 29,  /*!<  29  I2S1 interrupt                                            */
  SPIFI_IRQn                        = 30,  /*!<  30  SPISI interrupt                                           */
  SGPIO_IRQn                        = 31,  /*!<  31  SGPIO interrupt                                           */
  PIN_INT0_IRQn                     = 32,  /*!<  32  GPIO pin interrupt 0                                      */
  PIN_INT1_IRQn                     = 33,  /*!<  33  GPIO pin interrupt 1                                      */
  PIN_INT2_IRQn                     = 34,  /*!<  34  GPIO pin interrupt 2                                      */
  PIN_INT3_IRQn                     = 35,  /*!<  35  GPIO pin interrupt 3                                      */
  PIN_INT4_IRQn                     = 36,  /*!<  36  GPIO pin interrupt 4                                      */
  PIN_INT5_IRQn                     = 37,  /*!<  37  GPIO pin interrupt 5                                      */
  PIN_INT6_IRQn                     = 38,  /*!<  38  GPIO pin interrupt 6                                      */
  PIN_INT7_IRQn                     = 39,  /*!<  39  GPIO pin interrupt 7                                      */
  GINT0_IRQn                        = 40,  /*!<  40  GPIO global interrupt 0                                   */
  GINT1_IRQn                        = 41,  /*!<  41  GPIO global interrupt 1                                   */
  EVENTROUTER_IRQn                  = 42,  /*!<  42  Event router interrupt                                    */
  C_CAN1_IRQn                       = 43,  /*!<  43  C_CAN1 interrupt                                          */

  ADCHS_IRQn                        = 45,  /*!<  45  ADCHS combined interrupt                                  */
  ATIMER_IRQn                       = 46,  /*!<  46  Alarm timer interrupt                                     */
  RTC_IRQn                          = 47,  /*!<  47  RTC interrupt                                             */

  WWDT_IRQn                         = 49,  /*!<  49  WWDT interrupt                                            */
  M0SUB_IRQn                        = 50,  /*!<  50  TXEV instruction from the M0 subsystem core interrupt     */
  C_CAN0_IRQn                       = 51,  /*!<  51  C_CAN0 interrupt                                          */
  QEI_IRQn                          = 52,  /*!<  52  QEI interrupt                                             */
#endif
#ifdef CORE_M0
/* -------------------  Cortex-M0 Processor Exceptions Numbers  ------------------- */
  NonMaskableInt_IRQn               = -14, /*!<   2  Non maskable Interrupt, cannot be stopped or preempted    */
  HardFault_IRQn                    = -13, /*!<   3  Hard Fault, all classes of Fault                          */
                                
                                
                                
  SVCall_IRQn                       =  -5, /*!<  11  System Service Call via SVC instruction                   */
                                
  PendSV_IRQn                       =  -2, /*!<  14  Pendable request for system service                       */
  SysTick_IRQn                      =  -1, /*!<  15  System Tick Timer                                         */
// ---------------------------  LPC43xx/M0App Specific Interrupt Numbers  -------------------------
  M0_RTC_IRQn                       =  0,  /*!<   0  RTC interrupt                                             */
  M0_M4CORE_IRQn                    =  1,  /*!<   1  M4 core interrupt                                         */
  M0_DMA_IRQn                       =  2,  /*!<   2  DMA interrupt                                             */

  M0_FLASHEEPROMAT_IRQn             =  4,  /*!<   4  flash bank A, flash bank B, EEPROM, Atimer ORed interrupt */
  M0_ETHERNET_IRQn                  =  5,  /*!<   5  Ethernet interrupt                                        */
  M0_SDIO_IRQn                      =  6,  /*!<   6  SD/MMC interrupt                                          */
  M0_LCD_IRQn                       =  7,  /*!<   7  LCD interrupt                                             */
  M0_USB0_IRQn                      =  8,  /*!<   8  OTG interrupt                                             */
  M0_USB1_IRQn                      =  9,  /*!<   9  USB1 interrupt                                            */
  M0_SCT_IRQn                       = 10,  /*!<  10  SCT combined interrupt                                    */
  M0_RITIMER_OR_WWDT_IRQn           = 11,  /*!<  11  RI timer, WWDT ORed interrupt                             */
  M0_TIMER0_IRQn                    = 12,  /*!<  12  Timer 0 interrupt                                         */
  M0_GINT1_IRQn                     = 13,  /*!<  13  GPIO global interrupt 1                                   */
  M0_PIN_INT4_IRQn                  = 14,  /*!<  14  GPIO pin interrupt 4                                      */
  M0_TIMER3_IRQn                    = 15,  /*!<  15  Timer 3                                                   */
  M0_MCPWM_IRQn                     = 16,  /*!<  16  Motor control PWM interrupt                               */
  M0_ADC0_IRQn                      = 17,  /*!<  17  ADC0 interrupt                                            */
  M0_I2C0_OR_I2C1_IRQn              = 18,  /*!<  18  I2C0, I2C1 ORed interrupt                                 */
  M0_SGPIO_IRQn                     = 19,  /*!<  19  SGPIO interrupt                                           */
  M0_SPI_OR_DAC_IRQn                = 20,  /*!<  20  SPI, DAC ORed interrupt                                   */
  M0_ADC1_IRQn                      = 21,  /*!<  21  ADC1 interrupt                                            */
  M0_SSP0_OR_SSP1_IRQn              = 22,  /*!<  22  SSP0, SSP 1 ORed interrupt                                */
  M0_EVENTROUTER_IRQn               = 23,  /*!<  23  Event router interrupt                                    */
  M0_USART0_IRQn                    = 24,  /*!<  24  USART0 interrupt                                          */
  M0_UART1_IRQn                     = 25,  /*!<  25  Modem/UART1 interrupt                                     */
  M0_USART2_OR_C_CAN1_IRQn          = 26,  /*!<  26  USART2, C_CAN1 ORed interrupt                             */
  M0_USART3_IRQn                    = 27,  /*!<  27  USART3 interrupt                                          */
  M0_I2S0_OR_I2S1_QEI_IRQn          = 28,  /*!<  28  I2S0, I2S1, QEI ORed interrupt                            */
  M0_C_CAN0_IRQn                    = 29,  /*!<  29  C_CAN0 interrupt                                          */
  M0_SPIFI_OR_ADCHS_IRQn            = 30,  /*!<  30  SPIFI, ADCHS ORed interrupt                               */
  M0_M0SUB_IRQn                     = 31,  /*!<  31  M0SUB core interrupt                                      */
#endif
#ifdef CORE_M0SUB
/* -------------------  Cortex-M0 Processor Exceptions Numbers  ------------------- */
  NonMaskableInt_IRQn               = -14, /*!<   2  Non maskable Interrupt, cannot be stopped or preempted    */
  HardFault_IRQn                    = -13, /*!<   3  Hard Fault, all classes of Fault                          */
                                
                                
                                
  SVCall_IRQn                       =  -5, /*!<  11  System Service Call via SVC instruction                   */
                                
  PendSV_IRQn                       =  -2, /*!<  14  Pendable request for system service                       */
  SysTick_IRQn                      =  -1, /*!<  15  System Tick Timer                                         */
// ---------------------------  LPC43xx/M0Sub Specific Interrupt Numbers  -------------------------
  M0S_RTC_IRQn                      =  0,  /*!<   0  RTC interrupt                                             */
  M0S_M4CORE_IRQn                   =  1,  /*!<   1  M4 core interrupt                                         */
  M0S_DMA_IRQn                      =  2,  /*!<   2  DMA interrupt                                             */
                                                   
