MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
  M0S_SGPIO_INPUT_IRQn              =  4,  /*!<   4  SGPIO input bit match interrupt                           */
  M0S_SGPIO_MATCH_IRQn              =  5,  /*!<   5  SGPIO pattern match interrupt                             */
  M0S_SGPIO_SHIFT_IRQn              =  6,  /*!<   6  SGPIO shift clock interrupt                               */
  M0S_SGPIO_POS_IRQn                =  7,  /*!<   7  SGPIO capture clock interrupt                             */
  M0S_USB0_IRQn                     =  8,  /*!<   8  OTG interrupt                                             */
  M0S_USB1_IRQn                     =  9,  /*!<   9  USB1 interrupt                                            */
  M0S_SCT_IRQn                      = 10,  /*!<  10  SCT combined interrupt                                     */
  M0S_RITIMER_IRQn                  = 11,  /*!<  11  RI timer interrupt                                        */
  M0S_GINT1_IRQn                    = 12,  /*!<  12  GPIO global interrupt 1                                   */
  M0S_TIMER1_IRQn                   = 13,  /*!<  13  Timer 1 interrupt                                         */
  M0S_TIMER2_IRQn                   = 14,  /*!<  14  Timer 2 interrupt                                         */
  M0S_PIN_INT5_IRQn                 = 15,  /*!<  15  GPIO pin interrupt 5                                      */
  M0S_MCPWM_IRQn                    = 16,  /*!<  16  Motor control PWM interrupt                               */
  M0S_ADC0_IRQn                     = 17,  /*!<  17  ADC0 interrupt                                            */
  M0S_I2C0_IRQn                     = 18,  /*!<  18  I2C0 interrupt                                            */
  M0S_I2C1_IRQn                     = 19,  /*!<  19  I2C1 interrupt                                            */
  M0S_SPI_IRQn                      = 20,  /*!<  20  SPI interrupt                                             */
  M0S_ADC1_IRQn                     = 21,  /*!<  21  ADC1 interrupt                                            */
  M0S_SSP0_OR_SSP1_IRQn             = 22,  /*!<  22  SSP0, SSP1 ORed interrupt                                 */
  M0S_EVENTROUTER_IRQn              = 23,  /*!<  23  Event router interrupt                                    */
  M0S_USART0_IRQn                   = 24,  /*!<  24  USART0 interrupt                                          */
  M0S_UART1_IRQn                    = 25,  /*!<  25  Modem/UART1 interrupt                                     */
  M0S_USART2_OR_C_CAN1_IRQn         = 26,  /*!<  26  USART2, C_CAN1 ORed interrupt                             */
  M0S_USART3_IRQn                   = 27,  /*!<  27  USART3 interrupt                                          */
  M0S_I2S0_OR_I2S1_OR_QEI_IRQn      = 28,  /*!<  28  I2S0, I2S1, QEI ORed interrupt                            */
  M0S_C_CAN0_IRQn                   = 29,  /*!<  29  C_CAN0 interrupt                                          */
  M0S_SPIFI_OR_ADCHS_IRQn           = 30,  /*!<  30  SPIFI, ADCHS ORed interrupt                               */
  M0S_M0APP_IRQn                    = 31,  /*!<  31  M0APP core interrupt                                      */
#endif
} IRQn_Type;

 /* Event Router Input (ERI) Number Definitions */
typedef enum {
  WAKEUP0_ERIn                      = 0,
  WAKEUP1_ERIn                      = 1,
  WAKEUP2_ERIn                      = 2,
  WAKEUP3_ERIn                      = 3,
  ATIMER_ERIn                       = 4,
  RTC_ERIn                          = 5,
  BOD1_ERIn                         = 6,  /* Bod trip 1 */
  WWDT_ERIn                         = 7,
  ETH_ERIn                          = 8,
  USB0_ERIn                         = 9,
  USB1_ERIn                         = 10,
  SDIO_ERIn                         = 11,
  CAN_ERIn                          = 12, /* CAN0/1 or'ed */
  TIM2_ERIn                         = 13,
  TIM6_ERIn                         = 14,
  QEI_ERIn                          = 15,
  TIM14_ERIn                        = 16,
  RESERVED0_ERIn                    = 17, /* M0s */
  RESERVED1_ERIn                    = 18, /* M3/M4 */
  RESET_ERIn                        = 19
}ERIn_Type;

/** @addtogroup Configuration_of_CMSIS
  * @{
  */


/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

#if defined CORE_M4
/* ----------------Configuration of the Cortex-M4 Processor and Core Peripherals---------------- */
#define __CM4_REV                 0x0000            /*!< Cortex-M4 Core Revision                                               */
#define __MPU_PRESENT                  1            /*!< MPU present or not                                                    */
#define __NVIC_PRIO_BITS               3            /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig         0            /*!< Set to 1 if different SysTick Config is used                          */
#define __FPU_PRESENT                  1            /*!< FPU present or not                                                    */

#include "core_cm4.h"                               /*!< Cortex-M4 processor and core peripherals                              */
#endif

#if defined CORE_M0 || defined CORE_M0SUB
/* ----------------Configuration of the Cortex-M0 Processor and Core Peripherals---------------- */
#define __MPU_PRESENT             0                 /*!< MPU present or not                                                    */
#define __NVIC_PRIO_BITS          2                 /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig    0                 /*!< Set to 1 if different SysTick Config is used                          */
#define __FPU_PRESENT             0                 /*!< FPU present or not                                                    */
#define __SOFTFP__ // Note: Added for MikroE implementation.

#include "core_cm0.h"                               /*!< Cortex-M4 processor and core peripherals                              */
#endif

/** @} */ /* End of group Configuration_of_CMSIS */
// Note: Changed for MikroE implementation.
//#include "system_LPC43xx.h"                         /*!< LPC43xx System                                                        */
#define __I volatile // Note: Added for MikroE implementation.
#define __O __I // Note: Added for MikroE implementation.
#define __IO __I // Note: Added for MikroE implementation.
#include <stdint.h>


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */


/** @addtogroup Device_Peripheral_Registers
  * @{
  */


/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif



/* ================================================================================ */
/* ================                       SCT                      ================ */
/* ================================================================================ */


/**
  * @brief State Configurable Timer (SCT) with dither engine  (SCT)
  */

typedef struct {                                    /*!< (@ 0x40000000) SCT Structure                                          */
  __IO uint32_t  CONFIG;                            /*!< (@ 0x40000000) SCT configuration register                             */
  __IO uint32_t  CTRL;                              /*!< (@ 0x40000004) SCT control register                                   */
  __IO uint32_t  LIMIT;                             /*!< (@ 0x40000008) SCT limit register                                     */
  __IO uint32_t  HALT;                              /*!< (@ 0x4000000C) SCT halt condition register                            */
  __IO uint32_t  STOP;                              /*!< (@ 0x40000010) SCT stop condition register                            */
  __IO uint32_t  START;                             /*!< (@ 0x40000014) SCT start condition register                           */
  __IO uint32_t  DITHER;                            /*!< (@ 0x40000018) SCT dither condition register                          */
  __I  uint32_t  RESERVED0[9];
  __IO uint32_t  COUNT;                             /*!< (@ 0x40000040) SCT counter register                                   */
  __IO uint32_t  STATE;                             /*!< (@ 0x40000044) SCT state register                                     */
  __I  uint32_t  INPUT;                             /*!< (@ 0x40000048) SCT input register                                     */
  __IO uint32_t  REGMODE;                           /*!< (@ 0x4000004C) SCT match/capture registers mode register              */
  __IO uint32_t  OUTPUT;                            /*!< (@ 0x40000050) SCT output register                                    */
  __IO uint32_t  OUTPUTDIRCTRL;                     /*!< (@ 0x40000054) SCT output counter direction control register          */
  __IO uint32_t  RES;                               /*!< (@ 0x40000058) SCT conflict resolution register                       */
  __IO uint32_t  DMAREQ0;                           /*!< (@ 0x4000005C) SCT DMA request 0 register                             */
  __IO uint32_t  DMAREQ1;                           /*!< (@ 0x40000060) SCT DMA request 1 register                             */
  __I  uint32_t  RESERVED1[35];
  __IO uint32_t  EVEN;                              /*!< (@ 0x400000F0) SCT event enable register                              */
  __IO uint32_t  EVFLAG;                            /*!< (@ 0x400000F4) SCT event flag register                                */
  __IO uint32_t  CONEN;                             /*!< (@ 0x400000F8) SCT conflict enable register                           */
  __IO uint32_t  CONFLAG;                           /*!< (@ 0x400000FC) SCT conflict flag register                             */
  
  union {
    __IO uint32_t  CAP0;                            /*!< (@ 0x40000100) SCT capture register of capture channel 0 to
                                                         15; REGMOD0 to REGMODE15 = 1                                          */
    __IO uint32_t  MATCH0;                          /*!< (@ 0x40000100) SCT match value register of match channels 0
                                                         to 15; REGMOD0 to REGMODE15 = 0                                       */
  };
  
  union {
    __IO uint32_t  CAP1;                            /*!< (@ 0x40000104) SCT capture register of capture channel 0 to
                                                         15; REGMOD0 to REGMODE15 = 1                                          */
    __IO uint32_t  MATCH1;                          /*!< (@ 0x40000104) SCT match value register of match channels 0
                                                         to 15; REGMOD0 to REGMODE15 = 0                                       */
  };
  
  union {
    __IO uint32_t  CAP2;                            /*!< (@ 0x40000108) SCT capture register of capture channel 0 to
                                                         15; REGMOD0 to REGMODE15 = 1                                          */
    __IO uint32_t  MATCH2;                          /*!< (@ 0x40000108) SCT match value register of match channels 0
                                                         to 15; REGMOD0 to REGMODE15 = 0                                       */
  };
  
  union {
    __IO uint32_t  CAP3;                            /*!< (@ 0x4000010C) SCT capture register of capture channel 0 to
                                                         15; REGMOD0 to REGMODE15 = 1                                          */
    __IO uint32_t  MATCH3;                          /*!< (@ 0x4000010C) SCT match value register of match channels 0
                                                         to 15; REGMOD0 to REGMODE15 = 0                                       */
  };
  
  union {
    __IO uint32_t  MATCH4;                          /*!< (@ 0x40000110) SCT match value register of match channels 0
                                                         to 15; REGMOD0 to REGMODE15 = 0                                       */
    __IO uint32_t  CAP4;                            /*!< (@ 0x40000110) SCT capture register of capture channel 0 to
                                                         15; REGMOD0 to REGMODE15 = 1                                          */
  };
  
  union {
    __IO uint32_t  CAP5;                            /*!< (@ 0x40000114) SCT capture register of capture channel 0 to
                                                         15; REGMOD0 to REGMODE15 = 1                                          */
    __IO uint32_t  MATCH5;                          /*!< (@ 0x40000114) SCT match value register of match channels 0
                                                         to 15; REGMOD0 to REGMODE15 = 0                                       */
  };
  
  union {
    __IO uint32_t  MATCH6;                          /*!< (@ 0x40000118) SCT match value register of match channels 0
                                                         to 15; REGMOD0 to REGMODE15 = 0                                       */
    __IO uint32_t  CAP6;                            /*!< (@ 0x40000118) SCT capture register of capture channel 0 to
                                                         15; REGMOD0 to REGMODE15 = 1                                          */
  };
  
  union {
    __IO uint32_t  MATCH7;                          /*!< (@ 0x4000011C) SCT match value register of match channels 0
                                                         to 15; REGMOD0 to REGMODE15 = 0                                       */
    __IO uint32_t  CAP7;                            /*!< (@ 0x4000011C) SCT capture register of capture channel 0 to
                                                         15; REGMOD0 to REGMODE15 = 1                                          */
  };
  
  union {
    __IO uint32_t  MATCH8;                          /*!< (@ 0x40000120) SCT match value register of match channels 0
                                                         to 15; REGMOD0 to REGMODE15 = 0                                       */
    __IO uint32_t  CAP8;                            /*!< (@ 0x40000120) SCT capture register of capture channel 0 to
                                                         15; REGMOD0 to REGMODE15 = 1                                          */
  };
  
  union {
    __IO uint32_t  MATCH9;                          /*!< (@ 0x40000124) SCT match value register of match channels 0
                                                         to 15; REGMOD0 to REGMODE15 = 0                                       */
    __IO uint32_t  CAP9;                            /*!< (@ 0x40000124) SCT capture register of capture channel 0 to
                                                         15; REGMOD0 to REGMODE15 = 1                                          */
  };
  
  union {
    __IO uint32_t  MATCH10;                         /*!< (@ 0x40000128) SCT match value register of match channels 0
                                                         to 15; REGMOD0 to REGMODE15 = 0                                       */
    __IO uint32_t  CAP10;                           /*!< (@ 0x40000128) SCT capture register of capture channel 0 to
                                                         15; REGMOD0 to REGMODE15 = 1                                          */
  };
  
  union {
    __IO uint32_t  MATCH11;                         /*!< (@ 0x4000012C) SCT match value register of match channels 0
                                                         to 15; REGMOD0 to REGMODE15 = 0                                       */
    __IO uint32_t  CAP11;                           /*!< (@ 0x4000012C) SCT capture register of capture channel 0 to
                                                         15; REGMOD0 to REGMODE15 = 1                                          */
  };
  
  union {
    __IO uint32_t  MATCH12;                         /*!< (@ 0x40000130) SCT match value register of match channels 0
                                                         to 15; REGMOD0 to REGMODE15 = 0                                       */
    __IO uint32_t  CAP12;                           /*!< (@ 0x40000130) SCT capture register of capture channel 0 to
                                                         15; REGMOD0 to REGMODE15 = 1                                          */
  };
  
  union {
    __IO uint32_t  CAP13;                           /*!< (@ 0x40000134) SCT capture register of capture channel 0 to
                                                         15; REGMOD0 to REGMODE15 = 1                                          */
    __IO uint32_t  MATCH13;                         /*!< (@ 0x40000134) SCT match value register of match channels 0
                                                         to 15; REGMOD0 to REGMODE15 = 0                                       */
  };
  
  union {
    __IO uint32_t  MATCH14;                         /*!< (@ 0x40000138) SCT match value register of match channels 0
                                                         to 15; REGMOD0 to REGMODE15 = 0                                       */
    __IO uint32_t  CAP14;                           /*!< (@ 0x40000138) SCT capture register of capture channel 0 to
                                                         15; REGMOD0 to REGMODE15 = 1                                          */
  };
  
  union {
    __IO uint32_t  CAP15;                           /*!< (@ 0x4000013C) SCT capture register of capture channel 0 to
                                                         15; REGMOD0 to REGMODE15 = 1                                          */
    __IO uint32_t  MATCH15;                         /*!< (@ 0x4000013C) SCT match value register of match channels 0
                                                         to 15; REGMOD0 to REGMODE15 = 0                                       */
  };
  __IO uint32_t  FRACMAT0;                          /*!< (@ 0x40000140) Fractional match registers 0 to 5 for SCT match
                                                         value registers 0 to 5.                                               */
  __IO uint32_t  FRACMAT1;                          /*!< (@ 0x40000144) Fractional match registers 0 to 5 for SCT match
                                                         value registers 0 to 5.                                               */
  __IO uint32_t  FRACMAT2;                          /*!< (@ 0x40000148) Fractional match registers 0 to 5 for SCT match
                                                         value registers 0 to 5.                                               */
  __IO uint32_t  FRACMAT3;                          /*!< (@ 0x4000014C) Fractional match registers 0 to 5 for SCT match
                                                         value registers 0 to 5.                                               */
  __IO uint32_t  FRACMAT4;                          /*!< (@ 0x40000150) Fractional match registers 0 to 5 for SCT match
                                                         value registers 0 to 5.                                               */
  __IO uint32_t  FRACMAT5;                          /*!< (@ 0x40000154) Fractional match registers 0 to 5 for SCT match
                                                         value registers 0 to 5.                                               */
  __I  uint32_t  RESERVED2[42];
  
  union {
    __IO uint32_t  CAPCTRL0;                        /*!< (@ 0x40000200) SCT capture control register 0 to 15; REGMOD0
                                                         = 1 to REGMODE15 = 1                                                  */
    __IO uint32_t  MATCHREL0;                       /*!< (@ 0x40000200) SCT match reload value register 0 to 15; REGMOD0
                                                         = 0 to REGMODE15 = 0                                                  */
  };
  
  union {
    __IO uint32_t  MATCHREL1;                       /*!< (@ 0x40000204) SCT match reload value register 0 to 15; REGMOD0
                                                         = 0 to REGMODE15 = 0                                                  */
    __IO uint32_t  CAPCTRL1;                        /*!< (@ 0x40000204) SCT capture control register 0 to 15; REGMOD0
                                                         = 1 to REGMODE15 = 1                                                  */
  };
  
  union {
    __IO uint32_t  CAPCTRL2;                        /*!< (@ 0x40000208) SCT capture control register 0 to 15; REGMOD0
                                                         = 1 to REGMODE15 = 1                                                  */
    __IO uint32_t  MATCHREL2;                       /*!< (@ 0x40000208) SCT match reload value register 0 to 15; REGMOD0
                                                         = 0 to REGMODE15 = 0                                                  */
  };
  
  union {
    __IO uint32_t  MATCHREL3;                       /*!< (@ 0x4000020C) SCT match reload value register 0 to 15; REGMOD0
                                                         = 0 to REGMODE15 = 0                                                  */
    __IO uint32_t  CAPCTRL3;                        /*!< (@ 0x4000020C) SCT capture control register 0 to 15; REGMOD0
                                                         = 1 to REGMODE15 = 1                                                  */
  };
  
  union {
    __IO uint32_t  CAPCTRL4;                        /*!< (@ 0x40000210) SCT capture control register 0 to 15; REGMOD0
                                                         = 1 to REGMODE15 = 1                                                  */
    __IO uint32_t  MATCHREL4;                       /*!< (@ 0x40000210) SCT match reload value register 0 to 15; REGMOD0
                                                         = 0 to REGMODE15 = 0                                                  */
  };
  
  union {
    __IO uint32_t  CAPCTRL5;                        /*!< (@ 0x40000214) SCT capture control register 0 to 15; REGMOD0
                                                         = 1 to REGMODE15 = 1                                                  */
    __IO uint32_t  MATCHREL5;                       /*!< (@ 0x40000214) SCT match reload value register 0 to 15; REGMOD0
                                                         = 0 to REGMODE15 = 0                                                  */
  };
  
  union {
    __IO uint32_t  MATCHREL6;                       /*!< (@ 0x40000218) SCT match reload value register 0 to 15; REGMOD0
                                                         = 0 to REGMODE15 = 0                                                  */
    __IO uint32_t  CAPCTRL6;                        /*!< (@ 0x40000218) SCT capture control register 0 to 15; REGMOD0
                                                         = 1 to REGMODE15 = 1                                                  */
  };
  
