MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
  union {
    __IO uint32_t  CAPCTRL7;                        /*!< (@ 0x4000021C) SCT capture control register 0 to 15; REGMOD0
                                                         = 1 to REGMODE15 = 1                                                  */
    __IO uint32_t  MATCHREL7;                       /*!< (@ 0x4000021C) SCT match reload value register 0 to 15; REGMOD0
                                                         = 0 to REGMODE15 = 0                                                  */
  };
  
  union {
    __IO uint32_t  MATCHREL8;                       /*!< (@ 0x40000220) SCT match reload value register 0 to 15; REGMOD0
                                                         = 0 to REGMODE15 = 0                                                  */
    __IO uint32_t  CAPCTRL8;                        /*!< (@ 0x40000220) SCT capture control register 0 to 15; REGMOD0
                                                         = 1 to REGMODE15 = 1                                                  */
  };
  
  union {
    __IO uint32_t  CAPCTRL9;                        /*!< (@ 0x40000224) SCT capture control register 0 to 15; REGMOD0
                                                         = 1 to REGMODE15 = 1                                                  */
    __IO uint32_t  MATCHREL9;                       /*!< (@ 0x40000224) SCT match reload value register 0 to 15; REGMOD0
                                                         = 0 to REGMODE15 = 0                                                  */
  };
  
  union {
    __IO uint32_t  MATCHREL10;                      /*!< (@ 0x40000228) SCT match reload value register 0 to 15; REGMOD0
                                                         = 0 to REGMODE15 = 0                                                  */
    __IO uint32_t  CAPCTRL10;                       /*!< (@ 0x40000228) SCT capture control register 0 to 15; REGMOD0
                                                         = 1 to REGMODE15 = 1                                                  */
  };
  
  union {
    __IO uint32_t  MATCHREL11;                      /*!< (@ 0x4000022C) SCT match reload value register 0 to 15; REGMOD0
                                                         = 0 to REGMODE15 = 0                                                  */
    __IO uint32_t  CAPCTRL11;                       /*!< (@ 0x4000022C) SCT capture control register 0 to 15; REGMOD0
                                                         = 1 to REGMODE15 = 1                                                  */
  };
  
  union {
    __IO uint32_t  MATCHREL12;                      /*!< (@ 0x40000230) SCT match reload value register 0 to 15; REGMOD0
                                                         = 0 to REGMODE15 = 0                                                  */
    __IO uint32_t  CAPCTRL12;                       /*!< (@ 0x40000230) SCT capture control register 0 to 15; REGMOD0
                                                         = 1 to REGMODE15 = 1                                                  */
  };
  
  union {
    __IO uint32_t  CAPCTRL13;                       /*!< (@ 0x40000234) SCT capture control register 0 to 15; REGMOD0
                                                         = 1 to REGMODE15 = 1                                                  */
    __IO uint32_t  MATCHREL13;                      /*!< (@ 0x40000234) SCT match reload value register 0 to 15; REGMOD0
                                                         = 0 to REGMODE15 = 0                                                  */
  };
  
  union {
    __IO uint32_t  CAPCTRL14;                       /*!< (@ 0x40000238) SCT capture control register 0 to 15; REGMOD0
                                                         = 1 to REGMODE15 = 1                                                  */
    __IO uint32_t  MATCHREL14;                      /*!< (@ 0x40000238) SCT match reload value register 0 to 15; REGMOD0
                                                         = 0 to REGMODE15 = 0                                                  */
  };
  
  union {
    __IO uint32_t  CAPCTRL15;                       /*!< (@ 0x4000023C) SCT capture control register 0 to 15; REGMOD0
                                                         = 1 to REGMODE15 = 1                                                  */
    __IO uint32_t  MATCHREL15;                      /*!< (@ 0x4000023C) SCT match reload value register 0 to 15; REGMOD0
                                                         = 0 to REGMODE15 = 0                                                  */
  };
  __IO uint32_t  FRACMATREL0;                       /*!< (@ 0x40000240) Fractional match reload registers 0 to 5 for
                                                         SCT match value registers 0 to 5.                                     */
  __IO uint32_t  FRACMATREL1;                       /*!< (@ 0x40000244) Fractional match reload registers 0 to 5 for
                                                         SCT match value registers 0 to 5.                                     */
  __IO uint32_t  FRACMATREL2;                       /*!< (@ 0x40000248) Fractional match reload registers 0 to 5 for
                                                         SCT match value registers 0 to 5.                                     */
  __IO uint32_t  FRACMATREL3;                       /*!< (@ 0x4000024C) Fractional match reload registers 0 to 5 for
                                                         SCT match value registers 0 to 5.                                     */
  __IO uint32_t  FRACMATREL4;                       /*!< (@ 0x40000250) Fractional match reload registers 0 to 5 for
                                                         SCT match value registers 0 to 5.                                     */
  __IO uint32_t  FRACMATREL5;                       /*!< (@ 0x40000254) Fractional match reload registers 0 to 5 for
                                                         SCT match value registers 0 to 5.                                     */
  __I  uint32_t  RESERVED3[42];
  __IO uint32_t  EV0_STATE;                         /*!< (@ 0x40000300) SCT event state register 0                             */
  __IO uint32_t  EV0_CTRL;                          /*!< (@ 0x40000304) SCT event control register 0                           */
  __IO uint32_t  EV1_STATE;                         /*!< (@ 0x40000308) SCT event state register 0                             */
  __IO uint32_t  EV1_CTRL;                          /*!< (@ 0x4000030C) SCT event control register 0                           */
  __IO uint32_t  EV2_STATE;                         /*!< (@ 0x40000310) SCT event state register 0                             */
  __IO uint32_t  EV2_CTRL;                          /*!< (@ 0x40000314) SCT event control register 0                           */
  __IO uint32_t  EV3_STATE;                         /*!< (@ 0x40000318) SCT event state register 0                             */
  __IO uint32_t  EV3_CTRL;                          /*!< (@ 0x4000031C) SCT event control register 0                           */
  __IO uint32_t  EV4_STATE;                         /*!< (@ 0x40000320) SCT event state register 0                             */
  __IO uint32_t  EV4_CTRL;                          /*!< (@ 0x40000324) SCT event control register 0                           */
  __IO uint32_t  EV5_STATE;                         /*!< (@ 0x40000328) SCT event state register 0                             */
  __IO uint32_t  EV5_CTRL;                          /*!< (@ 0x4000032C) SCT event control register 0                           */
  __IO uint32_t  EV6_STATE;                         /*!< (@ 0x40000330) SCT event state register 0                             */
  __IO uint32_t  EV6_CTRL;                          /*!< (@ 0x40000334) SCT event control register 0                           */
  __IO uint32_t  EV7_STATE;                         /*!< (@ 0x40000338) SCT event state register 0                             */
  __IO uint32_t  EV7_CTRL;                          /*!< (@ 0x4000033C) SCT event control register 0                           */
  __IO uint32_t  EV8_STATE;                         /*!< (@ 0x40000340) SCT event state register 0                             */
  __IO uint32_t  EV8_CTRL;                          /*!< (@ 0x40000344) SCT event control register 0                           */
  __IO uint32_t  EV9_STATE;                         /*!< (@ 0x40000348) SCT event state register 0                             */
  __IO uint32_t  EV9_CTRL;                          /*!< (@ 0x4000034C) SCT event control register 0                           */
  __IO uint32_t  EV10_STATE;                        /*!< (@ 0x40000350) SCT event state register 0                             */
  __IO uint32_t  EV10_CTRL;                         /*!< (@ 0x40000354) SCT event control register 0                           */
  __IO uint32_t  EV11_STATE;                        /*!< (@ 0x40000358) SCT event state register 0                             */
  __IO uint32_t  EV11_CTRL;                         /*!< (@ 0x4000035C) SCT event control register 0                           */
  __IO uint32_t  EV12_STATE;                        /*!< (@ 0x40000360) SCT event state register 0                             */
  __IO uint32_t  EV12_CTRL;                         /*!< (@ 0x40000364) SCT event control register 0                           */
  __IO uint32_t  EV13_STATE;                        /*!< (@ 0x40000368) SCT event state register 0                             */
  __IO uint32_t  EV13_CTRL;                         /*!< (@ 0x4000036C) SCT event control register 0                           */
  __IO uint32_t  EV14_STATE;                        /*!< (@ 0x40000370) SCT event state register 0                             */
  __IO uint32_t  EV14_CTRL;                         /*!< (@ 0x40000374) SCT event control register 0                           */
  __IO uint32_t  EV15_STATE;                        /*!< (@ 0x40000378) SCT event state register 0                             */
  __IO uint32_t  EV15_CTRL;                         /*!< (@ 0x4000037C) SCT event control register 0                           */
  __I  uint32_t  RESERVED4[96];
  __IO uint32_t  OUT0_SET;                          /*!< (@ 0x40000500) SCT output 0 set register                              */
  __IO uint32_t  OUT0_CLR;                          /*!< (@ 0x40000504) SCT output 0 clear register                            */
  __IO uint32_t  OUT1_SET;                          /*!< (@ 0x40000508) SCT output 0 set register                              */
  __IO uint32_t  OUT1_CLR;                          /*!< (@ 0x4000050C) SCT output 0 clear register                            */
  __IO uint32_t  OUT2_SET;                          /*!< (@ 0x40000510) SCT output 0 set register                              */
  __IO uint32_t  OUT2_CLR;                          /*!< (@ 0x40000514) SCT output 0 clear register                            */
  __IO uint32_t  OUT3_SET;                          /*!< (@ 0x40000518) SCT output 0 set register                              */
  __IO uint32_t  OUT3_CLR;                          /*!< (@ 0x4000051C) SCT output 0 clear register                            */
  __IO uint32_t  OUT4_SET;                          /*!< (@ 0x40000520) SCT output 0 set register                              */
  __IO uint32_t  OUT4_CLR;                          /*!< (@ 0x40000524) SCT output 0 clear register                            */
  __IO uint32_t  OUT5_SET;                          /*!< (@ 0x40000528) SCT output 0 set register                              */
  __IO uint32_t  OUT5_CLR;                          /*!< (@ 0x4000052C) SCT output 0 clear register                            */
  __IO uint32_t  OUT6_SET;                          /*!< (@ 0x40000530) SCT output 0 set register                              */
  __IO uint32_t  OUT6_CLR;                          /*!< (@ 0x40000534) SCT output 0 clear register                            */
  __IO uint32_t  OUT7_SET;                          /*!< (@ 0x40000538) SCT output 0 set register                              */
  __IO uint32_t  OUT7_CLR;                          /*!< (@ 0x4000053C) SCT output 0 clear register                            */
  __IO uint32_t  OUT8_SET;                          /*!< (@ 0x40000540) SCT output 0 set register                              */
  __IO uint32_t  OUT8_CLR;                          /*!< (@ 0x40000544) SCT output 0 clear register                            */
  __IO uint32_t  OUT9_SET;                          /*!< (@ 0x40000548) SCT output 0 set register                              */
  __IO uint32_t  OUT9_CLR;                          /*!< (@ 0x4000054C) SCT output 0 clear register                            */
  __IO uint32_t  OUT10_SET;                         /*!< (@ 0x40000550) SCT output 0 set register                              */
  __IO uint32_t  OUT10_CLR;                         /*!< (@ 0x40000554) SCT output 0 clear register                            */
  __IO uint32_t  OUT11_SET;                         /*!< (@ 0x40000558) SCT output 0 set register                              */
  __IO uint32_t  OUT11_CLR;                         /*!< (@ 0x4000055C) SCT output 0 clear register                            */
  __IO uint32_t  OUT12_SET;                         /*!< (@ 0x40000560) SCT output 0 set register                              */
  __IO uint32_t  OUT12_CLR;                         /*!< (@ 0x40000564) SCT output 0 clear register                            */
  __IO uint32_t  OUT13_SET;                         /*!< (@ 0x40000568) SCT output 0 set register                              */
  __IO uint32_t  OUT13_CLR;                         /*!< (@ 0x4000056C) SCT output 0 clear register                            */
  __IO uint32_t  OUT14_SET;                         /*!< (@ 0x40000570) SCT output 0 set register                              */
  __IO uint32_t  OUT14_CLR;                         /*!< (@ 0x40000574) SCT output 0 clear register                            */
  __IO uint32_t  OUT15_SET;                         /*!< (@ 0x40000578) SCT output 0 set register                              */
  __IO uint32_t  OUT15_CLR;                         /*!< (@ 0x4000057C) SCT output 0 clear register                            */
} LPC_SCT_Type;


/* ================================================================================ */
/* ================                      GPDMA                     ================ */
/* ================================================================================ */


/**
  * @brief General Purpose DMA (GPDMA)  (GPDMA)
  */

