MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
typedef struct {                                    /*!< (@ 0x40002000) GPDMA Structure                                        */
  __I  uint32_t  INTSTAT;                           /*!< (@ 0x40002000) DMA Interrupt Status Register                          */
  __I  uint32_t  INTTCSTAT;                         /*!< (@ 0x40002004) DMA Interrupt Terminal Count Request Status Register   */
  __O  uint32_t  INTTCCLEAR;                        /*!< (@ 0x40002008) DMA Interrupt Terminal Count Request Clear Register    */
  __I  uint32_t  INTERRSTAT;                        /*!< (@ 0x4000200C) DMA Interrupt Error Status Register                    */
  __O  uint32_t  INTERRCLR;                         /*!< (@ 0x40002010) DMA Interrupt Error Clear Register                     */
  __I  uint32_t  RAWINTTCSTAT;                      /*!< (@ 0x40002014) DMA Raw Interrupt Terminal Count Status Register       */
  __I  uint32_t  RAWINTERRSTAT;                     /*!< (@ 0x40002018) DMA Raw Error Interrupt Status Register                */
  __I  uint32_t  ENBLDCHNS;                         /*!< (@ 0x4000201C) DMA Enabled Channel Register                           */
  __IO uint32_t  SOFTBREQ;                          /*!< (@ 0x40002020) DMA Software Burst Request Register                    */
  __IO uint32_t  SOFTSREQ;                          /*!< (@ 0x40002024) DMA Software Single Request Register                   */
  __IO uint32_t  SOFTLBREQ;                         /*!< (@ 0x40002028) DMA Software Last Burst Request Register               */
  __IO uint32_t  SOFTLSREQ;                         /*!< (@ 0x4000202C) DMA Software Last Single Request Register              */
  __IO uint32_t  CONFIG;                            /*!< (@ 0x40002030) DMA Configuration Register                             */
  __IO uint32_t  SYNC;                              /*!< (@ 0x40002034) DMA Synchronization Register                           */
  __I  uint32_t  RESERVED0[50];
  __IO uint32_t  C0SRCADDR;                         /*!< (@ 0x40002100) DMA Channel Source Address Register                    */
  __IO uint32_t  C0DESTADDR;                        /*!< (@ 0x40002104) DMA Channel Destination Address Register               */
  __IO uint32_t  C0LLI;                             /*!< (@ 0x40002108) DMA Channel Linked List Item Register                  */
  __IO uint32_t  C0CONTROL;                         /*!< (@ 0x4000210C) DMA Channel Control Register                           */
  __IO uint32_t  C0CONFIG;                          /*!< (@ 0x40002110) DMA Channel Configuration Register                     */
  __I  uint32_t  RESERVED1[3];
  __IO uint32_t  C1SRCADDR;                         /*!< (@ 0x40002120) DMA Channel Source Address Register                    */
  __IO uint32_t  C1DESTADDR;                        /*!< (@ 0x40002124) DMA Channel Destination Address Register               */
  __IO uint32_t  C1LLI;                             /*!< (@ 0x40002128) DMA Channel Linked List Item Register                  */
  __IO uint32_t  C1CONTROL;                         /*!< (@ 0x4000212C) DMA Channel Control Register                           */
  __IO uint32_t  C1CONFIG;                          /*!< (@ 0x40002130) DMA Channel Configuration Register                     */
  __I  uint32_t  RESERVED2[3];
  __IO uint32_t  C2SRCADDR;                         /*!< (@ 0x40002140) DMA Channel Source Address Register                    */
  __IO uint32_t  C2DESTADDR;                        /*!< (@ 0x40002144) DMA Channel Destination Address Register               */
  __IO uint32_t  C2LLI;                             /*!< (@ 0x40002148) DMA Channel Linked List Item Register                  */
  __IO uint32_t  C2CONTROL;                         /*!< (@ 0x4000214C) DMA Channel Control Register                           */
  __IO uint32_t  C2CONFIG;                          /*!< (@ 0x40002150) DMA Channel Configuration Register                     */
  __I  uint32_t  RESERVED3[3];
  __IO uint32_t  C3SRCADDR;                         /*!< (@ 0x40002160) DMA Channel Source Address Register                    */
  __IO uint32_t  C3DESTADDR;                        /*!< (@ 0x40002164) DMA Channel Destination Address Register               */
  __IO uint32_t  C3LLI;                             /*!< (@ 0x40002168) DMA Channel Linked List Item Register                  */
  __IO uint32_t  C3CONTROL;                         /*!< (@ 0x4000216C) DMA Channel Control Register                           */
  __IO uint32_t  C3CONFIG;                          /*!< (@ 0x40002170) DMA Channel Configuration Register                     */
  __I  uint32_t  RESERVED4[3];
  __IO uint32_t  C4SRCADDR;                         /*!< (@ 0x40002180) DMA Channel Source Address Register                    */
  __IO uint32_t  C4DESTADDR;                        /*!< (@ 0x40002184) DMA Channel Destination Address Register               */
  __IO uint32_t  C4LLI;                             /*!< (@ 0x40002188) DMA Channel Linked List Item Register                  */
  __IO uint32_t  C4CONTROL;                         /*!< (@ 0x4000218C) DMA Channel Control Register                           */
  __IO uint32_t  C4CONFIG;                          /*!< (@ 0x40002190) DMA Channel Configuration Register                     */
  __I  uint32_t  RESERVED5[3];
  __IO uint32_t  C5SRCADDR;                         /*!< (@ 0x400021A0) DMA Channel Source Address Register                    */
  __IO uint32_t  C5DESTADDR;                        /*!< (@ 0x400021A4) DMA Channel Destination Address Register               */
  __IO uint32_t  C5LLI;                             /*!< (@ 0x400021A8) DMA Channel Linked List Item Register                  */
  __IO uint32_t  C5CONTROL;                         /*!< (@ 0x400021AC) DMA Channel Control Register                           */
  __IO uint32_t  C5CONFIG;                          /*!< (@ 0x400021B0) DMA Channel Configuration Register                     */
  __I  uint32_t  RESERVED6[3];
  __IO uint32_t  C6SRCADDR;                         /*!< (@ 0x400021C0) DMA Channel Source Address Register                    */
  __IO uint32_t  C6DESTADDR;                        /*!< (@ 0x400021C4) DMA Channel Destination Address Register               */
  __IO uint32_t  C6LLI;                             /*!< (@ 0x400021C8) DMA Channel Linked List Item Register                  */
  __IO uint32_t  C6CONTROL;                         /*!< (@ 0x400021CC) DMA Channel Control Register                           */
  __IO uint32_t  C6CONFIG;                          /*!< (@ 0x400021D0) DMA Channel Configuration Register                     */
  __I  uint32_t  RESERVED7[3];
  __IO uint32_t  C7SRCADDR;                         /*!< (@ 0x400021E0) DMA Channel Source Address Register                    */
  __IO uint32_t  C7DESTADDR;                        /*!< (@ 0x400021E4) DMA Channel Destination Address Register               */
  __IO uint32_t  C7LLI;                             /*!< (@ 0x400021E8) DMA Channel Linked List Item Register                  */
  __IO uint32_t  C7CONTROL;                         /*!< (@ 0x400021EC) DMA Channel Control Register                           */
  __IO uint32_t  C7CONFIG;                          /*!< (@ 0x400021F0) DMA Channel Configuration Register                     */
} LPC_GPDMA_Type;


/* ================================================================================ */
/* ================                      SPIFI                     ================ */
/* ================================================================================ */


/**
  * @brief SPI Flash Interface (SPIFI) (SPIFI)
  */

