MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
typedef struct {                                    /*!< (@ 0x40003000) SPIFI Structure                                        */
  __IO uint32_t  CTRL;                              /*!< (@ 0x40003000) SPIFI control register                                 */
  __IO uint32_t  CMD;                               /*!< (@ 0x40003004) SPIFI command register                                 */
  __IO uint32_t  ADDR;                              /*!< (@ 0x40003008) SPIFI address register                                 */
  __IO uint32_t  IDATA;                             /*!< (@ 0x4000300C) SPIFI intermediate data register                       */
  __IO uint32_t  CLIMIT;                            /*!< (@ 0x40003010) SPIFI cache limit register                             */
  __IO uint32_t  DATA;                              /*!< (@ 0x40003014) SPIFI data register                                    */
  __IO uint32_t  MCMD;                              /*!< (@ 0x40003018) SPIFI memory command register                          */
  __IO uint32_t  STAT;                              /*!< (@ 0x4000301C) SPIFI status register                                  */
} LPC_SPIFI_Type;


/* ================================================================================ */
/* ================                      SDMMC                     ================ */
/* ================================================================================ */


/**
  * @brief SD/MMC (SDMMC)
  */

typedef struct {                                    /*!< (@ 0x40004000) SDMMC Structure                                        */
  __IO uint32_t  CTRL;                              /*!< (@ 0x40004000) Control Register                                       */
  __IO uint32_t  PWREN;                             /*!< (@ 0x40004004) Power Enable Register                                  */
  __IO uint32_t  CLKDIV;                            /*!< (@ 0x40004008) Clock Divider Register                                 */
  __IO uint32_t  CLKSRC;                            /*!< (@ 0x4000400C) SD Clock Source Register                               */
  __IO uint32_t  CLKENA;                            /*!< (@ 0x40004010) Clock Enable Register                                  */
  __IO uint32_t  TMOUT;                             /*!< (@ 0x40004014) Time-out Register                                      */
  __IO uint32_t  CTYPE;                             /*!< (@ 0x40004018) Card Type Register                                     */
  __IO uint32_t  BLKSIZ;                            /*!< (@ 0x4000401C) Block Size Register                                    */
  __IO uint32_t  BYTCNT;                            /*!< (@ 0x40004020) Byte Count Register                                    */
  __IO uint32_t  INTMASK;                           /*!< (@ 0x40004024) Interrupt Mask Register                                */
  __IO uint32_t  CMDARG;                            /*!< (@ 0x40004028) Command Argument Register                              */
  __IO uint32_t  CMD;                               /*!< (@ 0x4000402C) Command Register                                       */
  __I  uint32_t  RESP0;                             /*!< (@ 0x40004030) Response Register 0                                    */
  __I  uint32_t  RESP1;                             /*!< (@ 0x40004034) Response Register 1                                    */
  __I  uint32_t  RESP2;                             /*!< (@ 0x40004038) Response Register 2                                    */
  __I  uint32_t  RESP3;                             /*!< (@ 0x4000403C) Response Register 3                                    */
  __I  uint32_t  MINTSTS;                           /*!< (@ 0x40004040) Masked Interrupt Status Register                       */
  __IO uint32_t  RINTSTS;                           /*!< (@ 0x40004044) Raw Interrupt Status Register                          */
  __I  uint32_t  STATUS;                            /*!< (@ 0x40004048) Status Register                                        */
  __IO uint32_t  FIFOTH;                            /*!< (@ 0x4000404C) FIFO Threshold Watermark Register                      */
  __I  uint32_t  CDETECT;                           /*!< (@ 0x40004050) Card Detect Register                                   */
  __I  uint32_t  WRTPRT;                            /*!< (@ 0x40004054) Write Protect Register                                 */
  __I  uint32_t  RESERVED0;
  __I  uint32_t  TCBCNT;                            /*!< (@ 0x4000405C) Transferred CIU Card Byte Count Register               */
  __I  uint32_t  TBBCNT;                            /*!< (@ 0x40004060) Transferred Host to BIU-FIFO Byte Count Register       */
  __IO uint32_t  DEBNCE;                            /*!< (@ 0x40004064) Debounce Count Register                                */
  __I  uint32_t  RESERVED1[4];
  __IO uint32_t  RST_N;                             /*!< (@ 0x40004078) Hardware Reset                                         */
  __I  uint32_t  RESERVED2;
  __IO uint32_t  BMOD;                              /*!< (@ 0x40004080) Bus Mode Register                                      */
  __O  uint32_t  PLDMND;                            /*!< (@ 0x40004084) Poll Demand Register                                   */
  __IO uint32_t  DBADDR;                            /*!< (@ 0x40004088) Descriptor List Base Address Register                  */
  __IO uint32_t  IDSTS;                             /*!< (@ 0x4000408C) Internal DMAC Status Register                          */
  __IO uint32_t  IDINTEN;                           /*!< (@ 0x40004090) Internal DMAC Interrupt Enable Register                */
  __I  uint32_t  DSCADDR;                           /*!< (@ 0x40004094) Current Host Descriptor Address Register               */
  __I  uint32_t  BUFADDR;                           /*!< (@ 0x40004098) Current Buffer Descriptor Address Register             */
} LPC_SDMMC_Type;


/* ================================================================================ */
/* ================                       EMC                      ================ */
/* ================================================================================ */


/**
  * @brief External Memory Controller (EMC)  (EMC)
  */

typedef struct {                                    /*!< (@ 0x40005000) EMC Structure                                          */
  __IO uint32_t  CONTROL;                           /*!< (@ 0x40005000) Controls operation of the memory controller.           */
  __I  uint32_t  STATUS;                            /*!< (@ 0x40005004) Provides EMC status information.                       */
  __IO uint32_t  CONFIG;                            /*!< (@ 0x40005008) Configures operation of the memory controller.         */
  __I  uint32_t  RESERVED0[5];
  __IO uint32_t  DYNAMICCONTROL;                    /*!< (@ 0x40005020) Controls dynamic memory operation.                     */
  __IO uint32_t  DYNAMICREFRESH;                    /*!< (@ 0x40005024) Configures dynamic memory refresh operation.           */
  __IO uint32_t  DYNAMICREADCONFIG;                 /*!< (@ 0x40005028) Configures the dynamic memory read strategy.           */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  DYNAMICRP;                         /*!< (@ 0x40005030) Selects the precharge command period.                  */
  __IO uint32_t  DYNAMICRAS;                        /*!< (@ 0x40005034) Selects the active to precharge command period.        */
  __IO uint32_t  DYNAMICSREX;                       /*!< (@ 0x40005038) Selects the self-refresh exit time.                    */
  __IO uint32_t  DYNAMICAPR;                        /*!< (@ 0x4000503C) Selects the last-data-out to active command time.      */
  __IO uint32_t  DYNAMICDAL;                        /*!< (@ 0x40005040) Selects the data-in to active command time.            */
  __IO uint32_t  DYNAMICWR;                         /*!< (@ 0x40005044) Selects the write recovery time.                       */
  __IO uint32_t  DYNAMICRC;                         /*!< (@ 0x40005048) Selects the active to active command period.           */
  __IO uint32_t  DYNAMICRFC;                        /*!< (@ 0x4000504C) Selects the auto-refresh period.                       */
  __IO uint32_t  DYNAMICXSR;                        /*!< (@ 0x40005050) Selects the exit self-refresh to active command
                                                         time.                                                                 */
  __IO uint32_t  DYNAMICRRD;                        /*!< (@ 0x40005054) Selects the active bank A to active bank B latency.    */
  __IO uint32_t  DYNAMICMRD;                        /*!< (@ 0x40005058) Selects the load mode register to active command
                                                         time.                                                                 */
  __I  uint32_t  RESERVED2[9];
  __IO uint32_t  STATICEXTENDEDWAIT;                /*!< (@ 0x40005080) Selects time for long static memory read and
                                                         write transfers.                                                      */
  __I  uint32_t  RESERVED3[31];
  __IO uint32_t  DYNAMICCONFIG0;                    /*!< (@ 0x40005100) Selects the configuration information for dynamic
                                                         memory chip select 0.                                                 */
  __IO uint32_t  DYNAMICRASCAS0;                    /*!< (@ 0x40005104) Selects the RAS and CAS latencies for dynamic
                                                         memory chip select 0.                                                 */
  __I  uint32_t  RESERVED4[6];
  __IO uint32_t  DYNAMICCONFIG1;                    /*!< (@ 0x40005120) Selects the configuration information for dynamic
                                                         memory chip select 0.                                                 */
  __IO uint32_t  DYNAMICRASCAS1;                    /*!< (@ 0x40005124) Selects the RAS and CAS latencies for dynamic
                                                         memory chip select 0.                                                 */
  __I  uint32_t  RESERVED5[6];
  __IO uint32_t  DYNAMICCONFIG2;                    /*!< (@ 0x40005140) Selects the configuration information for dynamic
                                                         memory chip select 0.                                                 */
  __IO uint32_t  DYNAMICRASCAS2;                    /*!< (@ 0x40005144) Selects the RAS and CAS latencies for dynamic
                                                         memory chip select 0.                                                 */
  __I  uint32_t  RESERVED6[6];
  __IO uint32_t  DYNAMICCONFIG3;                    /*!< (@ 0x40005160) Selects the configuration information for dynamic
                                                         memory chip select 0.                                                 */
  __IO uint32_t  DYNAMICRASCAS3;                    /*!< (@ 0x40005164) Selects the RAS and CAS latencies for dynamic
                                                         memory chip select 0.                                                 */
  __I  uint32_t  RESERVED7[38];
  __IO uint32_t  STATICCONFIG0;                     /*!< (@ 0x40005200) Selects the memory configuration for static chip
                                                         select 0.                                                             */
  __IO uint32_t  STATICWAITWEN0;                    /*!< (@ 0x40005204) Selects the delay from chip select 0 to write
                                                         enable.                                                               */
  __IO uint32_t  STATICWAITOEN0;                    /*!< (@ 0x40005208) Selects the delay from chip select 0 or address
                                                         change, whichever is later, to output enable.                         */
  __IO uint32_t  STATICWAITRD0;                     /*!< (@ 0x4000520C) Selects the delay from chip select 0 to a read
                                                         access.                                                               */
  __IO uint32_t  STATICWAITPAGE0;                   /*!< (@ 0x40005210) Selects the delay for asynchronous page mode
                                                         sequential accesses for chip select 0.                                */
  __IO uint32_t  STATICWAITWR0;                     /*!< (@ 0x40005214) Selects the delay from chip select 0 to a write
                                                         access.                                                               */
  __IO uint32_t  STATICWAITTURN0;                   /*!< (@ 0x40005218) Selects the number of bus turnaround cycles for
                                                         chip select 0.                                                        */
  __I  uint32_t  RESERVED8;
  __IO uint32_t  STATICCONFIG1;                     /*!< (@ 0x40005220) Selects the memory configuration for static chip
                                                         select 0.                                                             */
  __IO uint32_t  STATICWAITWEN1;                    /*!< (@ 0x40005224) Selects the delay from chip select 0 to write
                                                         enable.                                                               */
  __IO uint32_t  STATICWAITOEN1;                    /*!< (@ 0x40005228) Selects the delay from chip select 0 or address
                                                         change, whichever is later, to output enable.                         */
  __IO uint32_t  STATICWAITRD1;                     /*!< (@ 0x4000522C) Selects the delay from chip select 0 to a read
                                                         access.                                                               */
  __IO uint32_t  STATICWAITPAGE1;                   /*!< (@ 0x40005230) Selects the delay for asynchronous page mode
                                                         sequential accesses for chip select 0.                                */
  __IO uint32_t  STATICWAITWR1;                     /*!< (@ 0x40005234) Selects the delay from chip select 0 to a write
                                                         access.                                                               */
  __IO uint32_t  STATICWAITTURN1;                   /*!< (@ 0x40005238) Selects the number of bus turnaround cycles for
                                                         chip select 0.                                                        */
  __I  uint32_t  RESERVED9;
  __IO uint32_t  STATICCONFIG2;                     /*!< (@ 0x40005240) Selects the memory configuration for static chip
                                                         select 0.                                                             */
  __IO uint32_t  STATICWAITWEN2;                    /*!< (@ 0x40005244) Selects the delay from chip select 0 to write
                                                         enable.                                                               */
  __IO uint32_t  STATICWAITOEN2;                    /*!< (@ 0x40005248) Selects the delay from chip select 0 or address
                                                         change, whichever is later, to output enable.                         */
  __IO uint32_t  STATICWAITRD2;                     /*!< (@ 0x4000524C) Selects the delay from chip select 0 to a read
                                                         access.                                                               */
  __IO uint32_t  STATICWAITPAGE2;                   /*!< (@ 0x40005250) Selects the delay for asynchronous page mode
                                                         sequential accesses for chip select 0.                                */
  __IO uint32_t  STATICWAITWR2;                     /*!< (@ 0x40005254) Selects the delay from chip select 0 to a write
                                                         access.                                                               */
  __IO uint32_t  STATICWAITTURN2;                   /*!< (@ 0x40005258) Selects the number of bus turnaround cycles for
                                                         chip select 0.                                                        */
  __I  uint32_t  RESERVED10;
  __IO uint32_t  STATICCONFIG3;                     /*!< (@ 0x40005260) Selects the memory configuration for static chip
                                                         select 0.                                                             */
  __IO uint32_t  STATICWAITWEN3;                    /*!< (@ 0x40005264) Selects the delay from chip select 0 to write
                                                         enable.                                                               */
  __IO uint32_t  STATICWAITOEN3;                    /*!< (@ 0x40005268) Selects the delay from chip select 0 or address
                                                         change, whichever is later, to output enable.                         */
  __IO uint32_t  STATICWAITRD3;                     /*!< (@ 0x4000526C) Selects the delay from chip select 0 to a read
                                                         access.                                                               */
  __IO uint32_t  STATICWAITPAGE3;                   /*!< (@ 0x40005270) Selects the delay for asynchronous page mode
                                                         sequential accesses for chip select 0.                                */
  __IO uint32_t  STATICWAITWR3;                     /*!< (@ 0x40005274) Selects the delay from chip select 0 to a write
                                                         access.                                                               */
  __IO uint32_t  STATICWAITTURN3;                   /*!< (@ 0x40005278) Selects the number of bus turnaround cycles for
                                                         chip select 0.                                                        */
} LPC_EMC_Type;


/* ================================================================================ */
/* ================                      USB0                      ================ */
/* ================================================================================ */


/**
  * @brief USB0 Host/Device/OTG controller (USB0)
  */

typedef struct {                                    /*!< (@ 0x40006000) USB0 Structure                                         */
  __I  uint32_t  RESERVED0[64];
  __I  uint32_t  CAPLENGTH;                         /*!< (@ 0x40006100) Capability register length                             */
  __I  uint32_t  HCSPARAMS;                         /*!< (@ 0x40006104) Host controller structural parameters                  */
  __I  uint32_t  HCCPARAMS;                         /*!< (@ 0x40006108) Host controller capability parameters                  */
  __I  uint32_t  RESERVED1[5];
  __I  uint32_t  DCIVERSION;                        /*!< (@ 0x40006120) Device interface version number                        */
  __I  uint32_t  RESERVED2[7];
  
  union {
    __IO uint32_t  USBCMD_H;                        /*!< (@ 0x40006140) USB command (host mode)                                */
    __IO uint32_t  USBCMD_D;                        /*!< (@ 0x40006140) USB command (device mode)                              */
  };
  
  union {
    __IO uint32_t  USBSTS_H;                        /*!< (@ 0x40006144) USB status (host mode)                                 */
    __IO uint32_t  USBSTS_D;                        /*!< (@ 0x40006144) USB status (device mode)                               */
  };
  
  union {
    __IO uint32_t  USBINTR_H;                       /*!< (@ 0x40006148) USB interrupt enable (host mode)                       */
    __IO uint32_t  USBINTR_D;                       /*!< (@ 0x40006148) USB interrupt enable (device mode)                     */
  };
  
  union {
    __IO uint32_t  FRINDEX_H;                       /*!< (@ 0x4000614C) USB frame index (host mode)                            */
    __IO uint32_t  FRINDEX_D;                       /*!< (@ 0x4000614C) USB frame index (device mode)                          */
  };
  __I  uint32_t  RESERVED3;
  
  union {
    __IO uint32_t  PERIODICLISTBASE;                /*!< (@ 0x40006154) Frame list base address (host mode)                    */
    __IO uint32_t  DEVICEADDR;                      /*!< (@ 0x40006154) USB device address (device mode)                       */
  };
  
  union {
    __IO uint32_t  ASYNCLISTADDR;                   /*!< (@ 0x40006158) Address of endpoint list in memory                     */
    __IO uint32_t  ENDPOINTLISTADDR;                /*!< (@ 0x40006158) Address of endpoint list in memory                     */
  };
  __IO uint32_t  TTCTRL;                            /*!< (@ 0x4000615C) Asynchronous buffer status for embedded TT (host
                                                         mode)                                                                 */
  __IO uint32_t  BURSTSIZE;                         /*!< (@ 0x40006160) Programmable burst size                                */
  __IO uint32_t  TXFILLTUNING;                      /*!< (@ 0x40006164) Host transmit pre-buffer packet tuning (host
                                                         mode)                                                                 */
  __I  uint32_t  RESERVED4[3];
  __IO uint32_t  BINTERVAL;                         /*!< (@ 0x40006174) Length of virtual frame                                */
  __IO uint32_t  ENDPTNAK;                          /*!< (@ 0x40006178) Endpoint NAK (device mode)                             */
  __IO uint32_t  ENDPTNAKEN;                        /*!< (@ 0x4000617C) Endpoint NAK Enable (device mode)                      */
  __I  uint32_t  RESERVED5;
  
  union {
    __IO uint32_t  PORTSC1_H;                       /*!< (@ 0x40006184) Port 1 status/control (host mode)                      */
    __IO uint32_t  PORTSC1_D;                       /*!< (@ 0x40006184) Port 1 status/control (device mode)                    */
  };
  __I  uint32_t  RESERVED6[7];
  __IO uint32_t  OTGSC;                             /*!< (@ 0x400061A4) OTG status and control                                 */
  
