MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
  union {
    __IO uint32_t  USBMODE_H;                       /*!< (@ 0x400061A8) USB mode (host mode)                                   */
    __IO uint32_t  USBMODE_D;                       /*!< (@ 0x400061A8) USB device mode (device mode)                          */
  };
  __IO uint32_t  ENDPTSETUPSTAT;                    /*!< (@ 0x400061AC) Endpoint setup status                                  */
  __IO uint32_t  ENDPTPRIME;                        /*!< (@ 0x400061B0) Endpoint initialization                                */
  __IO uint32_t  ENDPTFLUSH;                        /*!< (@ 0x400061B4) Endpoint de-initialization                             */
  __I  uint32_t  ENDPTSTAT;                         /*!< (@ 0x400061B8) Endpoint status                                        */
  __IO uint32_t  ENDPTCOMPLETE;                     /*!< (@ 0x400061BC) Endpoint complete                                      */
  __IO uint32_t  ENDPTCTRL0;                        /*!< (@ 0x400061C0) Endpoint control 0                                     */
  __IO uint32_t  ENDPTCTRL1;                        /*!< (@ 0x400061C4) Endpoint control                                       */
  __IO uint32_t  ENDPTCTRL2;                        /*!< (@ 0x400061C8) Endpoint control                                       */
  __IO uint32_t  ENDPTCTRL3;                        /*!< (@ 0x400061CC) Endpoint control                                       */
  __IO uint32_t  ENDPTCTRL4;                        /*!< (@ 0x400061D0) Endpoint control                                       */
  __IO uint32_t  ENDPTCTRL5;                        /*!< (@ 0x400061D4) Endpoint control                                       */
} LPC_USB0_Type;


/* ================================================================================ */
/* ================                      USB1                      ================ */
/* ================================================================================ */


/**
  * @brief USB1 Host/Device controller  (USB1)
  */

typedef struct {                                    /*!< (@ 0x40007000) USB1 Structure                                         */
  __I  uint32_t  RESERVED0[64];
  __I  uint32_t  CAPLENGTH;                         /*!< (@ 0x40007100) Capability register length                             */
  __I  uint32_t  HCSPARAMS;                         /*!< (@ 0x40007104) Host controller structural parameters                  */
  __I  uint32_t  HCCPARAMS;                         /*!< (@ 0x40007108) Host controller capability parameters                  */
  __I  uint32_t  RESERVED1[5];
  __I  uint32_t  DCIVERSION;                        /*!< (@ 0x40007120) Device interface version number                        */
  __I  uint32_t  RESERVED2[7];
  
  union {
    __IO uint32_t  USBCMD_H;                        /*!< (@ 0x40007140) USB command (host mode)                                */
    __IO uint32_t  USBCMD_D;                        /*!< (@ 0x40007140) USB command (device mode)                              */
  };
  
  union {
    __IO uint32_t  USBSTS_H;                        /*!< (@ 0x40007144) USB status (host mode)                                 */
    __IO uint32_t  USBSTS_D;                        /*!< (@ 0x40007144) USB status (device mode)                               */
  };
  
  union {
    __IO uint32_t  USBINTR_H;                       /*!< (@ 0x40007148) USB interrupt enable (host mode)                       */
    __IO uint32_t  USBINTR_D;                       /*!< (@ 0x40007148) USB interrupt enable (device mode)                     */
  };
  
  union {
    __IO uint32_t  FRINDEX_H;                       /*!< (@ 0x4000714C) USB frame index (host mode)                            */
    __I  uint32_t  FRINDEX_D;                       /*!< (@ 0x4000714C) USB frame index (device mode)                          */
  };
  __I  uint32_t  RESERVED3;
  
  union {
    __IO uint32_t  PERIODICLISTBASE;                /*!< (@ 0x40007154) Frame list base address                                */
    __IO uint32_t  DEVICEADDR;                      /*!< (@ 0x40007154) USB device address                                     */
  };
  
  union {
    __IO uint32_t  ASYNCLISTADDR;                   /*!< (@ 0x40007158) Address of endpoint list in memory (host mode)         */
    __IO uint32_t  ENDPOINTLISTADDR;                /*!< (@ 0x40007158) Address of endpoint list in memory (device mode)       */
  };
  __IO uint32_t  TTCTRL;                            /*!< (@ 0x4000715C) Asynchronous buffer status for embedded TT (host
                                                         mode)                                                                 */
  __IO uint32_t  BURSTSIZE;                         /*!< (@ 0x40007160) Programmable burst size                                */
  __IO uint32_t  TXFILLTUNING;                      /*!< (@ 0x40007164) Host transmit pre-buffer packet tuning (host
                                                         mode)                                                                 */
  __I  uint32_t  RESERVED4[2];
  __IO uint32_t  ULPIVIEWPORT;                      /*!< (@ 0x40007170) ULPI viewport                                          */
  __IO uint32_t  BINTERVAL;                         /*!< (@ 0x40007174) Length of virtual frame                                */
  __IO uint32_t  ENDPTNAK;                          /*!< (@ 0x40007178) Endpoint NAK (device mode)                             */
  __IO uint32_t  ENDPTNAKEN;                        /*!< (@ 0x4000717C) Endpoint NAK Enable (device mode)                      */
  __I  uint32_t  RESERVED5;
  
  union {
    __IO uint32_t  PORTSC1_H;                       /*!< (@ 0x40007184) Port 1 status/control (host mode)                      */
    __IO uint32_t  PORTSC1_D;                       /*!< (@ 0x40007184) Port 1 status/control (device mode)                    */
  };
  __I  uint32_t  RESERVED6[8];
  
  union {
    __IO uint32_t  USBMODE_H;                       /*!< (@ 0x400071A8) USB mode (host mode)                                   */
    __IO uint32_t  USBMODE_D;                       /*!< (@ 0x400071A8) USB mode (device mode)                                 */
  };
  __IO uint32_t  ENDPTSETUPSTAT;                    /*!< (@ 0x400071AC) Endpoint setup status                                  */
  __IO uint32_t  ENDPTPRIME;                        /*!< (@ 0x400071B0) Endpoint initialization                                */
  __IO uint32_t  ENDPTFLUSH;                        /*!< (@ 0x400071B4) Endpoint de-initialization                             */
  __I  uint32_t  ENDPTSTAT;                         /*!< (@ 0x400071B8) Endpoint status                                        */
  __IO uint32_t  ENDPTCOMPLETE;                     /*!< (@ 0x400071BC) Endpoint complete                                      */
  __IO uint32_t  ENDPTCTRL0;                        /*!< (@ 0x400071C0) Endpoint control 0                                     */
  __IO uint32_t  ENDPTCTRL1;                        /*!< (@ 0x400071C4) Endpoint control                                       */
  __IO uint32_t  ENDPTCTRL2;                        /*!< (@ 0x400071C8) Endpoint control                                       */
  __IO uint32_t  ENDPTCTRL3;                        /*!< (@ 0x400071CC) Endpoint control                                       */
} LPC_USB1_Type;


/* ================================================================================ */
/* ================                       LCD                      ================ */
/* ================================================================================ */


/**
  * @brief LCD controller  (LCD)
  */

typedef struct {                                    /*!< (@ 0x40008000) LCD Structure                                          */
  __IO uint32_t  TIMH;                              /*!< (@ 0x40008000) Horizontal Timing Control register                     */
  __IO uint32_t  TIMV;                              /*!< (@ 0x40008004) Vertical Timing Control register                       */
  __IO uint32_t  POL;                               /*!< (@ 0x40008008) Clock and Signal Polarity Control register             */
  __IO uint32_t  LE;                                /*!< (@ 0x4000800C) Line End Control register                              */
  __IO uint32_t  UPBASE;                            /*!< (@ 0x40008010) Upper Panel Frame Base Address register                */
  __IO uint32_t  LPBASE;                            /*!< (@ 0x40008014) Lower Panel Frame Base Address register                */
  __IO uint32_t  CTRL;                              /*!< (@ 0x40008018) LCD Control register                                   */
  __IO uint32_t  INTMSK;                            /*!< (@ 0x4000801C) Interrupt Mask register                                */
  __I  uint32_t  INTRAW;                            /*!< (@ 0x40008020) Raw Interrupt Status register                          */
  __I  uint32_t  INTSTAT;                           /*!< (@ 0x40008024) Masked Interrupt Status register                       */
  __O  uint32_t  INTCLR;                            /*!< (@ 0x40008028) Interrupt Clear register                               */
  __I  uint32_t  UPCURR;                            /*!< (@ 0x4000802C) Upper Panel Current Address Value register             */
  __I  uint32_t  LPCURR;                            /*!< (@ 0x40008030) Lower Panel Current Address Value register             */
  __I  uint32_t  RESERVED0[115];
  __IO uint32_t  PAL[256];                          /*!< (@ 0x40008200) 256x16-bit Color Palette registers                     */
  __I  uint32_t  RESERVED1[128];
  __IO uint32_t  CRSR_IMG[256];                     /*!< (@ 0x40008800) Cursor Image registers                                 */
  __IO uint32_t  CRSR_CTRL;                         /*!< (@ 0x40008C00) Cursor Control register                                */
  __IO uint32_t  CRSR_CFG;                          /*!< (@ 0x40008C04) Cursor Configuration register                          */
  __IO uint32_t  CRSR_PAL0;                         /*!< (@ 0x40008C08) Cursor Palette register 0                              */
  __IO uint32_t  CRSR_PAL1;                         /*!< (@ 0x40008C0C) Cursor Palette register 1                              */
  __IO uint32_t  CRSR_XY;                           /*!< (@ 0x40008C10) Cursor XY Position register                            */
  __IO uint32_t  CRSR_CLIP;                         /*!< (@ 0x40008C14) Cursor Clip Position register                          */
  __I  uint32_t  RESERVED2[2];
  __IO uint32_t  CRSR_INTMSK;                       /*!< (@ 0x40008C20) Cursor Interrupt Mask register                         */
  __O  uint32_t  CRSR_INTCLR;                       /*!< (@ 0x40008C24) Cursor Interrupt Clear register                        */
  __I  uint32_t  CRSR_INTRAW;                       /*!< (@ 0x40008C28) Cursor Raw Interrupt Status register                   */
  __I  uint32_t  CRSR_INTSTAT;                      /*!< (@ 0x40008C2C) Cursor Masked Interrupt Status register                */
} LPC_LCD_Type;


/* ================================================================================ */
/* ================                     EEPROM                     ================ */
/* ================================================================================ */


/**
  * @brief EEPROM (EEPROM)
  */

typedef struct {                                    /*!< (@ 0x4000E000) EEPROM Structure                                       */
  __IO uint32_t  CMD;                               /*!< (@ 0x4000E000) EEPROM command register                                */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  RWSTATE;                           /*!< (@ 0x4000E008) EEPROM read wait state register                        */
  __IO uint32_t  AUTOPROG;                          /*!< (@ 0x4000E00C) EEPROM auto programming register                       */
  __IO uint32_t  WSTATE;                            /*!< (@ 0x4000E010) EEPROM wait state register                             */
  __IO uint32_t  CLKDIV;                            /*!< (@ 0x4000E014) EEPROM clock divider register                          */
  __IO uint32_t  PWRDWN;                            /*!< (@ 0x4000E018) EEPROM power-down register                             */
  __I  uint32_t  RESERVED1[1007];
  __O  uint32_t  INTENCLR;                          /*!< (@ 0x4000EFD8) EEPROM interrupt enable clear                          */
  __O  uint32_t  INTENSET;                          /*!< (@ 0x4000EFDC) EEPROM interrupt enable set                            */
  __I  uint32_t  INTSTAT;                           /*!< (@ 0x4000EFE0) EEPROM interrupt status                                */
  __I  uint32_t  INTEN;                             /*!< (@ 0x4000EFE4) EEPROM interrupt enable                                */
  __O  uint32_t  INTSTATCLR;                        /*!< (@ 0x4000EFE8) EEPROM interrupt status clear                          */
} LPC_EEPROM_Type;


/* ================================================================================ */
/* ================                    ETHERNET                    ================ */
/* ================================================================================ */


/**
  * @brief Ethernet (ETHERNET)
  */

typedef struct {                                    /*!< (@ 0x40010000) ETHERNET Structure                                     */
  __IO uint32_t  MAC_CONFIG;                        /*!< (@ 0x40010000) MAC configuration register                             */
  __IO uint32_t  MAC_FRAME_FILTER;                  /*!< (@ 0x40010004) MAC frame filter                                       */
  __IO uint32_t  MAC_HASHTABLE_HIGH;                /*!< (@ 0x40010008) Hash table high register                               */
  __IO uint32_t  MAC_HASHTABLE_LOW;                 /*!< (@ 0x4001000C) Hash table low register                                */
  __IO uint32_t  MAC_MII_ADDR;                      /*!< (@ 0x40010010) MII address register                                   */
  __IO uint32_t  MAC_MII_DATA;                      /*!< (@ 0x40010014) MII data register                                      */
  __IO uint32_t  MAC_FLOW_CTRL;                     /*!< (@ 0x40010018) Flow control register                                  */
  __IO uint32_t  MAC_VLAN_TAG;                      /*!< (@ 0x4001001C) VLAN tag register                                      */
  __I  uint32_t  RESERVED0;
  __I  uint32_t  MAC_DEBUG;                         /*!< (@ 0x40010024) Debug register                                         */
  __IO uint32_t  MAC_RWAKE_FRFLT;                   /*!< (@ 0x40010028) Remote wake-up frame filter                            */
  __IO uint32_t  MAC_PMT_CTRL_STAT;                 /*!< (@ 0x4001002C) PMT control and status                                 */
  __I  uint32_t  RESERVED1[2];
  __I  uint32_t  MAC_INTR;                          /*!< (@ 0x40010038) Interrupt status register                              */
  __IO uint32_t  MAC_INTR_MASK;                     /*!< (@ 0x4001003C) Interrupt mask register                                */
  __IO uint32_t  MAC_ADDR0_HIGH;                    /*!< (@ 0x40010040) MAC address 0 high register                            */
  __IO uint32_t  MAC_ADDR0_LOW;                     /*!< (@ 0x40010044) MAC address 0 low register                             */
  __I  uint32_t  RESERVED2[430];
  __IO uint32_t  MAC_TIMESTP_CTRL;                  /*!< (@ 0x40010700) Time stamp control register                            */
  __IO uint32_t  SUBSECOND_INCR;                    /*!< (@ 0x40010704) Sub-second increment register                          */
  __I  uint32_t  SECONDS;                           /*!< (@ 0x40010708) System time seconds register                           */
  __I  uint32_t  NANOSECONDS;                       /*!< (@ 0x4001070C) System time nanoseconds register                       */
  __IO uint32_t  SECONDSUPDATE;                     /*!< (@ 0x40010710) System time seconds update register                    */
  __IO uint32_t  NANOSECONDSUPDATE;                 /*!< (@ 0x40010714) System time nanoseconds update register                */
  __IO uint32_t  ADDEND;                            /*!< (@ 0x40010718) Time stamp addend register                             */
  __IO uint32_t  TARGETSECONDS;                     /*!< (@ 0x4001071C) Target time seconds register                           */
  __IO uint32_t  TARGETNANOSECONDS;                 /*!< (@ 0x40010720) Target time nanoseconds register                       */
  __IO uint32_t  HIGHWORD;                          /*!< (@ 0x40010724) System time higher word seconds register               */
  __I  uint32_t  TIMESTAMPSTAT;                     /*!< (@ 0x40010728) Time stamp status register                             */
  __I  uint32_t  RESERVED3[565];
  __IO uint32_t  DMA_BUS_MODE;                      /*!< (@ 0x40011000) Bus Mode Register                                      */
  __IO uint32_t  DMA_TRANS_POLL_DEMAND;             /*!< (@ 0x40011004) Transmit poll demand register                          */
  __IO uint32_t  DMA_REC_POLL_DEMAND;               /*!< (@ 0x40011008) Receive poll demand register                           */
  __IO uint32_t  DMA_REC_DES_ADDR;                  /*!< (@ 0x4001100C) Receive descriptor list address register               */
  __IO uint32_t  DMA_TRANS_DES_ADDR;                /*!< (@ 0x40011010) Transmit descriptor list address register              */
  __IO uint32_t  DMA_STAT;                          /*!< (@ 0x40011014) Status register                                        */
  __IO uint32_t  DMA_OP_MODE;                       /*!< (@ 0x40011018) Operation mode register                                */
  __IO uint32_t  DMA_INT_EN;                        /*!< (@ 0x4001101C) Interrupt enable register                              */
  __I  uint32_t  DMA_MFRM_BUFOF;                    /*!< (@ 0x40011020) Missed frame and buffer overflow register              */
  __IO uint32_t  DMA_REC_INT_WDT;                   /*!< (@ 0x40011024) Receive interrupt watchdog timer register              */
  __I  uint32_t  RESERVED4[8];
  __I  uint32_t  DMA_CURHOST_TRANS_DES;             /*!< (@ 0x40011048) Current host transmit descriptor register              */
  __I  uint32_t  DMA_CURHOST_REC_DES;               /*!< (@ 0x4001104C) Current host receive descriptor register               */
  __I  uint32_t  DMA_CURHOST_TRANS_BUF;             /*!< (@ 0x40011050) Current host transmit buffer address register          */
  __I  uint32_t  DMA_CURHOST_REC_BUF;               /*!< (@ 0x40011054) Current host receive buffer address register           */
} LPC_ETHERNET_Type;


/* ================================================================================ */
/* ================                     ATIMER                     ================ */
/* ================================================================================ */


/**
  * @brief Alarm timer  (ATIMER)
  */

typedef struct {                                    /*!< (@ 0x40040000) ATIMER Structure                                       */
  __IO uint32_t  DOWNCOUNTER;                       /*!< (@ 0x40040000) Downcounter register                                   */
  __IO uint32_t  PRESET;                            /*!< (@ 0x40040004) Preset value register                                  */
  __I  uint32_t  RESERVED0[1012];
  __O  uint32_t  CLR_EN;                            /*!< (@ 0x40040FD8) Interrupt clear enable register                        */
  __O  uint32_t  SET_EN;                            /*!< (@ 0x40040FDC) Interrupt set enable register                          */
  __I  uint32_t  STATUS;                            /*!< (@ 0x40040FE0) Status register                                        */
  __I  uint32_t  ENABLE;                            /*!< (@ 0x40040FE4) Enable register                                        */
  __O  uint32_t  CLR_STAT;                          /*!< (@ 0x40040FE8) Clear register                                         */
  __O  uint32_t  SET_STAT;                          /*!< (@ 0x40040FEC) Set register                                           */
} LPC_ATIMER_Type;


/* ================================================================================ */
/* ================                     REGFILE                    ================ */
/* ================================================================================ */


/**
  * @brief RTC REGFILE  (REGFILE)
  */

typedef struct {                                    /*!< (@ 0x40041000) REGFILE Structure                                      */
  __IO uint32_t  REGFILE[64];                       /*!< (@ 0x40041000) General purpose storage register                       */
} LPC_REGFILE_Type;


/* ================================================================================ */
/* ================                       PMC                      ================ */
/* ================================================================================ */


/**
  * @brief Power Management Controller (PMC) (PMC)
  */

typedef struct {                                    /*!< (@ 0x40042000) PMC Structure                                          */
  __IO uint32_t  PD0_SLEEP0_HW_ENA;                 /*!< (@ 0x40042000) Hardware sleep event enable register                   */
  __I  uint32_t  RESERVED0[6];
  __IO uint32_t  PD0_SLEEP0_MODE;                   /*!< (@ 0x4004201C) Sleep power mode register                              */
} LPC_PMC_Type;


/* ================================================================================ */
/* ================                      CREG                      ================ */
/* ================================================================================ */


/**
  * @brief Configuration Registers (CREG) (CREG)
  */

