MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
typedef struct {                                    /*!< (@ 0x40052000) CCU2 Structure                                         */
  __IO uint32_t  PM;                                /*!< (@ 0x40052000) Power mode register                                    */
  __I  uint32_t  BASE_STAT;                         /*!< (@ 0x40052004) CCU base clocks status register                        */
  __I  uint32_t  RESERVED0[62];
  __IO uint32_t  CLK_AUDIO_CFG;                     /*!< (@ 0x40052100) CLK_AUDIO clock configuration register                 */
  __I  uint32_t  CLK_AUDIO_STAT;                    /*!< (@ 0x40052104) CLK_AUDIO clock status register                        */
  __I  uint32_t  RESERVED1[62];
  __IO uint32_t  CLK_APB2_USART3_CFG;               /*!< (@ 0x40052200) CLK_APB2_USART3 clock configuration register           */
  __I  uint32_t  CLK_APB2_USART3_STAT;              /*!< (@ 0x40052204) CLK_APB2_USART3 clock status register                  */
  __I  uint32_t  RESERVED2[62];
  __IO uint32_t  CLK_APB2_USART2_CFG;               /*!< (@ 0x40052300) CLK_APB2_USART2 clock configuration register           */
  __I  uint32_t  CLK_APB2_USART2_STAT;              /*!< (@ 0x40052304) CLK_APB2_USART clock status register                   */
  __I  uint32_t  RESERVED3[62];
  __IO uint32_t  CLK_APB0_UART1_CFG;            /*!< (@ 0x40052400) CLK_APB2_UART1 clock configuration register            */
  __I  uint32_t  CLK_APB0_UART1_STAT;               /*!< (@ 0x40052404) CLK_APB0_UART1 clock status register                   */
  __I  uint32_t  RESERVED4[62];
  __IO uint32_t  CLK_APB0_USART0_CFG;               /*!< (@ 0x40052500) CLK_APB2_USART0 clock configuration register           */
  __I  uint32_t  CLK_APB0_USART0_STAT;              /*!< (@ 0x40052504) CLK_APB0_USART0 clock status register                  */
  __I  uint32_t  RESERVED5[62];
  __IO uint32_t  CLK_APB2_SSP1_CFG;                 /*!< (@ 0x40052600) CLK_APB2_SSP1 clock configuration register             */
  __I  uint32_t  CLK_APB2_SSP1_STAT;                /*!< (@ 0x40052604) CLK_APB2_SSP1 clock status register                    */
  __I  uint32_t  RESERVED6[62];
  __IO uint32_t  CLK_APB0_SSP0_CFG;                 /*!< (@ 0x40052700) CLK_APB0_SSP0 clock configuration register             */
  __I  uint32_t  CLK_APB0_SSP0_STAT;                /*!< (@ 0x40052704) CLK_APB0_SSP0 clock status register                    */
  __I  uint32_t  RESERVED7[62];
  __IO uint32_t  CLK_SDIO_CFG;                      /*!< (@ 0x40052800) CLK_SDIO clock configuration register                  */
  __I  uint32_t  CLK_SDIO_STAT;                     /*!< (@ 0x40052804) CLK_SDIO clock status register                         */
} LPC_CCU2_Type;


/* ================================================================================ */
/* ================                       RGU                      ================ */
/* ================================================================================ */


/**
  * @brief Reset Generation Unit (RGU) (RGU)
  */

typedef struct {                                    /*!< (@ 0x40053000) RGU Structure                                          */
  __I  uint32_t  RESERVED0[64];
  __O  uint32_t  RESET_CTRL0;                       /*!< (@ 0x40053100) Reset control register 0                               */
  __O  uint32_t  RESET_CTRL1;                       /*!< (@ 0x40053104) Reset control register 1                               */
  __I  uint32_t  RESERVED1[2];
  __IO uint32_t  RESET_STATUS0;                     /*!< (@ 0x40053110) Reset status register 0                                */
  __IO uint32_t  RESET_STATUS1;                     /*!< (@ 0x40053114) Reset status register 1                                */
  __IO uint32_t  RESET_STATUS2;                     /*!< (@ 0x40053118) Reset status register 2                                */
  __IO uint32_t  RESET_STATUS3;                     /*!< (@ 0x4005311C) Reset status register 3                                */
  __I  uint32_t  RESERVED2[12];
  __I  uint32_t  RESET_ACTIVE_STATUS0;              /*!< (@ 0x40053150) Reset active status register 0                         */
  __I  uint32_t  RESET_ACTIVE_STATUS1;              /*!< (@ 0x40053154) Reset active status register 1                         */
  __I  uint32_t  RESERVED3[171];
  __IO uint32_t  RESET_EXT_STAT1;                   /*!< (@ 0x40053404) Reset external status register 1 for PERIPH_RST        */
  __IO uint32_t  RESET_EXT_STAT2;                   /*!< (@ 0x40053408) Reset external status register 2 for MASTER_RST        */
  __I  uint32_t  RESERVED4[2];
  __IO uint32_t  RESET_EXT_STAT5;                   /*!< (@ 0x40053414) Reset external status register 5 for CREG_RST          */
  __I  uint32_t  RESERVED5[2];
  __IO uint32_t  RESET_EXT_STAT8;                   /*!< (@ 0x40053420) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT9;                   /*!< (@ 0x40053424) Reset external status register                         */
  __I  uint32_t  RESERVED6[2];
  __IO uint32_t  RESET_EXT_STAT12;                  /*!< (@ 0x40053430) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT13;                  /*!< (@ 0x40053434) Reset external status register                         */
  __I  uint32_t  RESERVED7[2];
  __IO uint32_t  RESET_EXT_STAT16;                  /*!< (@ 0x40053440) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT17;                  /*!< (@ 0x40053444) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT18;                  /*!< (@ 0x40053448) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT19;                  /*!< (@ 0x4005344C) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT20;                  /*!< (@ 0x40053450) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT21;                  /*!< (@ 0x40053454) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT22;                  /*!< (@ 0x40053458) Reset external status register                         */
  __I  uint32_t  RESERVED8[2];
  __IO uint32_t  RESET_EXT_STAT25;                  /*!< (@ 0x40053464) Reset external status register                         */
  __I  uint32_t  RESERVED9;
  __IO uint32_t  RESET_EXT_STAT27;                  /*!< (@ 0x4005346C) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT28;                  /*!< (@ 0x40053470) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT29;                  /*!< (@ 0x40053474) Reset external status register                         */
  __I  uint32_t  RESERVED10[2];
  __IO uint32_t  RESET_EXT_STAT32;                  /*!< (@ 0x40053480) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT33;                  /*!< (@ 0x40053484) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT34;                  /*!< (@ 0x40053488) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT35;                  /*!< (@ 0x4005348C) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT36;                  /*!< (@ 0x40053490) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT37;                  /*!< (@ 0x40053494) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT38;                  /*!< (@ 0x40053498) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT39;                  /*!< (@ 0x4005349C) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT40;                  /*!< (@ 0x400534A0) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT41;                  /*!< (@ 0x400534A4) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT42;                  /*!< (@ 0x400534A8) Reset external status register                         */
  __I  uint32_t  RESERVED11;
  __IO uint32_t  RESET_EXT_STAT44;                  /*!< (@ 0x400534B0) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT45;                  /*!< (@ 0x400534B4) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT46;                  /*!< (@ 0x400534B8) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT47;                  /*!< (@ 0x400534BC) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT48;                  /*!< (@ 0x400534C0) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT49;                  /*!< (@ 0x400534C4) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT50;                  /*!< (@ 0x400534C8) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT51;                  /*!< (@ 0x400534CC) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT52;                  /*!< (@ 0x400534D0) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT53;                  /*!< (@ 0x400534D4) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT54;                  /*!< (@ 0x400534D8) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT55;                  /*!< (@ 0x400534DC) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT56;                  /*!< (@ 0x400534E0) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT57;                  /*!< (@ 0x400534E4) Reset external status register                         */
  __IO uint32_t  RESET_EXT_STAT58;                  /*!< (@ 0x400534E8) Reset external status register                         */
  __I  uint32_t  RESERVED12;
  __IO uint32_t  RESET_EXT_STAT60;                  /*!< (@ 0x400534F0) Reset external status register                         */
} LPC_RGU_Type;


/* ================================================================================ */
/* ================                      WWDT                      ================ */
/* ================================================================================ */


/**
  * @brief Windowed Watchdog timer (WWDT)  (WWDT)
  */

