MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
typedef struct {                                    /*!< (@ 0x40080000) WWDT Structure                                         */
  __IO uint32_t  MOD;                               /*!< (@ 0x40080000) Watchdog mode register. This register contains
                                                         the basic mode and status of the Watchdog Timer.                      */
  __IO uint32_t  TC;                                /*!< (@ 0x40080004) Watchdog timer constant register. This register
                                                         determines the time-out value.                                        */
  __O  uint32_t  FEED;                              /*!< (@ 0x40080008) Watchdog feed sequence register. Writing 0xAA
                                                         followed by 0x55 to this register reloads the Watchdog timer
                                                          with the value contained in WDTC.                                    */
  __I  uint32_t  TV;                                /*!< (@ 0x4008000C) Watchdog timer value register. This register
                                                         reads out the current value of the Watchdog timer.                    */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  WARNINT;                           /*!< (@ 0x40080014) Watchdog warning interrupt register. This register
                                                         contains the Watchdog warning interrupt compare value.                */
  __IO uint32_t  WINDOW;                            /*!< (@ 0x40080018) Watchdog timer window register. This register
                                                         contains the Watchdog window value.                                   */
} LPC_WWDT_Type;


/* ================================================================================ */
/* ================                 USARTn [USART0]                ================ */
/* ================================================================================ */


/**
  * @brief USART0_2_3 (USARTn)
  */

typedef struct {                                    /*!< (@ 0x40081000) USARTn Structure                                       */
  
  union {
    __IO uint32_t  DLL;                             /*!< (@ 0x40081000) Divisor Latch LSB. Least significant byte of
                                                         the baud rate divisor value. The full divisor is used to generate
                                                          a baud rate from the fractional rate divider (DLAB = 1).             */
    __O  uint32_t  THR;                             /*!< (@ 0x40081000) Transmit Holding Register. The next character
                                                         to be transmitted is written here (DLAB = 0).                         */
    __I  uint32_t  RBR;                             /*!< (@ 0x40081000) Receiver Buffer Register. Contains the next received
                                                         character to be read (DLAB = 0).                                      */
  };
  
  union {
    __IO uint32_t  IER;                             /*!< (@ 0x40081004) Interrupt Enable Register. Contains individual
                                                         interrupt enable bits for the 7 potential USART interrupts (DLAB
                                                          = 0).                                                                */
    __IO uint32_t  DLM;                             /*!< (@ 0x40081004) Divisor Latch MSB. Most significant byte of the
                                                         baud rate divisor value. The full divisor is used to generate
                                                          a baud rate from the fractional rate divider (DLAB = 1).             */
  };
  
  union {
    __O  uint32_t  FCR;                             /*!< (@ 0x40081008) FIFO Control Register. Controls USART FIFO usage
                                                         and modes.                                                            */
    __I  uint32_t  IIR;                             /*!< (@ 0x40081008) Interrupt ID Register. Identifies which interrupt(s)
                                                         are pending.                                                          */
  };
  __IO uint32_t  LCR;                               /*!< (@ 0x4008100C) Line Control Register. Contains controls for
                                                         frame formatting and break generation.                                */
  __I  uint32_t  RESERVED0;
  __I  uint32_t  LSR;                               /*!< (@ 0x40081014) Line Status Register. Contains flags for transmit
                                                         and receive status, including line errors.                            */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  SCR;                               /*!< (@ 0x4008101C) Scratch Pad Register. Eight-bit temporary storage
                                                         for software.                                                         */
  __IO uint32_t  ACR;                               /*!< (@ 0x40081020) Auto-baud Control Register. Contains controls
                                                         for the auto-baud feature.                                            */
  __IO uint32_t  ICR;                               /*!< (@ 0x40081024) IrDA control register (USART3 only)                    */
  __IO uint32_t  FDR;                               /*!< (@ 0x40081028) Fractional Divider Register. Generates a clock
                                                         input for the baud rate divider.                                      */
  __IO uint32_t  OSR;                               /*!< (@ 0x4008102C) Oversampling Register. Controls the degree of
                                                         oversampling during each bit time.                                    */
  __I  uint32_t  RESERVED2[4];
  __IO uint32_t  HDEN;                              /*!< (@ 0x40081040) Half-duplex enable Register                            */
  __I  uint32_t  RESERVED3;
  __IO uint32_t  SCICTRL;                           /*!< (@ 0x40081048) Smart card interface control register                  */
  __IO uint32_t  RS485CTRL;                         /*!< (@ 0x4008104C) RS-485/EIA-485 Control. Contains controls to
                                                         configure various aspects of RS-485/EIA-485 modes.                    */
  __IO uint32_t  RS485ADRMATCH;                     /*!< (@ 0x40081050) RS-485/EIA-485 address match. Contains the address
                                                         match value for RS-485/EIA-485 mode.                                  */
  __IO uint32_t  RS485DLY;                          /*!< (@ 0x40081054) RS-485/EIA-485 direction control delay.                */
  __IO uint32_t  SYNCCTRL;                          /*!< (@ 0x40081058) Synchronous mode control register.                     */
  __IO uint32_t  TER;                               /*!< (@ 0x4008105C) Transmit Enable Register. Turns off USART transmitter
                                                         for use with software flow control.                                   */
} LPC_USARTn_Type;


/* ================================================================================ */
/* ================                      UART1                     ================ */
/* ================================================================================ */


/**
  * @brief UART1 (UART1)
  */

typedef struct {                                    /*!< (@ 0x40082000) UART1 Structure                                        */
  
  union {
    __IO uint32_t  DLL;                             /*!< (@ 0x40082000) Divisor Latch LSB. Least significant byte of
                                                         the baud rate divisor value. The full divisor is used to generate
                                                          a baud rate from the fractional rate divider. (DLAB=1)               */
    __O  uint32_t  THR;                             /*!< (@ 0x40082000) Transmit Holding Register. The next character
                                                         to be transmitted is written here. (DLAB=0)                           */
    __I  uint32_t  RBR;                             /*!< (@ 0x40082000) Receiver Buffer Register. Contains the next received
                                                         character to be read. (DLAB=0)                                        */
  };
  
  union {
    __IO uint32_t  IER;                             /*!< (@ 0x40082004) Interrupt Enable Register. Contains individual
                                                         interrupt enable bits for the 7 potential UART1 interrupts.
                                                          (DLAB=0)                                                             */
    __IO uint32_t  DLM;                             /*!< (@ 0x40082004) Divisor Latch MSB. Most significant byte of the
                                                         baud rate divisor value. The full divisor is used to generate
                                                          a baud rate from the fractional rate divider.(DLAB=1)                */
  };
  
  union {
    __O  uint32_t  FCR;                             /*!< (@ 0x40082008) FIFO Control Register. Controls UART1 FIFO usage
                                                         and modes.                                                            */
    __I  uint32_t  IIR;                             /*!< (@ 0x40082008) Interrupt ID Register. Identifies which interrupt(s)
                                                         are pending.                                                          */
  };
  __IO uint32_t  LCR;                               /*!< (@ 0x4008200C) Line Control Register. Contains controls for
                                                         frame formatting and break generation.                                */
  __IO uint32_t  MCR;                               /*!< (@ 0x40082010) Modem Control Register. Contains controls for
                                                         flow control handshaking and loopback mode.                           */
  __I  uint32_t  LSR;                               /*!< (@ 0x40082014) Line Status Register. Contains flags for transmit
                                                         and receive status, including line errors.                            */
  __I  uint32_t  MSR;                               /*!< (@ 0x40082018) Modem Status Register. Contains handshake signal
                                                         status flags.                                                         */
  __IO uint32_t  SCR;                               /*!< (@ 0x4008201C) Scratch Pad Register. 8-bit temporary storage
                                                         for software.                                                         */
  __IO uint32_t  ACR;                               /*!< (@ 0x40082020) Auto-baud Control Register. Contains controls
                                                         for the auto-baud feature.                                            */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  FDR;                               /*!< (@ 0x40082028) Fractional Divider Register. Generates a clock
                                                         input for the baud rate divider.                                      */
  __I  uint32_t  RESERVED1[8];
  __IO uint32_t  RS485CTRL;                         /*!< (@ 0x4008204C) RS-485/EIA-485 Control. Contains controls to
                                                         configure various aspects of RS-485/EIA-485 modes.                    */
  __IO uint32_t  RS485ADRMATCH;                     /*!< (@ 0x40082050) RS-485/EIA-485 address match. Contains the address
                                                         match value for RS-485/EIA-485 mode.                                  */
  __IO uint32_t  RS485DLY;                          /*!< (@ 0x40082054) RS-485/EIA-485 direction control delay.                */
  __I  uint32_t  RESERVED2;
  __IO uint32_t  TER;                               /*!< (@ 0x4008205C) Transmit Enable Register. Turns off UART transmitter
                                                         for use with software flow control.                                   */
} LPC_UART1_Type;


/* ================================================================================ */
/* ================                   SSPn [SSP0]                  ================ */
/* ================================================================================ */


/**
  * @brief SSP0/1 (SSPn)
  */

typedef struct {                                    /*!< (@ 0x40083000) SSPn Structure                                         */
  __IO uint32_t  CR0;                               /*!< (@ 0x40083000) Control Register 0. Selects the serial clock
                                                         rate, bus type, and data size.                                        */
  __IO uint32_t  CR1;                               /*!< (@ 0x40083004) Control Register 1. Selects master/slave and
                                                         other modes.                                                          */
  __IO uint32_t  DR;                                /*!< (@ 0x40083008) Data Register. Writes fill the transmit FIFO,
                                                         and reads empty the receive FIFO.                                     */
  __I  uint32_t  SR;                                /*!< (@ 0x4008300C) Status Register                                        */
  __IO uint32_t  CPSR;                              /*!< (@ 0x40083010) Clock Prescale Register                                */
  __IO uint32_t  IMSC;                              /*!< (@ 0x40083014) Interrupt Mask Set and Clear Register                  */
  __I  uint32_t  RIS;                               /*!< (@ 0x40083018) Raw Interrupt Status Register                          */
  __I  uint32_t  MIS;                               /*!< (@ 0x4008301C) Masked Interrupt Status Register                       */
  __O  uint32_t  ICR;                               /*!< (@ 0x40083020) SSPICR Interrupt Clear Register                        */
  __IO uint32_t  DMACR;                             /*!< (@ 0x40083024) SSP0 DMA control register                              */
} LPC_SSPn_Type;


/* ================================================================================ */
/* ================                 TIMERn [TIMER0]                ================ */
/* ================================================================================ */


/**
  * @brief Timer0/1/2/3 (TIMERn)
  */

typedef struct {                                    /*!< (@ 0x40084000) TIMERn Structure                                       */
  __IO uint32_t  IR;                                /*!< (@ 0x40084000) Interrupt Register. The IR can be written to
                                                         clear interrupts. The IR can be read to identify which of eight
                                                          possible interrupt sources are pending.                              */
  __IO uint32_t  TCR;                               /*!< (@ 0x40084004) Timer Control Register. The TCR is used to control
                                                         the Timer Counter functions. The Timer Counter can be disabled
                                                          or reset through the TCR.                                            */
  __IO uint32_t  TC;                                /*!< (@ 0x40084008) Timer Counter. The 32 bit TC is incremented every
                                                         PR+1 cycles of PCLK. The TC is controlled through the TCR.            */
  __IO uint32_t  PR;                                /*!< (@ 0x4008400C) Prescale Register. When the Prescale Counter
                                                         (PC) is equal to this value, the next clock increments the TC
                                                          and clears the PC.                                                   */
  __IO uint32_t  PC;                                /*!< (@ 0x40084010) Prescale Counter. The 32 bit PC is a counter
                                                         which is incremented to the value stored in PR. When the value
                                                          in PR is reached, the TC is incremented and the PC is cleared.
                                                          The PC is observable and controllable through the bus interface.     */
  __IO uint32_t  MCR;                               /*!< (@ 0x40084014) Match Control Register. The MCR is used to control
                                                         if an interrupt is generated and if the TC is reset when a Match
                                                          occurs.                                                              */
  __IO uint32_t  MR0;                               /*!< (@ 0x40084018) Match Register 0. MR0 can be enabled through
                                                         the MCR to reset the TC, stop both the TC and PC, and/or generate
                                                          an interrupt every time MR0 matches the TC.                          */
  __IO uint32_t  MR1;                               /*!< (@ 0x4008401C) Match Register 0. MR0 can be enabled through
                                                         the MCR to reset the TC, stop both the TC and PC, and/or generate
                                                          an interrupt every time MR0 matches the TC.                          */
  __IO uint32_t  MR2;                               /*!< (@ 0x40084020) Match Register 0. MR0 can be enabled through
                                                         the MCR to reset the TC, stop both the TC and PC, and/or generate
                                                          an interrupt every time MR0 matches the TC.                          */
  __IO uint32_t  MR3;                               /*!< (@ 0x40084024) Match Register 0. MR0 can be enabled through
                                                         the MCR to reset the TC, stop both the TC and PC, and/or generate
                                                          an interrupt every time MR0 matches the TC.                          */
  __IO uint32_t  CCR;                               /*!< (@ 0x40084028) Capture Control Register. The CCR controls which
                                                         edges of the capture inputs are used to load the Capture Registers
                                                          and whether or not an interrupt is generated when a capture
                                                          takes place.                                                         */
  __I  uint32_t  CR0;                               /*!< (@ 0x4008402C) Capture Register 0. CR0 is loaded with the value
                                                         of TC when there is an event on the CAPn.0 input.                     */
  __I  uint32_t  CR1;                               /*!< (@ 0x40084030) Capture Register 0. CR0 is loaded with the value
                                                         of TC when there is an event on the CAPn.0 input.                     */
  __I  uint32_t  CR2;                               /*!< (@ 0x40084034) Capture Register 0. CR0 is loaded with the value
                                                         of TC when there is an event on the CAPn.0 input.                     */
  __I  uint32_t  CR3;                               /*!< (@ 0x40084038) Capture Register 0. CR0 is loaded with the value
                                                         of TC when there is an event on the CAPn.0 input.                     */
  __IO uint32_t  EMR;                               /*!< (@ 0x4008403C) External Match Register. The EMR controls the
                                                         external match pins MATn.0-3 (MAT0.0-3 and MAT1.0-3 respectively).    */
  __I  uint32_t  RESERVED0[12];
  __IO uint32_t  CTCR;                              /*!< (@ 0x40084070) Count Control Register. The CTCR selects between
                                                         Timer and Counter mode, and in Counter mode selects the signal
                                                          and edge(s) for counting.                                            */
} LPC_TIMERn_Type;


/* ================================================================================ */
/* ================                       SCU                      ================ */
/* ================================================================================ */


/**
  * @brief System Control Unit (SCU) I/O configuration  (SCU)
  */

