MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
typedef struct {                                    /*!< (@ 0x40086000) SCU Structure                                          */
  __IO uint32_t  SFSP0_0;                           /*!< (@ 0x40086000) Pin configuration register for pins P0                 */
  __IO uint32_t  SFSP0_1;                           /*!< (@ 0x40086004) Pin configuration register for pins P0                 */
  __I  uint32_t  RESERVED0[30];
  __IO uint32_t  SFSP1_0;                           /*!< (@ 0x40086080) Pin configuration register for pins P1                 */
  __IO uint32_t  SFSP1_1;                           /*!< (@ 0x40086084) Pin configuration register for pins P1                 */
  __IO uint32_t  SFSP1_2;                           /*!< (@ 0x40086088) Pin configuration register for pins P1                 */
  __IO uint32_t  SFSP1_3;                           /*!< (@ 0x4008608C) Pin configuration register for pins P1                 */
  __IO uint32_t  SFSP1_4;                           /*!< (@ 0x40086090) Pin configuration register for pins P1                 */
  __IO uint32_t  SFSP1_5;                           /*!< (@ 0x40086094) Pin configuration register for pins P1                 */
  __IO uint32_t  SFSP1_6;                           /*!< (@ 0x40086098) Pin configuration register for pins P1                 */
  __IO uint32_t  SFSP1_7;                           /*!< (@ 0x4008609C) Pin configuration register for pins P1                 */
  __IO uint32_t  SFSP1_8;                           /*!< (@ 0x400860A0) Pin configuration register for pins P1                 */
  __IO uint32_t  SFSP1_9;                           /*!< (@ 0x400860A4) Pin configuration register for pins P1                 */
  __IO uint32_t  SFSP1_10;                          /*!< (@ 0x400860A8) Pin configuration register for pins P1                 */
  __IO uint32_t  SFSP1_11;                          /*!< (@ 0x400860AC) Pin configuration register for pins P1                 */
  __IO uint32_t  SFSP1_12;                          /*!< (@ 0x400860B0) Pin configuration register for pins P1                 */
  __IO uint32_t  SFSP1_13;                          /*!< (@ 0x400860B4) Pin configuration register for pins P1                 */
  __IO uint32_t  SFSP1_14;                          /*!< (@ 0x400860B8) Pin configuration register for pins P1                 */
  __IO uint32_t  SFSP1_15;                          /*!< (@ 0x400860BC) Pin configuration register for pins P1                 */
  __IO uint32_t  SFSP1_16;                          /*!< (@ 0x400860C0) Pin configuration register for pins P1                 */
  __IO uint32_t  SFSP1_17;                          /*!< (@ 0x400860C4) Pin configuration register for pins P1_17              */
  __IO uint32_t  SFSP1_18;                          /*!< (@ 0x400860C8) Pin configuration register for pins P1                 */
  __IO uint32_t  SFSP1_19;                          /*!< (@ 0x400860CC) Pin configuration register for pins P1                 */
  __IO uint32_t  SFSP1_20;                          /*!< (@ 0x400860D0) Pin configuration register for pins P1                 */
  __I  uint32_t  RESERVED1[11];
  __IO uint32_t  SFSP2_0;                           /*!< (@ 0x40086100) Pin configuration register for pins P2                 */
  __IO uint32_t  SFSP2_1;                           /*!< (@ 0x40086104) Pin configuration register for pins P2                 */
  __IO uint32_t  SFSP2_2;                           /*!< (@ 0x40086108) Pin configuration register for pins P2                 */
  __IO uint32_t  SFSP2_3;                           /*!< (@ 0x4008610C) Pin configuration register for pins P2                 */
  __IO uint32_t  SFSP2_4;                           /*!< (@ 0x40086110) Pin configuration register for pins P2                 */
  __IO uint32_t  SFSP2_5;                           /*!< (@ 0x40086114) Pin configuration register for pins P2                 */
  __IO uint32_t  SFSP2_6;                           /*!< (@ 0x40086118) Pin configuration register for pins P2                 */
  __IO uint32_t  SFSP2_7;                           /*!< (@ 0x4008611C) Pin configuration register for pins P2                 */
  __IO uint32_t  SFSP2_8;                           /*!< (@ 0x40086120) Pin configuration register for pins P2                 */
  __IO uint32_t  SFSP2_9;                           /*!< (@ 0x40086124) Pin configuration register for pins P2                 */
  __IO uint32_t  SFSP2_10;                          /*!< (@ 0x40086128) Pin configuration register for pins P2                 */
  __IO uint32_t  SFSP2_11;                          /*!< (@ 0x4008612C) Pin configuration register for pins P2                 */
  __IO uint32_t  SFSP2_12;                          /*!< (@ 0x40086130) Pin configuration register for pins P2                 */
  __IO uint32_t  SFSP2_13;                          /*!< (@ 0x40086134) Pin configuration register for pins P2                 */
  __I  uint32_t  RESERVED2[18];
  __IO uint32_t  SFSP3_0;                           /*!< (@ 0x40086180) Pin configuration register for pins P3                 */
  __IO uint32_t  SFSP3_1;                           /*!< (@ 0x40086184) Pin configuration register for pins P3                 */
  __IO uint32_t  SFSP3_2;                           /*!< (@ 0x40086188) Pin configuration register for pins P3                 */
  __IO uint32_t  SFSP3_3;                           /*!< (@ 0x4008618C) Pin configuration register for pins P3                 */
  __IO uint32_t  SFSP3_4;                           /*!< (@ 0x40086190) Pin configuration register for pins P3                 */
  __IO uint32_t  SFSP3_5;                           /*!< (@ 0x40086194) Pin configuration register for pins P3                 */
  __IO uint32_t  SFSP3_6;                           /*!< (@ 0x40086198) Pin configuration register for pins P3                 */
  __IO uint32_t  SFSP3_7;                           /*!< (@ 0x4008619C) Pin configuration register for pins P3                 */
  __IO uint32_t  SFSP3_8;                           /*!< (@ 0x400861A0) Pin configuration register for pins P3                 */
  __I  uint32_t  RESERVED3[23];
  __IO uint32_t  SFSP4_0;                           /*!< (@ 0x40086200) Pin configuration register for pins P4                 */
  __IO uint32_t  SFSP4_1;                           /*!< (@ 0x40086204) Pin configuration register for pins P4                 */
  __IO uint32_t  SFSP4_2;                           /*!< (@ 0x40086208) Pin configuration register for pins P4                 */
  __IO uint32_t  SFSP4_3;                           /*!< (@ 0x4008620C) Pin configuration register for pins P4                 */
  __IO uint32_t  SFSP4_4;                           /*!< (@ 0x40086210) Pin configuration register for pins P4                 */
  __IO uint32_t  SFSP4_5;                           /*!< (@ 0x40086214) Pin configuration register for pins P4                 */
  __IO uint32_t  SFSP4_6;                           /*!< (@ 0x40086218) Pin configuration register for pins P4                 */
  __IO uint32_t  SFSP4_7;                           /*!< (@ 0x4008621C) Pin configuration register for pins P4                 */
  __IO uint32_t  SFSP4_8;                           /*!< (@ 0x40086220) Pin configuration register for pins P4                 */
  __IO uint32_t  SFSP4_9;                           /*!< (@ 0x40086224) Pin configuration register for pins P4                 */
  __IO uint32_t  SFSP4_10;                          /*!< (@ 0x40086228) Pin configuration register for pins P4                 */
  __I  uint32_t  RESERVED4[21];
  __IO uint32_t  SFSP5_0;                           /*!< (@ 0x40086280) Pin configuration register for pins P5                 */
  __IO uint32_t  SFSP5_1;                           /*!< (@ 0x40086284) Pin configuration register for pins P5                 */
  __IO uint32_t  SFSP5_2;                           /*!< (@ 0x40086288) Pin configuration register for pins P5                 */
  __IO uint32_t  SFSP5_3;                           /*!< (@ 0x4008628C) Pin configuration register for pins P5                 */
  __IO uint32_t  SFSP5_4;                           /*!< (@ 0x40086290) Pin configuration register for pins P5                 */
  __IO uint32_t  SFSP5_5;                           /*!< (@ 0x40086294) Pin configuration register for pins P5                 */
  __IO uint32_t  SFSP5_6;                           /*!< (@ 0x40086298) Pin configuration register for pins P5                 */
  __IO uint32_t  SFSP5_7;                           /*!< (@ 0x4008629C) Pin configuration register for pins P5                 */
  __I  uint32_t  RESERVED5[24];
  __IO uint32_t  SFSP6_0;                           /*!< (@ 0x40086300) Pin configuration register for pins P6                 */
  __IO uint32_t  SFSP6_1;                           /*!< (@ 0x40086304) Pin configuration register for pins P6                 */
  __IO uint32_t  SFSP6_2;                           /*!< (@ 0x40086308) Pin configuration register for pins P6                 */
  __IO uint32_t  SFSP6_3;                           /*!< (@ 0x4008630C) Pin configuration register for pins P6                 */
  __IO uint32_t  SFSP6_4;                           /*!< (@ 0x40086310) Pin configuration register for pins P6                 */
  __IO uint32_t  SFSP6_5;                           /*!< (@ 0x40086314) Pin configuration register for pins P6                 */
  __IO uint32_t  SFSP6_6;                           /*!< (@ 0x40086318) Pin configuration register for pins P6                 */
  __IO uint32_t  SFSP6_7;                           /*!< (@ 0x4008631C) Pin configuration register for pins P6                 */
  __IO uint32_t  SFSP6_8;                           /*!< (@ 0x40086320) Pin configuration register for pins P6                 */
  __IO uint32_t  SFSP6_9;                           /*!< (@ 0x40086324) Pin configuration register for pins P6                 */
  __IO uint32_t  SFSP6_10;                          /*!< (@ 0x40086328) Pin configuration register for pins P6                 */
  __IO uint32_t  SFSP6_11;                          /*!< (@ 0x4008632C) Pin configuration register for pins P6                 */
  __IO uint32_t  SFSP6_12;                          /*!< (@ 0x40086330) Pin configuration register for pins P6                 */
  __I  uint32_t  RESERVED6[19];
  __IO uint32_t  SFSP7_0;                           /*!< (@ 0x40086380) Pin configuration register for pins P7                 */
  __IO uint32_t  SFSP7_1;                           /*!< (@ 0x40086384) Pin configuration register for pins P7                 */
  __IO uint32_t  SFSP7_2;                           /*!< (@ 0x40086388) Pin configuration register for pins P7                 */
  __IO uint32_t  SFSP7_3;                           /*!< (@ 0x4008638C) Pin configuration register for pins P7                 */
  __IO uint32_t  SFSP7_4;                           /*!< (@ 0x40086390) Pin configuration register for pins P7                 */
  __IO uint32_t  SFSP7_5;                           /*!< (@ 0x40086394) Pin configuration register for pins P7                 */
  __IO uint32_t  SFSP7_6;                           /*!< (@ 0x40086398) Pin configuration register for pins P7                 */
  __IO uint32_t  SFSP7_7;                           /*!< (@ 0x4008639C) Pin configuration register for pins P7                 */
  __I  uint32_t  RESERVED7[24];
  __IO uint32_t  SFSP8_0;                           /*!< (@ 0x40086400) Pin configuration register for pins P8                 */
  __IO uint32_t  SFSP8_1;                           /*!< (@ 0x40086404) Pin configuration register for pins P8                 */
  __IO uint32_t  SFSP8_2;                           /*!< (@ 0x40086408) Pin configuration register for pins P8                 */
  __IO uint32_t  SFSP8_3;                           /*!< (@ 0x4008640C) Pin configuration register for pins P8                 */
  __IO uint32_t  SFSP8_4;                           /*!< (@ 0x40086410) Pin configuration register for pins P8                 */
  __IO uint32_t  SFSP8_5;                           /*!< (@ 0x40086414) Pin configuration register for pins P8                 */
  __IO uint32_t  SFSP8_6;                           /*!< (@ 0x40086418) Pin configuration register for pins P8                 */
  __IO uint32_t  SFSP8_7;                           /*!< (@ 0x4008641C) Pin configuration register for pins P8                 */
  __IO uint32_t  SFSP8_8;                           /*!< (@ 0x40086420) Pin configuration register for pins P8                 */
  __I  uint32_t  RESERVED8[23];
  __IO uint32_t  SFSP9_0;                           /*!< (@ 0x40086480) Pin configuration register for pins P9                 */
  __IO uint32_t  SFSP9_1;                           /*!< (@ 0x40086484) Pin configuration register for pins P9                 */
  __IO uint32_t  SFSP9_2;                           /*!< (@ 0x40086488) Pin configuration register for pins P9                 */
  __IO uint32_t  SFSP9_3;                           /*!< (@ 0x4008648C) Pin configuration register for pins P9                 */
  __IO uint32_t  SFSP9_4;                           /*!< (@ 0x40086490) Pin configuration register for pins P9                 */
  __IO uint32_t  SFSP9_5;                           /*!< (@ 0x40086494) Pin configuration register for pins P9                 */
  __IO uint32_t  SFSP9_6;                           /*!< (@ 0x40086498) Pin configuration register for pins P9                 */
  __I  uint32_t  RESERVED9[25];
  __IO uint32_t  SFSPA_0;                           /*!< (@ 0x40086500) Pin configuration register for pins PA                 */
  __IO uint32_t  SFSPA_1;                           /*!< (@ 0x40086504) Pin configuration register for pins PA                 */
  __IO uint32_t  SFSPA_2;                           /*!< (@ 0x40086508) Pin configuration register for pins PA                 */
  __IO uint32_t  SFSPA_3;                           /*!< (@ 0x4008650C) Pin configuration register for pins PA                 */
  __IO uint32_t  SFSPA_4;                           /*!< (@ 0x40086510) Pin configuration register for pins PA                 */
  __I  uint32_t  RESERVED10[27];
  __IO uint32_t  SFSPB_0;                           /*!< (@ 0x40086580) Pin configuration register for pins PB                 */
  __IO uint32_t  SFSPB_1;                           /*!< (@ 0x40086584) Pin configuration register for pins PB                 */
  __IO uint32_t  SFSPB_2;                           /*!< (@ 0x40086588) Pin configuration register for pins PB                 */
  __IO uint32_t  SFSPB_3;                           /*!< (@ 0x4008658C) Pin configuration register for pins PB                 */
  __IO uint32_t  SFSPB_4;                           /*!< (@ 0x40086590) Pin configuration register for pins PB                 */
  __IO uint32_t  SFSPB_5;                           /*!< (@ 0x40086594) Pin configuration register for pins PB                 */
  __IO uint32_t  SFSPB_6;                           /*!< (@ 0x40086598) Pin configuration register for pins PB                 */
  __I  uint32_t  RESERVED11[25];
  __IO uint32_t  SFSPC_0;                           /*!< (@ 0x40086600) Pin configuration register for pins PC                 */
  __IO uint32_t  SFSPC_1;                           /*!< (@ 0x40086604) Pin configuration register for pins PC                 */
  __IO uint32_t  SFSPC_2;                           /*!< (@ 0x40086608) Pin configuration register for pins PC                 */
  __IO uint32_t  SFSPC_3;                           /*!< (@ 0x4008660C) Pin configuration register for pins PC                 */
  __IO uint32_t  SFSPC_4;                           /*!< (@ 0x40086610) Pin configuration register for pins PC                 */
  __IO uint32_t  SFSPC_5;                           /*!< (@ 0x40086614) Pin configuration register for pins PC                 */
  __IO uint32_t  SFSPC_6;                           /*!< (@ 0x40086618) Pin configuration register for pins PC                 */
  __IO uint32_t  SFSPC_7;                           /*!< (@ 0x4008661C) Pin configuration register for pins PC                 */
  __IO uint32_t  SFSPC_8;                           /*!< (@ 0x40086620) Pin configuration register for pins PC                 */
  __IO uint32_t  SFSPC_9;                           /*!< (@ 0x40086624) Pin configuration register for pins PC                 */
  __IO uint32_t  SFSPC_10;                          /*!< (@ 0x40086628) Pin configuration register for pins PC                 */
  __IO uint32_t  SFSPC_11;                          /*!< (@ 0x4008662C) Pin configuration register for pins PC                 */
  __IO uint32_t  SFSPC_12;                          /*!< (@ 0x40086630) Pin configuration register for pins PC                 */
  __IO uint32_t  SFSPC_13;                          /*!< (@ 0x40086634) Pin configuration register for pins PC                 */
  __IO uint32_t  SFSPC_14;                          /*!< (@ 0x40086638) Pin configuration register for pins PC                 */
  __I  uint32_t  RESERVED12[17];
  __IO uint32_t  SFSPD_0;                           /*!< (@ 0x40086680) Pin configuration register for pins PD                 */
  __IO uint32_t  SFSPD_1;                           /*!< (@ 0x40086684) Pin configuration register for pins PD                 */
  __IO uint32_t  SFSPD_2;                           /*!< (@ 0x40086688) Pin configuration register for pins PD                 */
  __IO uint32_t  SFSPD_3;                           /*!< (@ 0x4008668C) Pin configuration register for pins PD                 */
  __IO uint32_t  SFSPD_4;                           /*!< (@ 0x40086690) Pin configuration register for pins PD                 */
  __IO uint32_t  SFSPD_5;                           /*!< (@ 0x40086694) Pin configuration register for pins PD                 */
  __IO uint32_t  SFSPD_6;                           /*!< (@ 0x40086698) Pin configuration register for pins PD                 */
  __IO uint32_t  SFSPD_7;                           /*!< (@ 0x4008669C) Pin configuration register for pins PD                 */
  __IO uint32_t  SFSPD_8;                           /*!< (@ 0x400866A0) Pin configuration register for pins PD                 */
  __IO uint32_t  SFSPD_9;                           /*!< (@ 0x400866A4) Pin configuration register for pins PD                 */
  __IO uint32_t  SFSPD_10;                          /*!< (@ 0x400866A8) Pin configuration register for pins PD                 */
  __IO uint32_t  SFSPD_11;                          /*!< (@ 0x400866AC) Pin configuration register for pins PD                 */
  __IO uint32_t  SFSPD_12;                          /*!< (@ 0x400866B0) Pin configuration register for pins PD                 */
  __IO uint32_t  SFSPD_13;                          /*!< (@ 0x400866B4) Pin configuration register for pins PD                 */
  __IO uint32_t  SFSPD_14;                          /*!< (@ 0x400866B8) Pin configuration register for pins PD                 */
  __IO uint32_t  SFSPD_15;                          /*!< (@ 0x400866BC) Pin configuration register for pins PD                 */
  __IO uint32_t  SFSPD_16;                          /*!< (@ 0x400866C0) Pin configuration register for pins PD                 */
  __I  uint32_t  RESERVED13[15];
  __IO uint32_t  SFSPE_0;                           /*!< (@ 0x40086700) Pin configuration register for pins PE                 */
  __IO uint32_t  SFSPE_1;                           /*!< (@ 0x40086704) Pin configuration register for pins PE                 */
  __IO uint32_t  SFSPE_2;                           /*!< (@ 0x40086708) Pin configuration register for pins PE                 */
  __IO uint32_t  SFSPE_3;                           /*!< (@ 0x4008670C) Pin configuration register for pins PE                 */
  __IO uint32_t  SFSPE_4;                           /*!< (@ 0x40086710) Pin configuration register for pins PE                 */
  __IO uint32_t  SFSPE_5;                           /*!< (@ 0x40086714) Pin configuration register for pins PE                 */
  __IO uint32_t  SFSPE_6;                           /*!< (@ 0x40086718) Pin configuration register for pins PE                 */
  __IO uint32_t  SFSPE_7;                           /*!< (@ 0x4008671C) Pin configuration register for pins PE                 */
  __IO uint32_t  SFSPE_8;                           /*!< (@ 0x40086720) Pin configuration register for pins PE                 */
  __IO uint32_t  SFSPE_9;                           /*!< (@ 0x40086724) Pin configuration register for pins PE                 */
  __IO uint32_t  SFSPE_10;                          /*!< (@ 0x40086728) Pin configuration register for pins PE                 */
  __IO uint32_t  SFSPE_11;                          /*!< (@ 0x4008672C) Pin configuration register for pins PE                 */
  __IO uint32_t  SFSPE_12;                          /*!< (@ 0x40086730) Pin configuration register for pins PE                 */
  __IO uint32_t  SFSPE_13;                          /*!< (@ 0x40086734) Pin configuration register for pins PE                 */
  __IO uint32_t  SFSPE_14;                          /*!< (@ 0x40086738) Pin configuration register for pins PE                 */
  __IO uint32_t  SFSPE_15;                          /*!< (@ 0x4008673C) Pin configuration register for pins PE                 */
  __I  uint32_t  RESERVED14[16];
  __IO uint32_t  SFSPF_0;                           /*!< (@ 0x40086780) Pin configuration register for pins PF                 */
  __IO uint32_t  SFSPF_1;                           /*!< (@ 0x40086784) Pin configuration register for pins PF                 */
  __IO uint32_t  SFSPF_2;                           /*!< (@ 0x40086788) Pin configuration register for pins PF                 */
  __IO uint32_t  SFSPF_3;                           /*!< (@ 0x4008678C) Pin configuration register for pins PF                 */
  __IO uint32_t  SFSPF_4;                           /*!< (@ 0x40086790) Pin configuration register for pins PF                 */
  __IO uint32_t  SFSPF_5;                           /*!< (@ 0x40086794) Pin configuration register for pins PF                 */
  __IO uint32_t  SFSPF_6;                           /*!< (@ 0x40086798) Pin configuration register for pins PF                 */
  __IO uint32_t  SFSPF_7;                           /*!< (@ 0x4008679C) Pin configuration register for pins PF                 */
  __IO uint32_t  SFSPF_8;                           /*!< (@ 0x400867A0) Pin configuration register for pins PF                 */
  __IO uint32_t  SFSPF_9;                           /*!< (@ 0x400867A4) Pin configuration register for pins PF                 */
  __IO uint32_t  SFSPF_10;                          /*!< (@ 0x400867A8) Pin configuration register for pins PF                 */
  __IO uint32_t  SFSPF_11;                          /*!< (@ 0x400867AC) Pin configuration register for pins PF                 */
  __I  uint32_t  RESERVED15[276];
  __IO uint32_t  SFSCLK_0;                          /*!< (@ 0x40086C00) Pin configuration register for pins CLK                */
  __IO uint32_t  SFSCLK_1;                          /*!< (@ 0x40086C04) Pin configuration register for pins CLK                */
  __IO uint32_t  SFSCLK_2;                          /*!< (@ 0x40086C08) Pin configuration register for pins CLK                */
  __IO uint32_t  SFSCLK_3;                          /*!< (@ 0x40086C0C) Pin configuration register for pins CLK                */
  __I  uint32_t  RESERVED16[28];
  __IO uint32_t  SFSUSB;                            /*!< (@ 0x40086C80) Pin configuration register for pins USB1_DM and
