MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
typedef struct {                                    /*!< (@ 0x400E1000) DAC Structure                                          */
  __IO uint32_t  CR;                                /*!< (@ 0x400E1000) DAC register. Holds the conversion data.               */
  __IO uint32_t  CTRL;                              /*!< (@ 0x400E1004) DAC control register.                                  */
  __IO uint32_t  CNTVAL;                            /*!< (@ 0x400E1008) DAC counter value register.                            */
} LPC_DAC_Type;


/* ================================================================================ */
/* ================                   ADCn [ADC0]                  ================ */
/* ================================================================================ */


/**
  * @brief 10-bit Analog-to-Digital Converter (ADC)  (ADCn)
  */

typedef struct {                                    /*!< (@ 0x400E3000) ADCn Structure                                         */
  __IO uint32_t  CR;                                /*!< (@ 0x400E3000) A/D Control Register. The AD0CR register must
                                                         be written to select the operating mode before A/D conversion
                                                          can occur.                                                           */
  __I  uint32_t  GDR;                               /*!< (@ 0x400E3004) A/D Global Data Register. Contains the result
                                                         of the most recent A/D conversion.                                    */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  INTEN;                             /*!< (@ 0x400E300C) A/D Interrupt Enable Register. This register
                                                         contains enable bits that allow the DONE flag of each A/D channel
                                                          to be included or excluded from contributing to the generation
                                                          of an A/D interrupt.                                                 */
  __I  uint32_t  DR[8];                             /*!< (@ 0x400E3010) A/D Channel Data Register. This register contains
                                                         the result of the most recent conversion completed on channel
                                                          n.                                                                   */
  __I  uint32_t  STAT;                              /*!< (@ 0x400E3030) A/D Status Register. This register contains DONE
                                                         and OVERRUN flags for all of the A/D channels, as well as the
                                                          A/D interrupt flag.                                                  */
} LPC_ADCn_Type;


/* ================================================================================ */
/* ================                      ADCHS                     ================ */
/* ================================================================================ */


/**
  * @brief 12-bit Analog-to-Digital Converter High-Speed (ADCHS) (ADCHS)
  */

typedef struct {                                    /*!< (@ 0x400F0000) ADCHS Structure                                        */
  __O  uint32_t  FLUSH;                             /*!< (@ 0x400F0000) Flushes FIFO                                           */
  __IO uint32_t  DMA_REQ;                           /*!< (@ 0x400F0004) Set or clear DMA write request                         */
  __I  uint32_t  FIFO_STS;                          /*!< (@ 0x400F0008) Indicates FIFO fill level status                       */
  __IO uint32_t  FIFO_CFG;                          /*!< (@ 0x400F000C) Configures FIFO fill level that triggers interrupt
                                                         and packing 1 or 2 samples per word.                                  */
  __O  uint32_t  TRIGGER;                           /*!< (@ 0x400F0010) Enable software trigger to start descriptor processing */
  __IO uint32_t  DSCR_STS;                          /*!< (@ 0x400F0014) Indicates active descriptor table and descriptor
                                                         entry                                                                 */
  __IO uint32_t  POWER_DOWN;                        /*!< (@ 0x400F0018) Set or clear power down mode                           */
  __IO uint32_t  CONFIG;                            /*!< (@ 0x400F001C) Configures external trigger mode, store channel
                                                         ID in FIFO and walk-up recovery time from power down.                 */
  __IO uint32_t  THR_A;                             /*!< (@ 0x400F0020) Configures window comparator A levels.                 */
  __IO uint32_t  THR_B;                             /*!< (@ 0x400F0024) Configures window comparator B levels.                 */
  __I  uint32_t  LAST_SAMPLE[6];                    /*!< (@ 0x400F0028) Contains last converted sample of input M [M=0..5)
                                                         and result of window comparator.                                      */
  __I  uint32_t  RESERVED0[49];
  __IO uint32_t  ADC_SPEED;                         /*!< (@ 0x400F0104) ADC speed control                                      */
  __IO uint32_t  POWER_CONTROL;                     /*!< (@ 0x400F0108) Configures ADC power vs. speed, DC-in biasing,
                                                         output format and power gating.                                       */
  __I  uint32_t  RESERVED1[61];
  __I  uint32_t  FIFO_OUTPUT[16];                   /*!< (@ 0x400F0200) FIFO output mapped to 16 consecutive address
                                                         locations. An output contains the value and input channel ID
                                                          of one or two converted samples                                      */
  __I  uint32_t  RESERVED2[48];
  __IO uint32_t  DESCRIPTOR0_[8];                   /*!< (@ 0x400F0300) Table 0 descriptor n, n= 0 to 7                        */
  __IO uint32_t  DESCRIPTOR1_[8];                   /*!< (@ 0x400F0320) Table 1 descriptors n, n=0 to 7                        */
  __I  uint32_t  RESERVED3[752];
  __O  uint32_t  CLR_EN0;                           /*!< (@ 0x400F0F00) Interrupt 0 clear mask                                 */
  __O  uint32_t  SET_EN0;                           /*!< (@ 0x400F0F04) Interrupt 0 set mask                                   */
  __I  uint32_t  MASK0;                             /*!< (@ 0x400F0F08) Interrupt 0 mask                                       */
  __I  uint32_t  STATUS0;                           /*!< (@ 0x400F0F0C) Interrupt 0 status. Interrupt 0 contains FIFO
                                                         fill level, descriptor status and ADC range under/overflow            */
  __O  uint32_t  CLR_STAT0;                         /*!< (@ 0x400F0F10) Interrupt 0 clear status                               */
  __O  uint32_t  SET_STAT0;                         /*!< (@ 0x400F0F14) Interrupt 0 set status                                 */
  __I  uint32_t  RESERVED4[2];
  __O  uint32_t  CLR_EN1;                           /*!< (@ 0x400F0F20) Interrupt 1 mask clear enable.                         */
  __O  uint32_t  SET_EN1;                           /*!< (@ 0x400F0F24) Interrupt 1 mask set enable                            */
  __I  uint32_t  MASK1;                             /*!< (@ 0x400F0F28) Interrupt 1 mask                                       */
  __I  uint32_t  STATUS1;                           /*!< (@ 0x400F0F2C) Interrupt 1 status. Interrupt 1 contains window
                                                         comparator results and register last LAST_SAMPLE[M] overrun.          */
  __O  uint32_t  CLR_STAT1;                         /*!< (@ 0x400F0F30) Interrupt 1 clear status                               */
  __O  uint32_t  SET_STAT1;                         /*!< (@ 0x400F0F34) Interrupt 1 set status                                 */
} LPC_ADCHS_Type;


/* ================================================================================ */
/* ================                    GPIO_PORT                   ================ */
/* ================================================================================ */


/**
  * @brief GPIO port  (GPIO_PORT)
  */

typedef struct {                                    /*!< (@ 0x400F4000) GPIO_PORT Structure                                    */
  __IO uint8_t   B[256];                            /*!< (@ 0x400F4000) Byte pin registers port 0 to 5; pins PIOn_0 to
                                                         PIOn_31                                                               */
  __I  uint32_t  RESERVED0[960];
  __IO uint32_t  W[256];                            /*!< (@ 0x400F5000) Word pin registers port 0 to 5                         */
  __I  uint32_t  RESERVED1[768];
  __IO uint32_t  DIR[8];                            /*!< (@ 0x400F6000) Direction registers port m                             */
  __I  uint32_t  RESERVED2[24];
  __IO uint32_t  MASK[8];                           /*!< (@ 0x400F6080) Mask register port m                                   */
  __I  uint32_t  RESERVED3[24];
  __IO uint32_t  PIN[8];                            /*!< (@ 0x400F6100) Port pin register port m                               */
  __I  uint32_t  RESERVED4[24];
  __IO uint32_t  MPIN[8];                           /*!< (@ 0x400F6180) Masked port register port m                            */
  __I  uint32_t  RESERVED5[24];
  __IO uint32_t  SET[8];                            /*!< (@ 0x400F6200) Write: Set register for port m Read: output bits
                                                         for port m                                                            */
  __I  uint32_t  RESERVED6[24];
  __O  uint32_t  CLR[8];                            /*!< (@ 0x400F6280) Clear port m                                           */
  __I  uint32_t  RESERVED7[24];
  __O  uint32_t  NOT[8];                            /*!< (@ 0x400F6300) Toggle port m                                          */
} LPC_GPIO_PORT_Type;


/* ================================================================================ */
/* ================                       SPI                      ================ */
/* ================================================================================ */


/**
  * @brief SPI  (SPI)
  */

typedef struct {                                    /*!< (@ 0x40100000) SPI Structure                                          */
  __IO uint32_t  CR;                                /*!< (@ 0x40100000) SPI Control Register. This register controls
                                                         the operation of the SPI.                                             */
  __I  uint32_t  SR;                                /*!< (@ 0x40100004) SPI Status Register. This register shows the
                                                         status of the SPI.                                                    */
  __IO uint32_t  DR;                                /*!< (@ 0x40100008) SPI Data Register. This bi-directional register
                                                         provides the transmit and receive data for the SPI. Transmit
                                                          data is provided to the SPI0 by writing to this register. Data
                                                          received by the SPI0 can be read from this register.                 */
  __IO uint32_t  CCR;                               /*!< (@ 0x4010000C) SPI Clock Counter Register. This register controls
                                                         the frequency of a master's SCK0.                                     */
  __IO uint32_t  TCR;                               /*!< (@ 0x40100010) SPI Test Control register. For functional testing
                                                         only.                                                                 */
  __IO uint32_t  TSR;                               /*!< (@ 0x40100014) SPI Test Status register. For functional testing
                                                         only.                                                                 */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  INT;                               /*!< (@ 0x4010001C) SPI Interrupt Flag. This register contains the
                                                         interrupt flag for the SPI interface.                                 */
} LPC_SPI_Type;


/* ================================================================================ */
/* ================                      SGPIO                     ================ */
/* ================================================================================ */


/**
  * @brief Serial GPIO (SGPIO) (SGPIO)
  */

typedef struct {                                    /*!< (@ 0x40101000) SGPIO Structure                                        */
  __IO uint32_t  OUT_MUX_CFG[16];                   /*!< (@ 0x40101000) Pin multiplexer configuration registers.               */
  __IO uint32_t  SGPIO_MUX_CFG[16];                 /*!< (@ 0x40101040) SGPIO multiplexer configuration registers.             */
  __IO uint32_t  SLICE_MUX_CFG[16];                 /*!< (@ 0x40101080) Slice multiplexer configuration registers.             */
  __IO uint32_t  REG[16];                           /*!< (@ 0x401010C0) Slice data registers. Each time COUNT0 reaches
                                                         0x0 the register shifts loading bit 31 with data captured from
                                                          DIN(n). DOUT(n) is set to REG(0)                                     */
  __IO uint32_t  REG_SS[16];                        /*!< (@ 0x40101100) Slice data shadow registers. Each time POS reaches
                                                         0x0 the contents of REG_SS is exchanged with the content of
                                                          REG                                                                  */
  __IO uint32_t  PRESET[16];                        /*!< (@ 0x40101140) Reload value of COUNT0, loaded when COUNT0 reaches
                                                         0x0                                                                   */
  __IO uint32_t  COUNT[16];                         /*!< (@ 0x40101180) Down counter, counts down each clock cycle.            */
  __IO uint32_t  POS[16];                           /*!< (@ 0x401011C0) Each time COUNT0 reaches 0x0 POS counts down.          */
  __IO uint32_t  MASK_A;                            /*!< (@ 0x40101200) Mask for pattern match function of slice A             */
  __IO uint32_t  MASK_H;                            /*!< (@ 0x40101204) Mask for pattern match function of slice H             */
  __IO uint32_t  MASK_I;                            /*!< (@ 0x40101208) Mask for pattern match function of slice I             */
  __IO uint32_t  MASK_P;                            /*!< (@ 0x4010120C) Mask for pattern match function of slice P             */
  __I  uint32_t  GPIO_INREG;                        /*!< (@ 0x40101210) GPIO input status register                             */
  __IO uint32_t  GPIO_OUTREG;                       /*!< (@ 0x40101214) GPIO output control register                           */
  __IO uint32_t  GPIO_OENREG;                       /*!< (@ 0x40101218) GPIO OE control register                               */
  __IO uint32_t  CTRL_ENABLE;                       /*!< (@ 0x4010121C) Enables the slice COUNT counter                        */
  __IO uint32_t  CTRL_DISABLE;                      /*!< (@ 0x40101220) Disables the slice POS counter                         */
  __I  uint32_t  RESERVED0[823];
  __O  uint32_t  CLR_EN_0;                          /*!< (@ 0x40101F00) Shift clock interrupt clear mask                       */
  __O  uint32_t  SET_EN_0;                          /*!< (@ 0x40101F04) Shift clock interrupt set mask                         */
  __I  uint32_t  ENABLE_0;                          /*!< (@ 0x40101F08) Shift clock interrupt enable                           */
  __I  uint32_t  STATUS_0;                          /*!< (@ 0x40101F0C) Shift clock interrupt status                           */
  __O  uint32_t  CLR_STATUS_0;                      /*!< (@ 0x40101F10) Shift clock interrupt clear status                     */
  __O  uint32_t  SET_STATUS_0;                      /*!< (@ 0x40101F14) Shift clock interrupt set status                       */
  __I  uint32_t  RESERVED1[2];
  __O  uint32_t  CLR_EN_1;                          /*!< (@ 0x40101F20) Exchange clock interrupt clear mask                    */
  __O  uint32_t  SET_EN_1;                          /*!< (@ 0x40101F24) Exchange clock interrupt set mask                      */
  __I  uint32_t  ENABLE_1;                          /*!< (@ 0x40101F28) Exchange clock interrupt enable                        */
  __I  uint32_t  STATUS_1;                          /*!< (@ 0x40101F2C) Exchange clock interrupt status                        */
  __O  uint32_t  CLR_STATUS_1;                      /*!< (@ 0x40101F30) Exchange clock interrupt clear status                  */
  __O  uint32_t  SET_STATUS_1;                      /*!< (@ 0x40101F34) Exchange clock interrupt set status                    */
  __I  uint32_t  RESERVED2[2];
  __O  uint32_t  CLR_EN_2;                          /*!< (@ 0x40101F40) Pattern match interrupt clear mask                     */
  __O  uint32_t  SET_EN_2;                          /*!< (@ 0x40101F44) Pattern match interrupt set mask                       */
  __I  uint32_t  ENABLE_2;                          /*!< (@ 0x40101F48) Pattern match interrupt enable                         */
  __I  uint32_t  STATUS_2;                          /*!< (@ 0x40101F4C) Pattern match interrupt status                         */
  __O  uint32_t  CLR_STATUS_2;                      /*!< (@ 0x40101F50) Pattern match interrupt clear status                   */
  __O  uint32_t  SET_STATUS_2;                      /*!< (@ 0x40101F54) Pattern match interrupt set status                     */
  __I  uint32_t  RESERVED3[2];
  __O  uint32_t  CLR_EN_3;                          /*!< (@ 0x40101F60) Input interrupt clear mask                             */
  __O  uint32_t  SET_EN_3;                          /*!< (@ 0x40101F64) Input bit match interrupt set mask                     */
  __I  uint32_t  ENABLE_3;                          /*!< (@ 0x40101F68) Input bit match interrupt enable                       */
  __I  uint32_t  STATUS_3;                          /*!< (@ 0x40101F6C) Input bit match interrupt status                       */
  __O  uint32_t  CLR_STATUS_3;                      /*!< (@ 0x40101F70) Input bit match interrupt clear status                 */
  __O  uint32_t  SET_STATUS_3;                      /*!< (@ 0x40101F74) Input bit match interrupt set status                   */
} LPC_SGPIO_Type;


/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif


