MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
#ifdef CMSIS_BITPOSITIONS
/* ================================================================================ */
/* ================          struct 'SCT' Position & Mask          ================ */
/* ================================================================================ */


/* ---------------------------------  SCT_CONFIG  --------------------------------- */
#define SCT_CONFIG_UNIFY_Pos                  0                                                       /*!< SCT CONFIG: UNIFY Position              */
#define SCT_CONFIG_UNIFY_Msk                  (0x01UL << SCT_CONFIG_UNIFY_Pos)                        /*!< SCT CONFIG: UNIFY Mask                  */
#define SCT_CONFIG_CLKMODE_Pos                1                                                       /*!< SCT CONFIG: CLKMODE Position            */
#define SCT_CONFIG_CLKMODE_Msk                (0x03UL << SCT_CONFIG_CLKMODE_Pos)                      /*!< SCT CONFIG: CLKMODE Mask                */
#define SCT_CONFIG_CKSEL_Pos                  3                                                       /*!< SCT CONFIG: CKSEL Position              */
#define SCT_CONFIG_CKSEL_Msk                  (0x0fUL << SCT_CONFIG_CKSEL_Pos)                        /*!< SCT CONFIG: CKSEL Mask                  */
#define SCT_CONFIG_NORELAOD_L_Pos             7                                                       /*!< SCT CONFIG: NORELAOD_L Position         */
#define SCT_CONFIG_NORELAOD_L_Msk             (0x01UL << SCT_CONFIG_NORELAOD_L_Pos)                   /*!< SCT CONFIG: NORELAOD_L Mask             */
#define SCT_CONFIG_NORELOAD_H_Pos             8                                                       /*!< SCT CONFIG: NORELOAD_H Position         */
#define SCT_CONFIG_NORELOAD_H_Msk             (0x01UL << SCT_CONFIG_NORELOAD_H_Pos)                   /*!< SCT CONFIG: NORELOAD_H Mask             */
#define SCT_CONFIG_INSYNC_Pos                 9                                                       /*!< SCT CONFIG: INSYNC Position             */
#define SCT_CONFIG_INSYNC_Msk                 (0x000000ffUL << SCT_CONFIG_INSYNC_Pos)                 /*!< SCT CONFIG: INSYNC Mask                 */
#define SCT_CONFIG_AUTOLIMIT_L_Pos            17                                                      /*!< SCT CONFIG: AUTOLIMIT_L Position        */
#define SCT_CONFIG_AUTOLIMIT_L_Msk            (0x01UL << SCT_CONFIG_AUTOLIMIT_L_Pos)                  /*!< SCT CONFIG: AUTOLIMIT_L Mask            */
#define SCT_CONFIG_AUTOLIMIT_H_Pos            18                                                      /*!< SCT CONFIG: AUTOLIMIT_H Position        */
#define SCT_CONFIG_AUTOLIMIT_H_Msk            (0x01UL << SCT_CONFIG_AUTOLIMIT_H_Pos)                  /*!< SCT CONFIG: AUTOLIMIT_H Mask            */

/* ----------------------------------  SCT_CTRL  ---------------------------------- */
#define SCT_CTRL_DOWN_L_Pos                   0                                                       /*!< SCT CTRL: DOWN_L Position               */
#define SCT_CTRL_DOWN_L_Msk                   (0x01UL << SCT_CTRL_DOWN_L_Pos)                         /*!< SCT CTRL: DOWN_L Mask                   */
#define SCT_CTRL_STOP_L_Pos                   1                                                       /*!< SCT CTRL: STOP_L Position               */
#define SCT_CTRL_STOP_L_Msk                   (0x01UL << SCT_CTRL_STOP_L_Pos)                         /*!< SCT CTRL: STOP_L Mask                   */
#define SCT_CTRL_HALT_L_Pos                   2                                                       /*!< SCT CTRL: HALT_L Position               */
#define SCT_CTRL_HALT_L_Msk                   (0x01UL << SCT_CTRL_HALT_L_Pos)                         /*!< SCT CTRL: HALT_L Mask                   */
#define SCT_CTRL_CLRCTR_L_Pos                 3                                                       /*!< SCT CTRL: CLRCTR_L Position             */
#define SCT_CTRL_CLRCTR_L_Msk                 (0x01UL << SCT_CTRL_CLRCTR_L_Pos)                       /*!< SCT CTRL: CLRCTR_L Mask                 */
#define SCT_CTRL_BIDIR_L_Pos                  4                                                       /*!< SCT CTRL: BIDIR_L Position              */
#define SCT_CTRL_BIDIR_L_Msk                  (0x01UL << SCT_CTRL_BIDIR_L_Pos)                        /*!< SCT CTRL: BIDIR_L Mask                  */
#define SCT_CTRL_PRE_L_Pos                    5                                                       /*!< SCT CTRL: PRE_L Position                */
#define SCT_CTRL_PRE_L_Msk                    (0x000000ffUL << SCT_CTRL_PRE_L_Pos)                    /*!< SCT CTRL: PRE_L Mask                    */
#define SCT_CTRL_DOWN_H_Pos                   16                                                      /*!< SCT CTRL: DOWN_H Position               */
#define SCT_CTRL_DOWN_H_Msk                   (0x01UL << SCT_CTRL_DOWN_H_Pos)                         /*!< SCT CTRL: DOWN_H Mask                   */
#define SCT_CTRL_STOP_H_Pos                   17                                                      /*!< SCT CTRL: STOP_H Position               */
#define SCT_CTRL_STOP_H_Msk                   (0x01UL << SCT_CTRL_STOP_H_Pos)                         /*!< SCT CTRL: STOP_H Mask                   */
#define SCT_CTRL_HALT_H_Pos                   18                                                      /*!< SCT CTRL: HALT_H Position               */
#define SCT_CTRL_HALT_H_Msk                   (0x01UL << SCT_CTRL_HALT_H_Pos)                         /*!< SCT CTRL: HALT_H Mask                   */
#define SCT_CTRL_CLRCTR_H_Pos                 19                                                      /*!< SCT CTRL: CLRCTR_H Position             */
#define SCT_CTRL_CLRCTR_H_Msk                 (0x01UL << SCT_CTRL_CLRCTR_H_Pos)                       /*!< SCT CTRL: CLRCTR_H Mask                 */
#define SCT_CTRL_BIDIR_H_Pos                  20                                                      /*!< SCT CTRL: BIDIR_H Position              */
#define SCT_CTRL_BIDIR_H_Msk                  (0x01UL << SCT_CTRL_BIDIR_H_Pos)                        /*!< SCT CTRL: BIDIR_H Mask                  */
#define SCT_CTRL_PRE_H_Pos                    21                                                      /*!< SCT CTRL: PRE_H Position                */
#define SCT_CTRL_PRE_H_Msk                    (0x000000ffUL << SCT_CTRL_PRE_H_Pos)                    /*!< SCT CTRL: PRE_H Mask                    */

/* ----------------------------------  SCT_LIMIT  --------------------------------- */
#define SCT_LIMIT_LIMMSK_L_Pos                0                                                       /*!< SCT LIMIT: LIMMSK_L Position            */
#define SCT_LIMIT_LIMMSK_L_Msk                (0x0000ffffUL << SCT_LIMIT_LIMMSK_L_Pos)                /*!< SCT LIMIT: LIMMSK_L Mask                */
#define SCT_LIMIT_LIMMSK_H_Pos                16                                                      /*!< SCT LIMIT: LIMMSK_H Position            */
#define SCT_LIMIT_LIMMSK_H_Msk                (0x0000ffffUL << SCT_LIMIT_LIMMSK_H_Pos)                /*!< SCT LIMIT: LIMMSK_H Mask                */

/* ----------------------------------  SCT_HALT  ---------------------------------- */
#define SCT_HALT_HALTMSK_L_Pos                0                                                       /*!< SCT HALT: HALTMSK_L Position            */
#define SCT_HALT_HALTMSK_L_Msk                (0x0000ffffUL << SCT_HALT_HALTMSK_L_Pos)                /*!< SCT HALT: HALTMSK_L Mask                */
#define SCT_HALT_HALTMSK_H_Pos                16                                                      /*!< SCT HALT: HALTMSK_H Position            */
#define SCT_HALT_HALTMSK_H_Msk                (0x0000ffffUL << SCT_HALT_HALTMSK_H_Pos)                /*!< SCT HALT: HALTMSK_H Mask                */

