MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ----------------------------------  SCT_STOP  ---------------------------------- */
#define SCT_STOP_STOPMSK_L_Pos                0                                                       /*!< SCT STOP: STOPMSK_L Position            */
#define SCT_STOP_STOPMSK_L_Msk                (0x0000ffffUL << SCT_STOP_STOPMSK_L_Pos)                /*!< SCT STOP: STOPMSK_L Mask                */
#define SCT_STOP_STOPMSK_H_Pos                16                                                      /*!< SCT STOP: STOPMSK_H Position            */
#define SCT_STOP_STOPMSK_H_Msk                (0x0000ffffUL << SCT_STOP_STOPMSK_H_Pos)                /*!< SCT STOP: STOPMSK_H Mask                */

/* ----------------------------------  SCT_START  --------------------------------- */
#define SCT_START_STARTMSK_L_Pos              0                                                       /*!< SCT START: STARTMSK_L Position          */
#define SCT_START_STARTMSK_L_Msk              (0x0000ffffUL << SCT_START_STARTMSK_L_Pos)              /*!< SCT START: STARTMSK_L Mask              */
#define SCT_START_STARTMSK_H_Pos              16                                                      /*!< SCT START: STARTMSK_H Position          */
#define SCT_START_STARTMSK_H_Msk              (0x0000ffffUL << SCT_START_STARTMSK_H_Pos)              /*!< SCT START: STARTMSK_H Mask              */

/* ---------------------------------  SCT_DITHER  --------------------------------- */
#define SCT_DITHER_DITHMSK_L_Pos              0                                                       /*!< SCT DITHER: DITHMSK_L Position          */
#define SCT_DITHER_DITHMSK_L_Msk              (0x0000ffffUL << SCT_DITHER_DITHMSK_L_Pos)              /*!< SCT DITHER: DITHMSK_L Mask              */
#define SCT_DITHER_DITHMSK_H_Pos              16                                                      /*!< SCT DITHER: DITHMSK_H Position          */
#define SCT_DITHER_DITHMSK_H_Msk              (0x0000ffffUL << SCT_DITHER_DITHMSK_H_Pos)              /*!< SCT DITHER: DITHMSK_H Mask              */

/* ----------------------------------  SCT_COUNT  --------------------------------- */
#define SCT_COUNT_CTR_L_Pos                   0                                                       /*!< SCT COUNT: CTR_L Position               */
#define SCT_COUNT_CTR_L_Msk                   (0x0000ffffUL << SCT_COUNT_CTR_L_Pos)                   /*!< SCT COUNT: CTR_L Mask                   */
#define SCT_COUNT_CTR_H_Pos                   16                                                      /*!< SCT COUNT: CTR_H Position               */
#define SCT_COUNT_CTR_H_Msk                   (0x0000ffffUL << SCT_COUNT_CTR_H_Pos)                   /*!< SCT COUNT: CTR_H Mask                   */

/* ----------------------------------  SCT_STATE  --------------------------------- */
#define SCT_STATE_STATE_L_Pos                 0                                                       /*!< SCT STATE: STATE_L Position             */
#define SCT_STATE_STATE_L_Msk                 (0x1fUL << SCT_STATE_STATE_L_Pos)                       /*!< SCT STATE: STATE_L Mask                 */
#define SCT_STATE_STATE_H_Pos                 16                                                      /*!< SCT STATE: STATE_H Position             */
#define SCT_STATE_STATE_H_Msk                 (0x1fUL << SCT_STATE_STATE_H_Pos)                       /*!< SCT STATE: STATE_H Mask                 */

/* ----------------------------------  SCT_INPUT  --------------------------------- */
#define SCT_INPUT_AIN0_Pos                    0                                                       /*!< SCT INPUT: AIN0 Position                */
#define SCT_INPUT_AIN0_Msk                    (0x01UL << SCT_INPUT_AIN0_Pos)                          /*!< SCT INPUT: AIN0 Mask                    */
#define SCT_INPUT_AIN1_Pos                    1                                                       /*!< SCT INPUT: AIN1 Position                */
#define SCT_INPUT_AIN1_Msk                    (0x01UL << SCT_INPUT_AIN1_Pos)                          /*!< SCT INPUT: AIN1 Mask                    */
#define SCT_INPUT_AIN2_Pos                    2                                                       /*!< SCT INPUT: AIN2 Position                */
#define SCT_INPUT_AIN2_Msk                    (0x01UL << SCT_INPUT_AIN2_Pos)                          /*!< SCT INPUT: AIN2 Mask                    */
#define SCT_INPUT_AIN3_Pos                    3                                                       /*!< SCT INPUT: AIN3 Position                */
#define SCT_INPUT_AIN3_Msk                    (0x01UL << SCT_INPUT_AIN3_Pos)                          /*!< SCT INPUT: AIN3 Mask                    */
#define SCT_INPUT_AIN4_Pos                    4                                                       /*!< SCT INPUT: AIN4 Position                */
#define SCT_INPUT_AIN4_Msk                    (0x01UL << SCT_INPUT_AIN4_Pos)                          /*!< SCT INPUT: AIN4 Mask                    */
#define SCT_INPUT_AIN5_Pos                    5                                                       /*!< SCT INPUT: AIN5 Position                */
#define SCT_INPUT_AIN5_Msk                    (0x01UL << SCT_INPUT_AIN5_Pos)                          /*!< SCT INPUT: AIN5 Mask                    */
#define SCT_INPUT_AIN6_Pos                    6                                                       /*!< SCT INPUT: AIN6 Position                */
#define SCT_INPUT_AIN6_Msk                    (0x01UL << SCT_INPUT_AIN6_Pos)                          /*!< SCT INPUT: AIN6 Mask                    */
#define SCT_INPUT_AIN7_Pos                    7                                                       /*!< SCT INPUT: AIN7 Position                */
#define SCT_INPUT_AIN7_Msk                    (0x01UL << SCT_INPUT_AIN7_Pos)                          /*!< SCT INPUT: AIN7 Mask                    */
#define SCT_INPUT_SIN0_Pos                    16                                                      /*!< SCT INPUT: SIN0 Position                */
#define SCT_INPUT_SIN0_Msk                    (0x01UL << SCT_INPUT_SIN0_Pos)                          /*!< SCT INPUT: SIN0 Mask                    */
#define SCT_INPUT_SIN1_Pos                    17                                                      /*!< SCT INPUT: SIN1 Position                */
#define SCT_INPUT_SIN1_Msk                    (0x01UL << SCT_INPUT_SIN1_Pos)                          /*!< SCT INPUT: SIN1 Mask                    */
#define SCT_INPUT_SIN2_Pos                    18                                                      /*!< SCT INPUT: SIN2 Position                */
#define SCT_INPUT_SIN2_Msk                    (0x01UL << SCT_INPUT_SIN2_Pos)                          /*!< SCT INPUT: SIN2 Mask                    */
#define SCT_INPUT_SIN3_Pos                    19                                                      /*!< SCT INPUT: SIN3 Position                */
#define SCT_INPUT_SIN3_Msk                    (0x01UL << SCT_INPUT_SIN3_Pos)                          /*!< SCT INPUT: SIN3 Mask                    */
#define SCT_INPUT_SIN4_Pos                    20                                                      /*!< SCT INPUT: SIN4 Position                */
#define SCT_INPUT_SIN4_Msk                    (0x01UL << SCT_INPUT_SIN4_Pos)                          /*!< SCT INPUT: SIN4 Mask                    */
#define SCT_INPUT_SIN5_Pos                    21                                                      /*!< SCT INPUT: SIN5 Position                */
#define SCT_INPUT_SIN5_Msk                    (0x01UL << SCT_INPUT_SIN5_Pos)                          /*!< SCT INPUT: SIN5 Mask                    */
#define SCT_INPUT_SIN6_Pos                    22                                                      /*!< SCT INPUT: SIN6 Position                */
#define SCT_INPUT_SIN6_Msk                    (0x01UL << SCT_INPUT_SIN6_Pos)                          /*!< SCT INPUT: SIN6 Mask                    */
#define SCT_INPUT_SIN7_Pos                    23                                                      /*!< SCT INPUT: SIN7 Position                */
#define SCT_INPUT_SIN7_Msk                    (0x01UL << SCT_INPUT_SIN7_Pos)                          /*!< SCT INPUT: SIN7 Mask                    */

