MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  SCT_EVFLAG  --------------------------------- */
#define SCT_EVFLAG_FLAG0_Pos                  0                                                       /*!< SCT EVFLAG: FLAG0 Position              */
#define SCT_EVFLAG_FLAG0_Msk                  (0x01UL << SCT_EVFLAG_FLAG0_Pos)                        /*!< SCT EVFLAG: FLAG0 Mask                  */
#define SCT_EVFLAG_FLAG1_Pos                  1                                                       /*!< SCT EVFLAG: FLAG1 Position              */
#define SCT_EVFLAG_FLAG1_Msk                  (0x01UL << SCT_EVFLAG_FLAG1_Pos)                        /*!< SCT EVFLAG: FLAG1 Mask                  */
#define SCT_EVFLAG_FLAG2_Pos                  2                                                       /*!< SCT EVFLAG: FLAG2 Position              */
#define SCT_EVFLAG_FLAG2_Msk                  (0x01UL << SCT_EVFLAG_FLAG2_Pos)                        /*!< SCT EVFLAG: FLAG2 Mask                  */
#define SCT_EVFLAG_FLAG3_Pos                  3                                                       /*!< SCT EVFLAG: FLAG3 Position              */
#define SCT_EVFLAG_FLAG3_Msk                  (0x01UL << SCT_EVFLAG_FLAG3_Pos)                        /*!< SCT EVFLAG: FLAG3 Mask                  */
#define SCT_EVFLAG_FLAG4_Pos                  4                                                       /*!< SCT EVFLAG: FLAG4 Position              */
#define SCT_EVFLAG_FLAG4_Msk                  (0x01UL << SCT_EVFLAG_FLAG4_Pos)                        /*!< SCT EVFLAG: FLAG4 Mask                  */
#define SCT_EVFLAG_FLAG5_Pos                  5                                                       /*!< SCT EVFLAG: FLAG5 Position              */
#define SCT_EVFLAG_FLAG5_Msk                  (0x01UL << SCT_EVFLAG_FLAG5_Pos)                        /*!< SCT EVFLAG: FLAG5 Mask                  */
#define SCT_EVFLAG_FLAG6_Pos                  6                                                       /*!< SCT EVFLAG: FLAG6 Position              */
#define SCT_EVFLAG_FLAG6_Msk                  (0x01UL << SCT_EVFLAG_FLAG6_Pos)                        /*!< SCT EVFLAG: FLAG6 Mask                  */
#define SCT_EVFLAG_FLAG7_Pos                  7                                                       /*!< SCT EVFLAG: FLAG7 Position              */
#define SCT_EVFLAG_FLAG7_Msk                  (0x01UL << SCT_EVFLAG_FLAG7_Pos)                        /*!< SCT EVFLAG: FLAG7 Mask                  */
#define SCT_EVFLAG_FLAG8_Pos                  8                                                       /*!< SCT EVFLAG: FLAG8 Position              */
#define SCT_EVFLAG_FLAG8_Msk                  (0x01UL << SCT_EVFLAG_FLAG8_Pos)                        /*!< SCT EVFLAG: FLAG8 Mask                  */
#define SCT_EVFLAG_FLAG9_Pos                  9                                                       /*!< SCT EVFLAG: FLAG9 Position              */
#define SCT_EVFLAG_FLAG9_Msk                  (0x01UL << SCT_EVFLAG_FLAG9_Pos)                        /*!< SCT EVFLAG: FLAG9 Mask                  */
#define SCT_EVFLAG_FLAG10_Pos                 10                                                      /*!< SCT EVFLAG: FLAG10 Position             */
#define SCT_EVFLAG_FLAG10_Msk                 (0x01UL << SCT_EVFLAG_FLAG10_Pos)                       /*!< SCT EVFLAG: FLAG10 Mask                 */
#define SCT_EVFLAG_FLAG11_Pos                 11                                                      /*!< SCT EVFLAG: FLAG11 Position             */
#define SCT_EVFLAG_FLAG11_Msk                 (0x01UL << SCT_EVFLAG_FLAG11_Pos)                       /*!< SCT EVFLAG: FLAG11 Mask                 */
#define SCT_EVFLAG_FLAG12_Pos                 12                                                      /*!< SCT EVFLAG: FLAG12 Position             */
#define SCT_EVFLAG_FLAG12_Msk                 (0x01UL << SCT_EVFLAG_FLAG12_Pos)                       /*!< SCT EVFLAG: FLAG12 Mask                 */
#define SCT_EVFLAG_FLAG13_Pos                 13                                                      /*!< SCT EVFLAG: FLAG13 Position             */
#define SCT_EVFLAG_FLAG13_Msk                 (0x01UL << SCT_EVFLAG_FLAG13_Pos)                       /*!< SCT EVFLAG: FLAG13 Mask                 */
#define SCT_EVFLAG_FLAG14_Pos                 14                                                      /*!< SCT EVFLAG: FLAG14 Position             */
#define SCT_EVFLAG_FLAG14_Msk                 (0x01UL << SCT_EVFLAG_FLAG14_Pos)                       /*!< SCT EVFLAG: FLAG14 Mask                 */
#define SCT_EVFLAG_FLAG15_Pos                 15                                                      /*!< SCT EVFLAG: FLAG15 Position             */
#define SCT_EVFLAG_FLAG15_Msk                 (0x01UL << SCT_EVFLAG_FLAG15_Pos)                       /*!< SCT EVFLAG: FLAG15 Mask                 */

/* ----------------------------------  SCT_CONEN  --------------------------------- */
#define SCT_CONEN_NCEN0_Pos                   0                                                       /*!< SCT CONEN: NCEN0 Position               */
#define SCT_CONEN_NCEN0_Msk                   (0x01UL << SCT_CONEN_NCEN0_Pos)                         /*!< SCT CONEN: NCEN0 Mask                   */
#define SCT_CONEN_NCEN1_Pos                   1                                                       /*!< SCT CONEN: NCEN1 Position               */
#define SCT_CONEN_NCEN1_Msk                   (0x01UL << SCT_CONEN_NCEN1_Pos)                         /*!< SCT CONEN: NCEN1 Mask                   */
#define SCT_CONEN_NCEN2_Pos                   2                                                       /*!< SCT CONEN: NCEN2 Position               */
#define SCT_CONEN_NCEN2_Msk                   (0x01UL << SCT_CONEN_NCEN2_Pos)                         /*!< SCT CONEN: NCEN2 Mask                   */
#define SCT_CONEN_NCEN3_Pos                   3                                                       /*!< SCT CONEN: NCEN3 Position               */
#define SCT_CONEN_NCEN3_Msk                   (0x01UL << SCT_CONEN_NCEN3_Pos)                         /*!< SCT CONEN: NCEN3 Mask                   */
#define SCT_CONEN_NCEN4_Pos                   4                                                       /*!< SCT CONEN: NCEN4 Position               */
#define SCT_CONEN_NCEN4_Msk                   (0x01UL << SCT_CONEN_NCEN4_Pos)                         /*!< SCT CONEN: NCEN4 Mask                   */
#define SCT_CONEN_NCEN5_Pos                   5                                                       /*!< SCT CONEN: NCEN5 Position               */
#define SCT_CONEN_NCEN5_Msk                   (0x01UL << SCT_CONEN_NCEN5_Pos)                         /*!< SCT CONEN: NCEN5 Mask                   */
#define SCT_CONEN_NCEN6_Pos                   6                                                       /*!< SCT CONEN: NCEN6 Position               */
#define SCT_CONEN_NCEN6_Msk                   (0x01UL << SCT_CONEN_NCEN6_Pos)                         /*!< SCT CONEN: NCEN6 Mask                   */
#define SCT_CONEN_NCEN7_Pos                   7                                                       /*!< SCT CONEN: NCEN7 Position               */
#define SCT_CONEN_NCEN7_Msk                   (0x01UL << SCT_CONEN_NCEN7_Pos)                         /*!< SCT CONEN: NCEN7 Mask                   */
#define SCT_CONEN_NCEN8_Pos                   8                                                       /*!< SCT CONEN: NCEN8 Position               */
#define SCT_CONEN_NCEN8_Msk                   (0x01UL << SCT_CONEN_NCEN8_Pos)                         /*!< SCT CONEN: NCEN8 Mask                   */
#define SCT_CONEN_NCEN9_Pos                   9                                                       /*!< SCT CONEN: NCEN9 Position               */
#define SCT_CONEN_NCEN9_Msk                   (0x01UL << SCT_CONEN_NCEN9_Pos)                         /*!< SCT CONEN: NCEN9 Mask                   */
#define SCT_CONEN_NCEN10_Pos                  10                                                      /*!< SCT CONEN: NCEN10 Position              */
#define SCT_CONEN_NCEN10_Msk                  (0x01UL << SCT_CONEN_NCEN10_Pos)                        /*!< SCT CONEN: NCEN10 Mask                  */
#define SCT_CONEN_NCEN11_Pos                  11                                                      /*!< SCT CONEN: NCEN11 Position              */
#define SCT_CONEN_NCEN11_Msk                  (0x01UL << SCT_CONEN_NCEN11_Pos)                        /*!< SCT CONEN: NCEN11 Mask                  */
#define SCT_CONEN_NCEN12_Pos                  12                                                      /*!< SCT CONEN: NCEN12 Position              */
#define SCT_CONEN_NCEN12_Msk                  (0x01UL << SCT_CONEN_NCEN12_Pos)                        /*!< SCT CONEN: NCEN12 Mask                  */
#define SCT_CONEN_NCEN13_Pos                  13                                                      /*!< SCT CONEN: NCEN13 Position              */
#define SCT_CONEN_NCEN13_Msk                  (0x01UL << SCT_CONEN_NCEN13_Pos)                        /*!< SCT CONEN: NCEN13 Mask                  */
#define SCT_CONEN_NCEN14_Pos                  14                                                      /*!< SCT CONEN: NCEN14 Position              */
#define SCT_CONEN_NCEN14_Msk                  (0x01UL << SCT_CONEN_NCEN14_Pos)                        /*!< SCT CONEN: NCEN14 Mask                  */
#define SCT_CONEN_NCEN15_Pos                  15                                                      /*!< SCT CONEN: NCEN15 Position              */
#define SCT_CONEN_NCEN15_Msk                  (0x01UL << SCT_CONEN_NCEN15_Pos)                        /*!< SCT CONEN: NCEN15 Mask                  */

/* ---------------------------------  SCT_CONFLAG  -------------------------------- */
#define SCT_CONFLAG_NCFLAG0_Pos               0                                                       /*!< SCT CONFLAG: NCFLAG0 Position           */
#define SCT_CONFLAG_NCFLAG0_Msk               (0x01UL << SCT_CONFLAG_NCFLAG0_Pos)                     /*!< SCT CONFLAG: NCFLAG0 Mask               */
#define SCT_CONFLAG_NCFLAG1_Pos               1                                                       /*!< SCT CONFLAG: NCFLAG1 Position           */
#define SCT_CONFLAG_NCFLAG1_Msk               (0x01UL << SCT_CONFLAG_NCFLAG1_Pos)                     /*!< SCT CONFLAG: NCFLAG1 Mask               */
#define SCT_CONFLAG_NCFLAG2_Pos               2                                                       /*!< SCT CONFLAG: NCFLAG2 Position           */
#define SCT_CONFLAG_NCFLAG2_Msk               (0x01UL << SCT_CONFLAG_NCFLAG2_Pos)                     /*!< SCT CONFLAG: NCFLAG2 Mask               */
#define SCT_CONFLAG_NCFLAG3_Pos               3                                                       /*!< SCT CONFLAG: NCFLAG3 Position           */
#define SCT_CONFLAG_NCFLAG3_Msk               (0x01UL << SCT_CONFLAG_NCFLAG3_Pos)                     /*!< SCT CONFLAG: NCFLAG3 Mask               */
#define SCT_CONFLAG_NCFLAG4_Pos               4                                                       /*!< SCT CONFLAG: NCFLAG4 Position           */
#define SCT_CONFLAG_NCFLAG4_Msk               (0x01UL << SCT_CONFLAG_NCFLAG4_Pos)                     /*!< SCT CONFLAG: NCFLAG4 Mask               */
#define SCT_CONFLAG_NCFLAG5_Pos               5                                                       /*!< SCT CONFLAG: NCFLAG5 Position           */
#define SCT_CONFLAG_NCFLAG5_Msk               (0x01UL << SCT_CONFLAG_NCFLAG5_Pos)                     /*!< SCT CONFLAG: NCFLAG5 Mask               */
#define SCT_CONFLAG_NCFLAG6_Pos               6                                                       /*!< SCT CONFLAG: NCFLAG6 Position           */
#define SCT_CONFLAG_NCFLAG6_Msk               (0x01UL << SCT_CONFLAG_NCFLAG6_Pos)                     /*!< SCT CONFLAG: NCFLAG6 Mask               */
#define SCT_CONFLAG_NCFLAG7_Pos               7                                                       /*!< SCT CONFLAG: NCFLAG7 Position           */
#define SCT_CONFLAG_NCFLAG7_Msk               (0x01UL << SCT_CONFLAG_NCFLAG7_Pos)                     /*!< SCT CONFLAG: NCFLAG7 Mask               */
#define SCT_CONFLAG_NCFLAG8_Pos               8                                                       /*!< SCT CONFLAG: NCFLAG8 Position           */
#define SCT_CONFLAG_NCFLAG8_Msk               (0x01UL << SCT_CONFLAG_NCFLAG8_Pos)                     /*!< SCT CONFLAG: NCFLAG8 Mask               */
#define SCT_CONFLAG_NCFLAG9_Pos               9                                                       /*!< SCT CONFLAG: NCFLAG9 Position           */
#define SCT_CONFLAG_NCFLAG9_Msk               (0x01UL << SCT_CONFLAG_NCFLAG9_Pos)                     /*!< SCT CONFLAG: NCFLAG9 Mask               */
#define SCT_CONFLAG_NCFLAG10_Pos              10                                                      /*!< SCT CONFLAG: NCFLAG10 Position          */
#define SCT_CONFLAG_NCFLAG10_Msk              (0x01UL << SCT_CONFLAG_NCFLAG10_Pos)                    /*!< SCT CONFLAG: NCFLAG10 Mask              */
#define SCT_CONFLAG_NCFLAG11_Pos              11                                                      /*!< SCT CONFLAG: NCFLAG11 Position          */
#define SCT_CONFLAG_NCFLAG11_Msk              (0x01UL << SCT_CONFLAG_NCFLAG11_Pos)                    /*!< SCT CONFLAG: NCFLAG11 Mask              */
#define SCT_CONFLAG_NCFLAG12_Pos              12                                                      /*!< SCT CONFLAG: NCFLAG12 Position          */
#define SCT_CONFLAG_NCFLAG12_Msk              (0x01UL << SCT_CONFLAG_NCFLAG12_Pos)                    /*!< SCT CONFLAG: NCFLAG12 Mask              */
#define SCT_CONFLAG_NCFLAG13_Pos              13                                                      /*!< SCT CONFLAG: NCFLAG13 Position          */
#define SCT_CONFLAG_NCFLAG13_Msk              (0x01UL << SCT_CONFLAG_NCFLAG13_Pos)                    /*!< SCT CONFLAG: NCFLAG13 Mask              */
#define SCT_CONFLAG_NCFLAG14_Pos              14                                                      /*!< SCT CONFLAG: NCFLAG14 Position          */
#define SCT_CONFLAG_NCFLAG14_Msk              (0x01UL << SCT_CONFLAG_NCFLAG14_Pos)                    /*!< SCT CONFLAG: NCFLAG14 Mask              */
#define SCT_CONFLAG_NCFLAG15_Pos              15                                                      /*!< SCT CONFLAG: NCFLAG15 Position          */
#define SCT_CONFLAG_NCFLAG15_Msk              (0x01UL << SCT_CONFLAG_NCFLAG15_Pos)                    /*!< SCT CONFLAG: NCFLAG15 Mask              */
#define SCT_CONFLAG_BUSERRL_Pos               30                                                      /*!< SCT CONFLAG: BUSERRL Position           */
#define SCT_CONFLAG_BUSERRL_Msk               (0x01UL << SCT_CONFLAG_BUSERRL_Pos)                     /*!< SCT CONFLAG: BUSERRL Mask               */
#define SCT_CONFLAG_BUSERRH_Pos               31                                                      /*!< SCT CONFLAG: BUSERRH Position           */
#define SCT_CONFLAG_BUSERRH_Msk               (0x01UL << SCT_CONFLAG_BUSERRH_Pos)                     /*!< SCT CONFLAG: BUSERRH Mask               */

