MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  SCT_MATCH5  --------------------------------- */
#define SCT_MATCH5_MATCH_L_Pos                0                                                       /*!< SCT MATCH5: MATCH_L Position            */
#define SCT_MATCH5_MATCH_L_Msk                (0x0000ffffUL << SCT_MATCH5_MATCH_L_Pos)                /*!< SCT MATCH5: MATCH_L Mask                */
#define SCT_MATCH5_MATCH_H_Pos                16                                                      /*!< SCT MATCH5: MATCH_H Position            */
#define SCT_MATCH5_MATCH_H_Msk                (0x0000ffffUL << SCT_MATCH5_MATCH_H_Pos)                /*!< SCT MATCH5: MATCH_H Mask                */

/* ----------------------------------  SCT_CAP5  ---------------------------------- */
#define SCT_CAP5_CAP_L_Pos                    0                                                       /*!< SCT CAP5: CAP_L Position                */
#define SCT_CAP5_CAP_L_Msk                    (0x0000ffffUL << SCT_CAP5_CAP_L_Pos)                    /*!< SCT CAP5: CAP_L Mask                    */
#define SCT_CAP5_CAP_H_Pos                    16                                                      /*!< SCT CAP5: CAP_H Position                */
#define SCT_CAP5_CAP_H_Msk                    (0x0000ffffUL << SCT_CAP5_CAP_H_Pos)                    /*!< SCT CAP5: CAP_H Mask                    */

/* ----------------------------------  SCT_CAP6  ---------------------------------- */
#define SCT_CAP6_CAP_L_Pos                    0                                                       /*!< SCT CAP6: CAP_L Position                */
#define SCT_CAP6_CAP_L_Msk                    (0x0000ffffUL << SCT_CAP6_CAP_L_Pos)                    /*!< SCT CAP6: CAP_L Mask                    */
#define SCT_CAP6_CAP_H_Pos                    16                                                      /*!< SCT CAP6: CAP_H Position                */
#define SCT_CAP6_CAP_H_Msk                    (0x0000ffffUL << SCT_CAP6_CAP_H_Pos)                    /*!< SCT CAP6: CAP_H Mask                    */

/* ---------------------------------  SCT_MATCH6  --------------------------------- */
#define SCT_MATCH6_MATCH_L_Pos                0                                                       /*!< SCT MATCH6: MATCH_L Position            */
#define SCT_MATCH6_MATCH_L_Msk                (0x0000ffffUL << SCT_MATCH6_MATCH_L_Pos)                /*!< SCT MATCH6: MATCH_L Mask                */
#define SCT_MATCH6_MATCH_H_Pos                16                                                      /*!< SCT MATCH6: MATCH_H Position            */
#define SCT_MATCH6_MATCH_H_Msk                (0x0000ffffUL << SCT_MATCH6_MATCH_H_Pos)                /*!< SCT MATCH6: MATCH_H Mask                */

/* ----------------------------------  SCT_CAP7  ---------------------------------- */
#define SCT_CAP7_CAP_L_Pos                    0                                                       /*!< SCT CAP7: CAP_L Position                */
#define SCT_CAP7_CAP_L_Msk                    (0x0000ffffUL << SCT_CAP7_CAP_L_Pos)                    /*!< SCT CAP7: CAP_L Mask                    */
#define SCT_CAP7_CAP_H_Pos                    16                                                      /*!< SCT CAP7: CAP_H Position                */
#define SCT_CAP7_CAP_H_Msk                    (0x0000ffffUL << SCT_CAP7_CAP_H_Pos)                    /*!< SCT CAP7: CAP_H Mask                    */

/* ---------------------------------  SCT_MATCH7  --------------------------------- */
#define SCT_MATCH7_MATCH_L_Pos                0                                                       /*!< SCT MATCH7: MATCH_L Position            */
#define SCT_MATCH7_MATCH_L_Msk                (0x0000ffffUL << SCT_MATCH7_MATCH_L_Pos)                /*!< SCT MATCH7: MATCH_L Mask                */
#define SCT_MATCH7_MATCH_H_Pos                16                                                      /*!< SCT MATCH7: MATCH_H Position            */
#define SCT_MATCH7_MATCH_H_Msk                (0x0000ffffUL << SCT_MATCH7_MATCH_H_Pos)                /*!< SCT MATCH7: MATCH_H Mask                */

/* ----------------------------------  SCT_CAP8  ---------------------------------- */
#define SCT_CAP8_CAP_L_Pos                    0                                                       /*!< SCT CAP8: CAP_L Position                */
#define SCT_CAP8_CAP_L_Msk                    (0x0000ffffUL << SCT_CAP8_CAP_L_Pos)                    /*!< SCT CAP8: CAP_L Mask                    */
#define SCT_CAP8_CAP_H_Pos                    16                                                      /*!< SCT CAP8: CAP_H Position                */
#define SCT_CAP8_CAP_H_Msk                    (0x0000ffffUL << SCT_CAP8_CAP_H_Pos)                    /*!< SCT CAP8: CAP_H Mask                    */

/* ---------------------------------  SCT_MATCH8  --------------------------------- */
#define SCT_MATCH8_MATCH_L_Pos                0                                                       /*!< SCT MATCH8: MATCH_L Position            */
#define SCT_MATCH8_MATCH_L_Msk                (0x0000ffffUL << SCT_MATCH8_MATCH_L_Pos)                /*!< SCT MATCH8: MATCH_L Mask                */
#define SCT_MATCH8_MATCH_H_Pos                16                                                      /*!< SCT MATCH8: MATCH_H Position            */
#define SCT_MATCH8_MATCH_H_Msk                (0x0000ffffUL << SCT_MATCH8_MATCH_H_Pos)                /*!< SCT MATCH8: MATCH_H Mask                */

/* ----------------------------------  SCT_CAP9  ---------------------------------- */
#define SCT_CAP9_CAP_L_Pos                    0                                                       /*!< SCT CAP9: CAP_L Position                */
#define SCT_CAP9_CAP_L_Msk                    (0x0000ffffUL << SCT_CAP9_CAP_L_Pos)                    /*!< SCT CAP9: CAP_L Mask                    */
#define SCT_CAP9_CAP_H_Pos                    16                                                      /*!< SCT CAP9: CAP_H Position                */
#define SCT_CAP9_CAP_H_Msk                    (0x0000ffffUL << SCT_CAP9_CAP_H_Pos)                    /*!< SCT CAP9: CAP_H Mask                    */

/* ---------------------------------  SCT_MATCH9  --------------------------------- */
#define SCT_MATCH9_MATCH_L_Pos                0                                                       /*!< SCT MATCH9: MATCH_L Position            */
#define SCT_MATCH9_MATCH_L_Msk                (0x0000ffffUL << SCT_MATCH9_MATCH_L_Pos)                /*!< SCT MATCH9: MATCH_L Mask                */
#define SCT_MATCH9_MATCH_H_Pos                16                                                      /*!< SCT MATCH9: MATCH_H Position            */
#define SCT_MATCH9_MATCH_H_Msk                (0x0000ffffUL << SCT_MATCH9_MATCH_H_Pos)                /*!< SCT MATCH9: MATCH_H Mask                */

/* ----------------------------------  SCT_CAP10  --------------------------------- */
#define SCT_CAP10_CAP_L_Pos                   0                                                       /*!< SCT CAP10: CAP_L Position               */
#define SCT_CAP10_CAP_L_Msk                   (0x0000ffffUL << SCT_CAP10_CAP_L_Pos)                   /*!< SCT CAP10: CAP_L Mask                   */
#define SCT_CAP10_CAP_H_Pos                   16                                                      /*!< SCT CAP10: CAP_H Position               */
#define SCT_CAP10_CAP_H_Msk                   (0x0000ffffUL << SCT_CAP10_CAP_H_Pos)                   /*!< SCT CAP10: CAP_H Mask                   */

