MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* --------------------------------  SCT_FRACMAT2  -------------------------------- */
#define SCT_FRACMAT2_FRACMAT_L_Pos            0                                                       /*!< SCT FRACMAT2: FRACMAT_L Position        */
#define SCT_FRACMAT2_FRACMAT_L_Msk            (0x0fUL << SCT_FRACMAT2_FRACMAT_L_Pos)                  /*!< SCT FRACMAT2: FRACMAT_L Mask            */
#define SCT_FRACMAT2_FRACMAT_H_Pos            16                                                      /*!< SCT FRACMAT2: FRACMAT_H Position        */
#define SCT_FRACMAT2_FRACMAT_H_Msk            (0x0fUL << SCT_FRACMAT2_FRACMAT_H_Pos)                  /*!< SCT FRACMAT2: FRACMAT_H Mask            */

/* --------------------------------  SCT_FRACMAT3  -------------------------------- */
#define SCT_FRACMAT3_FRACMAT_L_Pos            0                                                       /*!< SCT FRACMAT3: FRACMAT_L Position        */
#define SCT_FRACMAT3_FRACMAT_L_Msk            (0x0fUL << SCT_FRACMAT3_FRACMAT_L_Pos)                  /*!< SCT FRACMAT3: FRACMAT_L Mask            */
#define SCT_FRACMAT3_FRACMAT_H_Pos            16                                                      /*!< SCT FRACMAT3: FRACMAT_H Position        */
#define SCT_FRACMAT3_FRACMAT_H_Msk            (0x0fUL << SCT_FRACMAT3_FRACMAT_H_Pos)                  /*!< SCT FRACMAT3: FRACMAT_H Mask            */

/* --------------------------------  SCT_FRACMAT4  -------------------------------- */
#define SCT_FRACMAT4_FRACMAT_L_Pos            0                                                       /*!< SCT FRACMAT4: FRACMAT_L Position        */
#define SCT_FRACMAT4_FRACMAT_L_Msk            (0x0fUL << SCT_FRACMAT4_FRACMAT_L_Pos)                  /*!< SCT FRACMAT4: FRACMAT_L Mask            */
#define SCT_FRACMAT4_FRACMAT_H_Pos            16                                                      /*!< SCT FRACMAT4: FRACMAT_H Position        */
#define SCT_FRACMAT4_FRACMAT_H_Msk            (0x0fUL << SCT_FRACMAT4_FRACMAT_H_Pos)                  /*!< SCT FRACMAT4: FRACMAT_H Mask            */

/* --------------------------------  SCT_FRACMAT5  -------------------------------- */
#define SCT_FRACMAT5_FRACMAT_L_Pos            0                                                       /*!< SCT FRACMAT5: FRACMAT_L Position        */
#define SCT_FRACMAT5_FRACMAT_L_Msk            (0x0fUL << SCT_FRACMAT5_FRACMAT_L_Pos)                  /*!< SCT FRACMAT5: FRACMAT_L Mask            */
#define SCT_FRACMAT5_FRACMAT_H_Pos            16                                                      /*!< SCT FRACMAT5: FRACMAT_H Position        */
#define SCT_FRACMAT5_FRACMAT_H_Msk            (0x0fUL << SCT_FRACMAT5_FRACMAT_H_Pos)                  /*!< SCT FRACMAT5: FRACMAT_H Mask            */

/* --------------------------------  SCT_MATCHREL0  ------------------------------- */
#define SCT_MATCHREL0_RELOAD_L_Pos            0                                                       /*!< SCT MATCHREL0: RELOAD_L Position        */
#define SCT_MATCHREL0_RELOAD_L_Msk            (0x0000ffffUL << SCT_MATCHREL0_RELOAD_L_Pos)            /*!< SCT MATCHREL0: RELOAD_L Mask            */
#define SCT_MATCHREL0_RELOAD_H_Pos            16                                                      /*!< SCT MATCHREL0: RELOAD_H Position        */
#define SCT_MATCHREL0_RELOAD_H_Msk            (0x0000ffffUL << SCT_MATCHREL0_RELOAD_H_Pos)            /*!< SCT MATCHREL0: RELOAD_H Mask            */

/* --------------------------------  SCT_CAPCTRL0  -------------------------------- */
#define SCT_CAPCTRL0_CAPCON_L_Pos             0                                                       /*!< SCT CAPCTRL0: CAPCON_L Position         */
#define SCT_CAPCTRL0_CAPCON_L_Msk             (0x0000ffffUL << SCT_CAPCTRL0_CAPCON_L_Pos)             /*!< SCT CAPCTRL0: CAPCON_L Mask             */
#define SCT_CAPCTRL0_CAPCON_H_Pos             16                                                      /*!< SCT CAPCTRL0: CAPCON_H Position         */
#define SCT_CAPCTRL0_CAPCON_H_Msk             (0x0000ffffUL << SCT_CAPCTRL0_CAPCON_H_Pos)             /*!< SCT CAPCTRL0: CAPCON_H Mask             */

/* --------------------------------  SCT_CAPCTRL1  -------------------------------- */
#define SCT_CAPCTRL1_CAPCON_L_Pos             0                                                       /*!< SCT CAPCTRL1: CAPCON_L Position         */
#define SCT_CAPCTRL1_CAPCON_L_Msk             (0x0000ffffUL << SCT_CAPCTRL1_CAPCON_L_Pos)             /*!< SCT CAPCTRL1: CAPCON_L Mask             */
#define SCT_CAPCTRL1_CAPCON_H_Pos             16                                                      /*!< SCT CAPCTRL1: CAPCON_H Position         */
#define SCT_CAPCTRL1_CAPCON_H_Msk             (0x0000ffffUL << SCT_CAPCTRL1_CAPCON_H_Pos)             /*!< SCT CAPCTRL1: CAPCON_H Mask             */

/* --------------------------------  SCT_MATCHREL1  ------------------------------- */
#define SCT_MATCHREL1_RELOAD_L_Pos            0                                                       /*!< SCT MATCHREL1: RELOAD_L Position        */
#define SCT_MATCHREL1_RELOAD_L_Msk            (0x0000ffffUL << SCT_MATCHREL1_RELOAD_L_Pos)            /*!< SCT MATCHREL1: RELOAD_L Mask            */
#define SCT_MATCHREL1_RELOAD_H_Pos            16                                                      /*!< SCT MATCHREL1: RELOAD_H Position        */
#define SCT_MATCHREL1_RELOAD_H_Msk            (0x0000ffffUL << SCT_MATCHREL1_RELOAD_H_Pos)            /*!< SCT MATCHREL1: RELOAD_H Mask            */

/* --------------------------------  SCT_MATCHREL2  ------------------------------- */
#define SCT_MATCHREL2_RELOAD_L_Pos            0                                                       /*!< SCT MATCHREL2: RELOAD_L Position        */
#define SCT_MATCHREL2_RELOAD_L_Msk            (0x0000ffffUL << SCT_MATCHREL2_RELOAD_L_Pos)            /*!< SCT MATCHREL2: RELOAD_L Mask            */
#define SCT_MATCHREL2_RELOAD_H_Pos            16                                                      /*!< SCT MATCHREL2: RELOAD_H Position        */
#define SCT_MATCHREL2_RELOAD_H_Msk            (0x0000ffffUL << SCT_MATCHREL2_RELOAD_H_Pos)            /*!< SCT MATCHREL2: RELOAD_H Mask            */

/* --------------------------------  SCT_CAPCTRL2  -------------------------------- */
#define SCT_CAPCTRL2_CAPCON_L_Pos             0                                                       /*!< SCT CAPCTRL2: CAPCON_L Position         */
#define SCT_CAPCTRL2_CAPCON_L_Msk             (0x0000ffffUL << SCT_CAPCTRL2_CAPCON_L_Pos)             /*!< SCT CAPCTRL2: CAPCON_L Mask             */
#define SCT_CAPCTRL2_CAPCON_H_Pos             16                                                      /*!< SCT CAPCTRL2: CAPCON_H Position         */
#define SCT_CAPCTRL2_CAPCON_H_Msk             (0x0000ffffUL << SCT_CAPCTRL2_CAPCON_H_Pos)             /*!< SCT CAPCTRL2: CAPCON_H Mask             */

/* --------------------------------  SCT_CAPCTRL3  -------------------------------- */
#define SCT_CAPCTRL3_CAPCON_L_Pos             0                                                       /*!< SCT CAPCTRL3: CAPCON_L Position         */
#define SCT_CAPCTRL3_CAPCON_L_Msk             (0x0000ffffUL << SCT_CAPCTRL3_CAPCON_L_Pos)             /*!< SCT CAPCTRL3: CAPCON_L Mask             */
#define SCT_CAPCTRL3_CAPCON_H_Pos             16                                                      /*!< SCT CAPCTRL3: CAPCON_H Position         */
#define SCT_CAPCTRL3_CAPCON_H_Msk             (0x0000ffffUL << SCT_CAPCTRL3_CAPCON_H_Pos)             /*!< SCT CAPCTRL3: CAPCON_H Mask             */

/* --------------------------------  SCT_MATCHREL3  ------------------------------- */
#define SCT_MATCHREL3_RELOAD_L_Pos            0                                                       /*!< SCT MATCHREL3: RELOAD_L Position        */
#define SCT_MATCHREL3_RELOAD_L_Msk            (0x0000ffffUL << SCT_MATCHREL3_RELOAD_L_Pos)            /*!< SCT MATCHREL3: RELOAD_L Mask            */
#define SCT_MATCHREL3_RELOAD_H_Pos            16                                                      /*!< SCT MATCHREL3: RELOAD_H Position        */
#define SCT_MATCHREL3_RELOAD_H_Msk            (0x0000ffffUL << SCT_MATCHREL3_RELOAD_H_Pos)            /*!< SCT MATCHREL3: RELOAD_H Mask            */

/* --------------------------------  SCT_MATCHREL4  ------------------------------- */
#define SCT_MATCHREL4_RELOAD_L_Pos            0                                                       /*!< SCT MATCHREL4: RELOAD_L Position        */
#define SCT_MATCHREL4_RELOAD_L_Msk            (0x0000ffffUL << SCT_MATCHREL4_RELOAD_L_Pos)            /*!< SCT MATCHREL4: RELOAD_L Mask            */
#define SCT_MATCHREL4_RELOAD_H_Pos            16                                                      /*!< SCT MATCHREL4: RELOAD_H Position        */
#define SCT_MATCHREL4_RELOAD_H_Msk            (0x0000ffffUL << SCT_MATCHREL4_RELOAD_H_Pos)            /*!< SCT MATCHREL4: RELOAD_H Mask            */

/* --------------------------------  SCT_CAPCTRL4  -------------------------------- */
#define SCT_CAPCTRL4_CAPCON_L_Pos             0                                                       /*!< SCT CAPCTRL4: CAPCON_L Position         */
#define SCT_CAPCTRL4_CAPCON_L_Msk             (0x0000ffffUL << SCT_CAPCTRL4_CAPCON_L_Pos)             /*!< SCT CAPCTRL4: CAPCON_L Mask             */
#define SCT_CAPCTRL4_CAPCON_H_Pos             16                                                      /*!< SCT CAPCTRL4: CAPCON_H Position         */
#define SCT_CAPCTRL4_CAPCON_H_Msk             (0x0000ffffUL << SCT_CAPCTRL4_CAPCON_H_Pos)             /*!< SCT CAPCTRL4: CAPCON_H Mask             */

/* --------------------------------  SCT_MATCHREL5  ------------------------------- */
#define SCT_MATCHREL5_RELOAD_L_Pos            0                                                       /*!< SCT MATCHREL5: RELOAD_L Position        */
#define SCT_MATCHREL5_RELOAD_L_Msk            (0x0000ffffUL << SCT_MATCHREL5_RELOAD_L_Pos)            /*!< SCT MATCHREL5: RELOAD_L Mask            */
#define SCT_MATCHREL5_RELOAD_H_Pos            16                                                      /*!< SCT MATCHREL5: RELOAD_H Position        */
#define SCT_MATCHREL5_RELOAD_H_Msk            (0x0000ffffUL << SCT_MATCHREL5_RELOAD_H_Pos)            /*!< SCT MATCHREL5: RELOAD_H Mask            */

/* --------------------------------  SCT_CAPCTRL5  -------------------------------- */
#define SCT_CAPCTRL5_CAPCON_L_Pos             0                                                       /*!< SCT CAPCTRL5: CAPCON_L Position         */
#define SCT_CAPCTRL5_CAPCON_L_Msk             (0x0000ffffUL << SCT_CAPCTRL5_CAPCON_L_Pos)             /*!< SCT CAPCTRL5: CAPCON_L Mask             */
#define SCT_CAPCTRL5_CAPCON_H_Pos             16                                                      /*!< SCT CAPCTRL5: CAPCON_H Position         */
#define SCT_CAPCTRL5_CAPCON_H_Msk             (0x0000ffffUL << SCT_CAPCTRL5_CAPCON_H_Pos)             /*!< SCT CAPCTRL5: CAPCON_H Mask             */

/* --------------------------------  SCT_CAPCTRL6  -------------------------------- */
#define SCT_CAPCTRL6_CAPCON_L_Pos             0                                                       /*!< SCT CAPCTRL6: CAPCON_L Position         */
#define SCT_CAPCTRL6_CAPCON_L_Msk             (0x0000ffffUL << SCT_CAPCTRL6_CAPCON_L_Pos)             /*!< SCT CAPCTRL6: CAPCON_L Mask             */
#define SCT_CAPCTRL6_CAPCON_H_Pos             16                                                      /*!< SCT CAPCTRL6: CAPCON_H Position         */
#define SCT_CAPCTRL6_CAPCON_H_Msk             (0x0000ffffUL << SCT_CAPCTRL6_CAPCON_H_Pos)             /*!< SCT CAPCTRL6: CAPCON_H Mask             */

/* --------------------------------  SCT_MATCHREL6  ------------------------------- */
#define SCT_MATCHREL6_RELOAD_L_Pos            0                                                       /*!< SCT MATCHREL6: RELOAD_L Position        */
#define SCT_MATCHREL6_RELOAD_L_Msk            (0x0000ffffUL << SCT_MATCHREL6_RELOAD_L_Pos)            /*!< SCT MATCHREL6: RELOAD_L Mask            */
#define SCT_MATCHREL6_RELOAD_H_Pos            16                                                      /*!< SCT MATCHREL6: RELOAD_H Position        */
#define SCT_MATCHREL6_RELOAD_H_Msk            (0x0000ffffUL << SCT_MATCHREL6_RELOAD_H_Pos)            /*!< SCT MATCHREL6: RELOAD_H Mask            */

/* --------------------------------  SCT_MATCHREL7  ------------------------------- */
#define SCT_MATCHREL7_RELOAD_L_Pos            0                                                       /*!< SCT MATCHREL7: RELOAD_L Position        */
#define SCT_MATCHREL7_RELOAD_L_Msk            (0x0000ffffUL << SCT_MATCHREL7_RELOAD_L_Pos)            /*!< SCT MATCHREL7: RELOAD_L Mask            */
#define SCT_MATCHREL7_RELOAD_H_Pos            16                                                      /*!< SCT MATCHREL7: RELOAD_H Position        */
#define SCT_MATCHREL7_RELOAD_H_Msk            (0x0000ffffUL << SCT_MATCHREL7_RELOAD_H_Pos)            /*!< SCT MATCHREL7: RELOAD_H Mask            */

