MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* --------------------------------  SCT_CAPCTRL7  -------------------------------- */
#define SCT_CAPCTRL7_CAPCON_L_Pos             0                                                       /*!< SCT CAPCTRL7: CAPCON_L Position         */
#define SCT_CAPCTRL7_CAPCON_L_Msk             (0x0000ffffUL << SCT_CAPCTRL7_CAPCON_L_Pos)             /*!< SCT CAPCTRL7: CAPCON_L Mask             */
#define SCT_CAPCTRL7_CAPCON_H_Pos             16                                                      /*!< SCT CAPCTRL7: CAPCON_H Position         */
#define SCT_CAPCTRL7_CAPCON_H_Msk             (0x0000ffffUL << SCT_CAPCTRL7_CAPCON_H_Pos)             /*!< SCT CAPCTRL7: CAPCON_H Mask             */

/* --------------------------------  SCT_CAPCTRL8  -------------------------------- */
#define SCT_CAPCTRL8_CAPCON_L_Pos             0                                                       /*!< SCT CAPCTRL8: CAPCON_L Position         */
#define SCT_CAPCTRL8_CAPCON_L_Msk             (0x0000ffffUL << SCT_CAPCTRL8_CAPCON_L_Pos)             /*!< SCT CAPCTRL8: CAPCON_L Mask             */
#define SCT_CAPCTRL8_CAPCON_H_Pos             16                                                      /*!< SCT CAPCTRL8: CAPCON_H Position         */
#define SCT_CAPCTRL8_CAPCON_H_Msk             (0x0000ffffUL << SCT_CAPCTRL8_CAPCON_H_Pos)             /*!< SCT CAPCTRL8: CAPCON_H Mask             */

/* --------------------------------  SCT_MATCHREL8  ------------------------------- */
#define SCT_MATCHREL8_RELOAD_L_Pos            0                                                       /*!< SCT MATCHREL8: RELOAD_L Position        */
#define SCT_MATCHREL8_RELOAD_L_Msk            (0x0000ffffUL << SCT_MATCHREL8_RELOAD_L_Pos)            /*!< SCT MATCHREL8: RELOAD_L Mask            */
#define SCT_MATCHREL8_RELOAD_H_Pos            16                                                      /*!< SCT MATCHREL8: RELOAD_H Position        */
#define SCT_MATCHREL8_RELOAD_H_Msk            (0x0000ffffUL << SCT_MATCHREL8_RELOAD_H_Pos)            /*!< SCT MATCHREL8: RELOAD_H Mask            */

/* --------------------------------  SCT_MATCHREL9  ------------------------------- */
#define SCT_MATCHREL9_RELOAD_L_Pos            0                                                       /*!< SCT MATCHREL9: RELOAD_L Position        */
#define SCT_MATCHREL9_RELOAD_L_Msk            (0x0000ffffUL << SCT_MATCHREL9_RELOAD_L_Pos)            /*!< SCT MATCHREL9: RELOAD_L Mask            */
#define SCT_MATCHREL9_RELOAD_H_Pos            16                                                      /*!< SCT MATCHREL9: RELOAD_H Position        */
#define SCT_MATCHREL9_RELOAD_H_Msk            (0x0000ffffUL << SCT_MATCHREL9_RELOAD_H_Pos)            /*!< SCT MATCHREL9: RELOAD_H Mask            */

/* --------------------------------  SCT_CAPCTRL9  -------------------------------- */
#define SCT_CAPCTRL9_CAPCON_L_Pos             0                                                       /*!< SCT CAPCTRL9: CAPCON_L Position         */
#define SCT_CAPCTRL9_CAPCON_L_Msk             (0x0000ffffUL << SCT_CAPCTRL9_CAPCON_L_Pos)             /*!< SCT CAPCTRL9: CAPCON_L Mask             */
#define SCT_CAPCTRL9_CAPCON_H_Pos             16                                                      /*!< SCT CAPCTRL9: CAPCON_H Position         */
#define SCT_CAPCTRL9_CAPCON_H_Msk             (0x0000ffffUL << SCT_CAPCTRL9_CAPCON_H_Pos)             /*!< SCT CAPCTRL9: CAPCON_H Mask             */

/* --------------------------------  SCT_CAPCTRL10  ------------------------------- */
#define SCT_CAPCTRL10_CAPCON_L_Pos            0                                                       /*!< SCT CAPCTRL10: CAPCON_L Position        */
#define SCT_CAPCTRL10_CAPCON_L_Msk            (0x0000ffffUL << SCT_CAPCTRL10_CAPCON_L_Pos)            /*!< SCT CAPCTRL10: CAPCON_L Mask            */
#define SCT_CAPCTRL10_CAPCON_H_Pos            16                                                      /*!< SCT CAPCTRL10: CAPCON_H Position        */
#define SCT_CAPCTRL10_CAPCON_H_Msk            (0x0000ffffUL << SCT_CAPCTRL10_CAPCON_H_Pos)            /*!< SCT CAPCTRL10: CAPCON_H Mask            */

/* -------------------------------  SCT_MATCHREL10  ------------------------------- */
#define SCT_MATCHREL10_RELOAD_L_Pos           0                                                       /*!< SCT MATCHREL10: RELOAD_L Position       */
#define SCT_MATCHREL10_RELOAD_L_Msk           (0x0000ffffUL << SCT_MATCHREL10_RELOAD_L_Pos)           /*!< SCT MATCHREL10: RELOAD_L Mask           */
#define SCT_MATCHREL10_RELOAD_H_Pos           16                                                      /*!< SCT MATCHREL10: RELOAD_H Position       */
#define SCT_MATCHREL10_RELOAD_H_Msk           (0x0000ffffUL << SCT_MATCHREL10_RELOAD_H_Pos)           /*!< SCT MATCHREL10: RELOAD_H Mask           */

/* --------------------------------  SCT_CAPCTRL11  ------------------------------- */
#define SCT_CAPCTRL11_CAPCON_L_Pos            0                                                       /*!< SCT CAPCTRL11: CAPCON_L Position        */
#define SCT_CAPCTRL11_CAPCON_L_Msk            (0x0000ffffUL << SCT_CAPCTRL11_CAPCON_L_Pos)            /*!< SCT CAPCTRL11: CAPCON_L Mask            */
#define SCT_CAPCTRL11_CAPCON_H_Pos            16                                                      /*!< SCT CAPCTRL11: CAPCON_H Position        */
#define SCT_CAPCTRL11_CAPCON_H_Msk            (0x0000ffffUL << SCT_CAPCTRL11_CAPCON_H_Pos)            /*!< SCT CAPCTRL11: CAPCON_H Mask            */

/* -------------------------------  SCT_MATCHREL11  ------------------------------- */
#define SCT_MATCHREL11_RELOAD_L_Pos           0                                                       /*!< SCT MATCHREL11: RELOAD_L Position       */
#define SCT_MATCHREL11_RELOAD_L_Msk           (0x0000ffffUL << SCT_MATCHREL11_RELOAD_L_Pos)           /*!< SCT MATCHREL11: RELOAD_L Mask           */
#define SCT_MATCHREL11_RELOAD_H_Pos           16                                                      /*!< SCT MATCHREL11: RELOAD_H Position       */
#define SCT_MATCHREL11_RELOAD_H_Msk           (0x0000ffffUL << SCT_MATCHREL11_RELOAD_H_Pos)           /*!< SCT MATCHREL11: RELOAD_H Mask           */

/* --------------------------------  SCT_CAPCTRL12  ------------------------------- */
#define SCT_CAPCTRL12_CAPCON_L_Pos            0                                                       /*!< SCT CAPCTRL12: CAPCON_L Position        */
#define SCT_CAPCTRL12_CAPCON_L_Msk            (0x0000ffffUL << SCT_CAPCTRL12_CAPCON_L_Pos)            /*!< SCT CAPCTRL12: CAPCON_L Mask            */
#define SCT_CAPCTRL12_CAPCON_H_Pos            16                                                      /*!< SCT CAPCTRL12: CAPCON_H Position        */
#define SCT_CAPCTRL12_CAPCON_H_Msk            (0x0000ffffUL << SCT_CAPCTRL12_CAPCON_H_Pos)            /*!< SCT CAPCTRL12: CAPCON_H Mask            */

/* -------------------------------  SCT_MATCHREL12  ------------------------------- */
#define SCT_MATCHREL12_RELOAD_L_Pos           0                                                       /*!< SCT MATCHREL12: RELOAD_L Position       */
#define SCT_MATCHREL12_RELOAD_L_Msk           (0x0000ffffUL << SCT_MATCHREL12_RELOAD_L_Pos)           /*!< SCT MATCHREL12: RELOAD_L Mask           */
#define SCT_MATCHREL12_RELOAD_H_Pos           16                                                      /*!< SCT MATCHREL12: RELOAD_H Position       */
#define SCT_MATCHREL12_RELOAD_H_Msk           (0x0000ffffUL << SCT_MATCHREL12_RELOAD_H_Pos)           /*!< SCT MATCHREL12: RELOAD_H Mask           */

