MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -------------------------------  SCT_EV15_STATE  ------------------------------- */
#define SCT_EV15_STATE_STATEMSK0_Pos          0                                                       /*!< SCT EV15_STATE: STATEMSK0 Position      */
#define SCT_EV15_STATE_STATEMSK0_Msk          (0x01UL << SCT_EV15_STATE_STATEMSK0_Pos)                /*!< SCT EV15_STATE: STATEMSK0 Mask          */
#define SCT_EV15_STATE_STATEMSK1_Pos          1                                                       /*!< SCT EV15_STATE: STATEMSK1 Position      */
#define SCT_EV15_STATE_STATEMSK1_Msk          (0x01UL << SCT_EV15_STATE_STATEMSK1_Pos)                /*!< SCT EV15_STATE: STATEMSK1 Mask          */
#define SCT_EV15_STATE_STATEMSK2_Pos          2                                                       /*!< SCT EV15_STATE: STATEMSK2 Position      */
#define SCT_EV15_STATE_STATEMSK2_Msk          (0x01UL << SCT_EV15_STATE_STATEMSK2_Pos)                /*!< SCT EV15_STATE: STATEMSK2 Mask          */
#define SCT_EV15_STATE_STATEMSK3_Pos          3                                                       /*!< SCT EV15_STATE: STATEMSK3 Position      */
#define SCT_EV15_STATE_STATEMSK3_Msk          (0x01UL << SCT_EV15_STATE_STATEMSK3_Pos)                /*!< SCT EV15_STATE: STATEMSK3 Mask          */
#define SCT_EV15_STATE_STATEMSK4_Pos          4                                                       /*!< SCT EV15_STATE: STATEMSK4 Position      */
#define SCT_EV15_STATE_STATEMSK4_Msk          (0x01UL << SCT_EV15_STATE_STATEMSK4_Pos)                /*!< SCT EV15_STATE: STATEMSK4 Mask          */
#define SCT_EV15_STATE_STATEMSK5_Pos          5                                                       /*!< SCT EV15_STATE: STATEMSK5 Position      */
#define SCT_EV15_STATE_STATEMSK5_Msk          (0x01UL << SCT_EV15_STATE_STATEMSK5_Pos)                /*!< SCT EV15_STATE: STATEMSK5 Mask          */
#define SCT_EV15_STATE_STATEMSK6_Pos          6                                                       /*!< SCT EV15_STATE: STATEMSK6 Position      */
#define SCT_EV15_STATE_STATEMSK6_Msk          (0x01UL << SCT_EV15_STATE_STATEMSK6_Pos)                /*!< SCT EV15_STATE: STATEMSK6 Mask          */
#define SCT_EV15_STATE_STATEMSK7_Pos          7                                                       /*!< SCT EV15_STATE: STATEMSK7 Position      */
#define SCT_EV15_STATE_STATEMSK7_Msk          (0x01UL << SCT_EV15_STATE_STATEMSK7_Pos)                /*!< SCT EV15_STATE: STATEMSK7 Mask          */
#define SCT_EV15_STATE_STATEMSK8_Pos          8                                                       /*!< SCT EV15_STATE: STATEMSK8 Position      */
#define SCT_EV15_STATE_STATEMSK8_Msk          (0x01UL << SCT_EV15_STATE_STATEMSK8_Pos)                /*!< SCT EV15_STATE: STATEMSK8 Mask          */
#define SCT_EV15_STATE_STATEMSK9_Pos          9                                                       /*!< SCT EV15_STATE: STATEMSK9 Position      */
#define SCT_EV15_STATE_STATEMSK9_Msk          (0x01UL << SCT_EV15_STATE_STATEMSK9_Pos)                /*!< SCT EV15_STATE: STATEMSK9 Mask          */
#define SCT_EV15_STATE_STATEMSK10_Pos         10                                                      /*!< SCT EV15_STATE: STATEMSK10 Position     */
#define SCT_EV15_STATE_STATEMSK10_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK10_Pos)               /*!< SCT EV15_STATE: STATEMSK10 Mask         */
#define SCT_EV15_STATE_STATEMSK11_Pos         11                                                      /*!< SCT EV15_STATE: STATEMSK11 Position     */
#define SCT_EV15_STATE_STATEMSK11_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK11_Pos)               /*!< SCT EV15_STATE: STATEMSK11 Mask         */
#define SCT_EV15_STATE_STATEMSK12_Pos         12                                                      /*!< SCT EV15_STATE: STATEMSK12 Position     */
#define SCT_EV15_STATE_STATEMSK12_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK12_Pos)               /*!< SCT EV15_STATE: STATEMSK12 Mask         */
#define SCT_EV15_STATE_STATEMSK13_Pos         13                                                      /*!< SCT EV15_STATE: STATEMSK13 Position     */
#define SCT_EV15_STATE_STATEMSK13_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK13_Pos)               /*!< SCT EV15_STATE: STATEMSK13 Mask         */
#define SCT_EV15_STATE_STATEMSK14_Pos         14                                                      /*!< SCT EV15_STATE: STATEMSK14 Position     */
#define SCT_EV15_STATE_STATEMSK14_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK14_Pos)               /*!< SCT EV15_STATE: STATEMSK14 Mask         */
#define SCT_EV15_STATE_STATEMSK15_Pos         15                                                      /*!< SCT EV15_STATE: STATEMSK15 Position     */
#define SCT_EV15_STATE_STATEMSK15_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK15_Pos)               /*!< SCT EV15_STATE: STATEMSK15 Mask         */
#define SCT_EV15_STATE_STATEMSK16_Pos         16                                                      /*!< SCT EV15_STATE: STATEMSK16 Position     */
#define SCT_EV15_STATE_STATEMSK16_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK16_Pos)               /*!< SCT EV15_STATE: STATEMSK16 Mask         */
#define SCT_EV15_STATE_STATEMSK17_Pos         17                                                      /*!< SCT EV15_STATE: STATEMSK17 Position     */
#define SCT_EV15_STATE_STATEMSK17_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK17_Pos)               /*!< SCT EV15_STATE: STATEMSK17 Mask         */
#define SCT_EV15_STATE_STATEMSK18_Pos         18                                                      /*!< SCT EV15_STATE: STATEMSK18 Position     */
#define SCT_EV15_STATE_STATEMSK18_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK18_Pos)               /*!< SCT EV15_STATE: STATEMSK18 Mask         */
#define SCT_EV15_STATE_STATEMSK19_Pos         19                                                      /*!< SCT EV15_STATE: STATEMSK19 Position     */
#define SCT_EV15_STATE_STATEMSK19_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK19_Pos)               /*!< SCT EV15_STATE: STATEMSK19 Mask         */
#define SCT_EV15_STATE_STATEMSK20_Pos         20                                                      /*!< SCT EV15_STATE: STATEMSK20 Position     */
#define SCT_EV15_STATE_STATEMSK20_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK20_Pos)               /*!< SCT EV15_STATE: STATEMSK20 Mask         */
#define SCT_EV15_STATE_STATEMSK21_Pos         21                                                      /*!< SCT EV15_STATE: STATEMSK21 Position     */
#define SCT_EV15_STATE_STATEMSK21_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK21_Pos)               /*!< SCT EV15_STATE: STATEMSK21 Mask         */
#define SCT_EV15_STATE_STATEMSK22_Pos         22                                                      /*!< SCT EV15_STATE: STATEMSK22 Position     */
#define SCT_EV15_STATE_STATEMSK22_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK22_Pos)               /*!< SCT EV15_STATE: STATEMSK22 Mask         */
#define SCT_EV15_STATE_STATEMSK23_Pos         23                                                      /*!< SCT EV15_STATE: STATEMSK23 Position     */
#define SCT_EV15_STATE_STATEMSK23_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK23_Pos)               /*!< SCT EV15_STATE: STATEMSK23 Mask         */
#define SCT_EV15_STATE_STATEMSK24_Pos         24                                                      /*!< SCT EV15_STATE: STATEMSK24 Position     */
#define SCT_EV15_STATE_STATEMSK24_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK24_Pos)               /*!< SCT EV15_STATE: STATEMSK24 Mask         */
#define SCT_EV15_STATE_STATEMSK25_Pos         25                                                      /*!< SCT EV15_STATE: STATEMSK25 Position     */
#define SCT_EV15_STATE_STATEMSK25_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK25_Pos)               /*!< SCT EV15_STATE: STATEMSK25 Mask         */
#define SCT_EV15_STATE_STATEMSK26_Pos         26                                                      /*!< SCT EV15_STATE: STATEMSK26 Position     */
#define SCT_EV15_STATE_STATEMSK26_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK26_Pos)               /*!< SCT EV15_STATE: STATEMSK26 Mask         */
#define SCT_EV15_STATE_STATEMSK27_Pos         27                                                      /*!< SCT EV15_STATE: STATEMSK27 Position     */
#define SCT_EV15_STATE_STATEMSK27_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK27_Pos)               /*!< SCT EV15_STATE: STATEMSK27 Mask         */
#define SCT_EV15_STATE_STATEMSK28_Pos         28                                                      /*!< SCT EV15_STATE: STATEMSK28 Position     */
#define SCT_EV15_STATE_STATEMSK28_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK28_Pos)               /*!< SCT EV15_STATE: STATEMSK28 Mask         */
#define SCT_EV15_STATE_STATEMSK29_Pos         29                                                      /*!< SCT EV15_STATE: STATEMSK29 Position     */
#define SCT_EV15_STATE_STATEMSK29_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK29_Pos)               /*!< SCT EV15_STATE: STATEMSK29 Mask         */
#define SCT_EV15_STATE_STATEMSK30_Pos         30                                                      /*!< SCT EV15_STATE: STATEMSK30 Position     */
#define SCT_EV15_STATE_STATEMSK30_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK30_Pos)               /*!< SCT EV15_STATE: STATEMSK30 Mask         */
#define SCT_EV15_STATE_STATEMSK31_Pos         31                                                      /*!< SCT EV15_STATE: STATEMSK31 Position     */
#define SCT_EV15_STATE_STATEMSK31_Msk         (0x01UL << SCT_EV15_STATE_STATEMSK31_Pos)               /*!< SCT EV15_STATE: STATEMSK31 Mask         */

