MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* --------------------------------  SCT_EV15_CTRL  ------------------------------- */
#define SCT_EV15_CTRL_MATCHSEL_Pos            0                                                       /*!< SCT EV15_CTRL: MATCHSEL Position        */
#define SCT_EV15_CTRL_MATCHSEL_Msk            (0x0fUL << SCT_EV15_CTRL_MATCHSEL_Pos)                  /*!< SCT EV15_CTRL: MATCHSEL Mask            */
#define SCT_EV15_CTRL_HEVENT_Pos              4                                                       /*!< SCT EV15_CTRL: HEVENT Position          */
#define SCT_EV15_CTRL_HEVENT_Msk              (0x01UL << SCT_EV15_CTRL_HEVENT_Pos)                    /*!< SCT EV15_CTRL: HEVENT Mask              */
#define SCT_EV15_CTRL_OUTSEL_Pos              5                                                       /*!< SCT EV15_CTRL: OUTSEL Position          */
#define SCT_EV15_CTRL_OUTSEL_Msk              (0x01UL << SCT_EV15_CTRL_OUTSEL_Pos)                    /*!< SCT EV15_CTRL: OUTSEL Mask              */
#define SCT_EV15_CTRL_IOSEL_Pos               6                                                       /*!< SCT EV15_CTRL: IOSEL Position           */
#define SCT_EV15_CTRL_IOSEL_Msk               (0x0fUL << SCT_EV15_CTRL_IOSEL_Pos)                     /*!< SCT EV15_CTRL: IOSEL Mask               */
#define SCT_EV15_CTRL_IOCOND_Pos              10                                                      /*!< SCT EV15_CTRL: IOCOND Position          */
#define SCT_EV15_CTRL_IOCOND_Msk              (0x03UL << SCT_EV15_CTRL_IOCOND_Pos)                    /*!< SCT EV15_CTRL: IOCOND Mask              */
#define SCT_EV15_CTRL_COMBMODE_Pos            12                                                      /*!< SCT EV15_CTRL: COMBMODE Position        */
#define SCT_EV15_CTRL_COMBMODE_Msk            (0x03UL << SCT_EV15_CTRL_COMBMODE_Pos)                  /*!< SCT EV15_CTRL: COMBMODE Mask            */
#define SCT_EV15_CTRL_STATELD_Pos             14                                                      /*!< SCT EV15_CTRL: STATELD Position         */
#define SCT_EV15_CTRL_STATELD_Msk             (0x01UL << SCT_EV15_CTRL_STATELD_Pos)                   /*!< SCT EV15_CTRL: STATELD Mask             */
#define SCT_EV15_CTRL_STATEV_Pos              15                                                      /*!< SCT EV15_CTRL: STATEV Position          */
#define SCT_EV15_CTRL_STATEV_Msk              (0x1fUL << SCT_EV15_CTRL_STATEV_Pos)                    /*!< SCT EV15_CTRL: STATEV Mask              */
#define SCT_EV15_CTRL_MATCHMEM_Pos            20                                                      /*!< SCT EV15_CTRL: MATCHMEM Position        */
#define SCT_EV15_CTRL_MATCHMEM_Msk            (0x01UL << SCT_EV15_CTRL_MATCHMEM_Pos)                  /*!< SCT EV15_CTRL: MATCHMEM Mask            */
#define SCT_EV15_CTRL_DIRECTION_Pos           21                                                      /*!< SCT EV15_CTRL: DIRECTION Position       */
#define SCT_EV15_CTRL_DIRECTION_Msk           (0x03UL << SCT_EV15_CTRL_DIRECTION_Pos)                 /*!< SCT EV15_CTRL: DIRECTION Mask           */

/* --------------------------------  SCT_OUT0_SET  -------------------------------- */
#define SCT_OUT0_SET_SET0_Pos                 0                                                       /*!< SCT OUT0_SET: SET0 Position             */
#define SCT_OUT0_SET_SET0_Msk                 (0x01UL << SCT_OUT0_SET_SET0_Pos)                       /*!< SCT OUT0_SET: SET0 Mask                 */
#define SCT_OUT0_SET_SET1_Pos                 1                                                       /*!< SCT OUT0_SET: SET1 Position             */
#define SCT_OUT0_SET_SET1_Msk                 (0x01UL << SCT_OUT0_SET_SET1_Pos)                       /*!< SCT OUT0_SET: SET1 Mask                 */
#define SCT_OUT0_SET_SET2_Pos                 2                                                       /*!< SCT OUT0_SET: SET2 Position             */
#define SCT_OUT0_SET_SET2_Msk                 (0x01UL << SCT_OUT0_SET_SET2_Pos)                       /*!< SCT OUT0_SET: SET2 Mask                 */
#define SCT_OUT0_SET_SET3_Pos                 3                                                       /*!< SCT OUT0_SET: SET3 Position             */
#define SCT_OUT0_SET_SET3_Msk                 (0x01UL << SCT_OUT0_SET_SET3_Pos)                       /*!< SCT OUT0_SET: SET3 Mask                 */
#define SCT_OUT0_SET_SET4_Pos                 4                                                       /*!< SCT OUT0_SET: SET4 Position             */
#define SCT_OUT0_SET_SET4_Msk                 (0x01UL << SCT_OUT0_SET_SET4_Pos)                       /*!< SCT OUT0_SET: SET4 Mask                 */
#define SCT_OUT0_SET_SET5_Pos                 5                                                       /*!< SCT OUT0_SET: SET5 Position             */
#define SCT_OUT0_SET_SET5_Msk                 (0x01UL << SCT_OUT0_SET_SET5_Pos)                       /*!< SCT OUT0_SET: SET5 Mask                 */
#define SCT_OUT0_SET_SET6_Pos                 6                                                       /*!< SCT OUT0_SET: SET6 Position             */
#define SCT_OUT0_SET_SET6_Msk                 (0x01UL << SCT_OUT0_SET_SET6_Pos)                       /*!< SCT OUT0_SET: SET6 Mask                 */
#define SCT_OUT0_SET_SET7_Pos                 7                                                       /*!< SCT OUT0_SET: SET7 Position             */
#define SCT_OUT0_SET_SET7_Msk                 (0x01UL << SCT_OUT0_SET_SET7_Pos)                       /*!< SCT OUT0_SET: SET7 Mask                 */
#define SCT_OUT0_SET_SET8_Pos                 8                                                       /*!< SCT OUT0_SET: SET8 Position             */
#define SCT_OUT0_SET_SET8_Msk                 (0x01UL << SCT_OUT0_SET_SET8_Pos)                       /*!< SCT OUT0_SET: SET8 Mask                 */
#define SCT_OUT0_SET_SET9_Pos                 9                                                       /*!< SCT OUT0_SET: SET9 Position             */
#define SCT_OUT0_SET_SET9_Msk                 (0x01UL << SCT_OUT0_SET_SET9_Pos)                       /*!< SCT OUT0_SET: SET9 Mask                 */
#define SCT_OUT0_SET_SET10_Pos                10                                                      /*!< SCT OUT0_SET: SET10 Position            */
#define SCT_OUT0_SET_SET10_Msk                (0x01UL << SCT_OUT0_SET_SET10_Pos)                      /*!< SCT OUT0_SET: SET10 Mask                */
#define SCT_OUT0_SET_SET11_Pos                11                                                      /*!< SCT OUT0_SET: SET11 Position            */
#define SCT_OUT0_SET_SET11_Msk                (0x01UL << SCT_OUT0_SET_SET11_Pos)                      /*!< SCT OUT0_SET: SET11 Mask                */
#define SCT_OUT0_SET_SET12_Pos                12                                                      /*!< SCT OUT0_SET: SET12 Position            */
#define SCT_OUT0_SET_SET12_Msk                (0x01UL << SCT_OUT0_SET_SET12_Pos)                      /*!< SCT OUT0_SET: SET12 Mask                */
#define SCT_OUT0_SET_SET13_Pos                13                                                      /*!< SCT OUT0_SET: SET13 Position            */
#define SCT_OUT0_SET_SET13_Msk                (0x01UL << SCT_OUT0_SET_SET13_Pos)                      /*!< SCT OUT0_SET: SET13 Mask                */
#define SCT_OUT0_SET_SET14_Pos                14                                                      /*!< SCT OUT0_SET: SET14 Position            */
#define SCT_OUT0_SET_SET14_Msk                (0x01UL << SCT_OUT0_SET_SET14_Pos)                      /*!< SCT OUT0_SET: SET14 Mask                */
#define SCT_OUT0_SET_SET15_Pos                15                                                      /*!< SCT OUT0_SET: SET15 Position            */
#define SCT_OUT0_SET_SET15_Msk                (0x01UL << SCT_OUT0_SET_SET15_Pos)                      /*!< SCT OUT0_SET: SET15 Mask                */

/* --------------------------------  SCT_OUT0_CLR  -------------------------------- */
#define SCT_OUT0_CLR_CLR0_Pos                 0                                                       /*!< SCT OUT0_CLR: CLR0 Position             */
#define SCT_OUT0_CLR_CLR0_Msk                 (0x01UL << SCT_OUT0_CLR_CLR0_Pos)                       /*!< SCT OUT0_CLR: CLR0 Mask                 */
#define SCT_OUT0_CLR_CLR1_Pos                 1                                                       /*!< SCT OUT0_CLR: CLR1 Position             */
#define SCT_OUT0_CLR_CLR1_Msk                 (0x01UL << SCT_OUT0_CLR_CLR1_Pos)                       /*!< SCT OUT0_CLR: CLR1 Mask                 */
#define SCT_OUT0_CLR_CLR2_Pos                 2                                                       /*!< SCT OUT0_CLR: CLR2 Position             */
#define SCT_OUT0_CLR_CLR2_Msk                 (0x01UL << SCT_OUT0_CLR_CLR2_Pos)                       /*!< SCT OUT0_CLR: CLR2 Mask                 */
#define SCT_OUT0_CLR_CLR3_Pos                 3                                                       /*!< SCT OUT0_CLR: CLR3 Position             */
#define SCT_OUT0_CLR_CLR3_Msk                 (0x01UL << SCT_OUT0_CLR_CLR3_Pos)                       /*!< SCT OUT0_CLR: CLR3 Mask                 */
#define SCT_OUT0_CLR_CLR4_Pos                 4                                                       /*!< SCT OUT0_CLR: CLR4 Position             */
#define SCT_OUT0_CLR_CLR4_Msk                 (0x01UL << SCT_OUT0_CLR_CLR4_Pos)                       /*!< SCT OUT0_CLR: CLR4 Mask                 */
#define SCT_OUT0_CLR_CLR5_Pos                 5                                                       /*!< SCT OUT0_CLR: CLR5 Position             */
#define SCT_OUT0_CLR_CLR5_Msk                 (0x01UL << SCT_OUT0_CLR_CLR5_Pos)                       /*!< SCT OUT0_CLR: CLR5 Mask                 */
#define SCT_OUT0_CLR_CLR6_Pos                 6                                                       /*!< SCT OUT0_CLR: CLR6 Position             */
#define SCT_OUT0_CLR_CLR6_Msk                 (0x01UL << SCT_OUT0_CLR_CLR6_Pos)                       /*!< SCT OUT0_CLR: CLR6 Mask                 */
#define SCT_OUT0_CLR_CLR7_Pos                 7                                                       /*!< SCT OUT0_CLR: CLR7 Position             */
#define SCT_OUT0_CLR_CLR7_Msk                 (0x01UL << SCT_OUT0_CLR_CLR7_Pos)                       /*!< SCT OUT0_CLR: CLR7 Mask                 */
#define SCT_OUT0_CLR_CLR8_Pos                 8                                                       /*!< SCT OUT0_CLR: CLR8 Position             */
#define SCT_OUT0_CLR_CLR8_Msk                 (0x01UL << SCT_OUT0_CLR_CLR8_Pos)                       /*!< SCT OUT0_CLR: CLR8 Mask                 */
#define SCT_OUT0_CLR_CLR9_Pos                 9                                                       /*!< SCT OUT0_CLR: CLR9 Position             */
#define SCT_OUT0_CLR_CLR9_Msk                 (0x01UL << SCT_OUT0_CLR_CLR9_Pos)                       /*!< SCT OUT0_CLR: CLR9 Mask                 */
#define SCT_OUT0_CLR_CLR10_Pos                10                                                      /*!< SCT OUT0_CLR: CLR10 Position            */
#define SCT_OUT0_CLR_CLR10_Msk                (0x01UL << SCT_OUT0_CLR_CLR10_Pos)                      /*!< SCT OUT0_CLR: CLR10 Mask                */
#define SCT_OUT0_CLR_CLR11_Pos                11                                                      /*!< SCT OUT0_CLR: CLR11 Position            */
#define SCT_OUT0_CLR_CLR11_Msk                (0x01UL << SCT_OUT0_CLR_CLR11_Pos)                      /*!< SCT OUT0_CLR: CLR11 Mask                */
#define SCT_OUT0_CLR_CLR12_Pos                12                                                      /*!< SCT OUT0_CLR: CLR12 Position            */
#define SCT_OUT0_CLR_CLR12_Msk                (0x01UL << SCT_OUT0_CLR_CLR12_Pos)                      /*!< SCT OUT0_CLR: CLR12 Mask                */
#define SCT_OUT0_CLR_CLR13_Pos                13                                                      /*!< SCT OUT0_CLR: CLR13 Position            */
#define SCT_OUT0_CLR_CLR13_Msk                (0x01UL << SCT_OUT0_CLR_CLR13_Pos)                      /*!< SCT OUT0_CLR: CLR13 Mask                */
#define SCT_OUT0_CLR_CLR14_Pos                14                                                      /*!< SCT OUT0_CLR: CLR14 Position            */
#define SCT_OUT0_CLR_CLR14_Msk                (0x01UL << SCT_OUT0_CLR_CLR14_Pos)                      /*!< SCT OUT0_CLR: CLR14 Mask                */
#define SCT_OUT0_CLR_CLR15_Pos                15                                                      /*!< SCT OUT0_CLR: CLR15 Position            */
#define SCT_OUT0_CLR_CLR15_Msk                (0x01UL << SCT_OUT0_CLR_CLR15_Pos)                      /*!< SCT OUT0_CLR: CLR15 Mask                */

/* --------------------------------  SCT_OUT1_SET  -------------------------------- */
#define SCT_OUT1_SET_SET0_Pos                 0                                                       /*!< SCT OUT1_SET: SET0 Position             */
#define SCT_OUT1_SET_SET0_Msk                 (0x01UL << SCT_OUT1_SET_SET0_Pos)                       /*!< SCT OUT1_SET: SET0 Mask                 */
#define SCT_OUT1_SET_SET1_Pos                 1                                                       /*!< SCT OUT1_SET: SET1 Position             */
#define SCT_OUT1_SET_SET1_Msk                 (0x01UL << SCT_OUT1_SET_SET1_Pos)                       /*!< SCT OUT1_SET: SET1 Mask                 */
#define SCT_OUT1_SET_SET2_Pos                 2                                                       /*!< SCT OUT1_SET: SET2 Position             */
#define SCT_OUT1_SET_SET2_Msk                 (0x01UL << SCT_OUT1_SET_SET2_Pos)                       /*!< SCT OUT1_SET: SET2 Mask                 */
#define SCT_OUT1_SET_SET3_Pos                 3                                                       /*!< SCT OUT1_SET: SET3 Position             */
#define SCT_OUT1_SET_SET3_Msk                 (0x01UL << SCT_OUT1_SET_SET3_Pos)                       /*!< SCT OUT1_SET: SET3 Mask                 */
#define SCT_OUT1_SET_SET4_Pos                 4                                                       /*!< SCT OUT1_SET: SET4 Position             */
#define SCT_OUT1_SET_SET4_Msk                 (0x01UL << SCT_OUT1_SET_SET4_Pos)                       /*!< SCT OUT1_SET: SET4 Mask                 */
#define SCT_OUT1_SET_SET5_Pos                 5                                                       /*!< SCT OUT1_SET: SET5 Position             */
#define SCT_OUT1_SET_SET5_Msk                 (0x01UL << SCT_OUT1_SET_SET5_Pos)                       /*!< SCT OUT1_SET: SET5 Mask                 */
#define SCT_OUT1_SET_SET6_Pos                 6                                                       /*!< SCT OUT1_SET: SET6 Position             */
#define SCT_OUT1_SET_SET6_Msk                 (0x01UL << SCT_OUT1_SET_SET6_Pos)                       /*!< SCT OUT1_SET: SET6 Mask                 */
#define SCT_OUT1_SET_SET7_Pos                 7                                                       /*!< SCT OUT1_SET: SET7 Position             */
#define SCT_OUT1_SET_SET7_Msk                 (0x01UL << SCT_OUT1_SET_SET7_Pos)                       /*!< SCT OUT1_SET: SET7 Mask                 */
#define SCT_OUT1_SET_SET8_Pos                 8                                                       /*!< SCT OUT1_SET: SET8 Position             */
#define SCT_OUT1_SET_SET8_Msk                 (0x01UL << SCT_OUT1_SET_SET8_Pos)                       /*!< SCT OUT1_SET: SET8 Mask                 */
#define SCT_OUT1_SET_SET9_Pos                 9                                                       /*!< SCT OUT1_SET: SET9 Position             */
#define SCT_OUT1_SET_SET9_Msk                 (0x01UL << SCT_OUT1_SET_SET9_Pos)                       /*!< SCT OUT1_SET: SET9 Mask                 */
#define SCT_OUT1_SET_SET10_Pos                10                                                      /*!< SCT OUT1_SET: SET10 Position            */
#define SCT_OUT1_SET_SET10_Msk                (0x01UL << SCT_OUT1_SET_SET10_Pos)                      /*!< SCT OUT1_SET: SET10 Mask                */
#define SCT_OUT1_SET_SET11_Pos                11                                                      /*!< SCT OUT1_SET: SET11 Position            */
#define SCT_OUT1_SET_SET11_Msk                (0x01UL << SCT_OUT1_SET_SET11_Pos)                      /*!< SCT OUT1_SET: SET11 Mask                */
#define SCT_OUT1_SET_SET12_Pos                12                                                      /*!< SCT OUT1_SET: SET12 Position            */
#define SCT_OUT1_SET_SET12_Msk                (0x01UL << SCT_OUT1_SET_SET12_Pos)                      /*!< SCT OUT1_SET: SET12 Mask                */
#define SCT_OUT1_SET_SET13_Pos                13                                                      /*!< SCT OUT1_SET: SET13 Position            */
#define SCT_OUT1_SET_SET13_Msk                (0x01UL << SCT_OUT1_SET_SET13_Pos)                      /*!< SCT OUT1_SET: SET13 Mask                */
#define SCT_OUT1_SET_SET14_Pos                14                                                      /*!< SCT OUT1_SET: SET14 Position            */
#define SCT_OUT1_SET_SET14_Msk                (0x01UL << SCT_OUT1_SET_SET14_Pos)                      /*!< SCT OUT1_SET: SET14 Mask                */
#define SCT_OUT1_SET_SET15_Pos                15                                                      /*!< SCT OUT1_SET: SET15 Position            */
#define SCT_OUT1_SET_SET15_Msk                (0x01UL << SCT_OUT1_SET_SET15_Pos)                      /*!< SCT OUT1_SET: SET15 Mask                */

/* --------------------------------  SCT_OUT1_CLR  -------------------------------- */
#define SCT_OUT1_CLR_CLR0_Pos                 0                                                       /*!< SCT OUT1_CLR: CLR0 Position             */
#define SCT_OUT1_CLR_CLR0_Msk                 (0x01UL << SCT_OUT1_CLR_CLR0_Pos)                       /*!< SCT OUT1_CLR: CLR0 Mask                 */
#define SCT_OUT1_CLR_CLR1_Pos                 1                                                       /*!< SCT OUT1_CLR: CLR1 Position             */
#define SCT_OUT1_CLR_CLR1_Msk                 (0x01UL << SCT_OUT1_CLR_CLR1_Pos)                       /*!< SCT OUT1_CLR: CLR1 Mask                 */
#define SCT_OUT1_CLR_CLR2_Pos                 2                                                       /*!< SCT OUT1_CLR: CLR2 Position             */
#define SCT_OUT1_CLR_CLR2_Msk                 (0x01UL << SCT_OUT1_CLR_CLR2_Pos)                       /*!< SCT OUT1_CLR: CLR2 Mask                 */
#define SCT_OUT1_CLR_CLR3_Pos                 3                                                       /*!< SCT OUT1_CLR: CLR3 Position             */
#define SCT_OUT1_CLR_CLR3_Msk                 (0x01UL << SCT_OUT1_CLR_CLR3_Pos)                       /*!< SCT OUT1_CLR: CLR3 Mask                 */
#define SCT_OUT1_CLR_CLR4_Pos                 4                                                       /*!< SCT OUT1_CLR: CLR4 Position             */
#define SCT_OUT1_CLR_CLR4_Msk                 (0x01UL << SCT_OUT1_CLR_CLR4_Pos)                       /*!< SCT OUT1_CLR: CLR4 Mask                 */
#define SCT_OUT1_CLR_CLR5_Pos                 5                                                       /*!< SCT OUT1_CLR: CLR5 Position             */
#define SCT_OUT1_CLR_CLR5_Msk                 (0x01UL << SCT_OUT1_CLR_CLR5_Pos)                       /*!< SCT OUT1_CLR: CLR5 Mask                 */
#define SCT_OUT1_CLR_CLR6_Pos                 6                                                       /*!< SCT OUT1_CLR: CLR6 Position             */
#define SCT_OUT1_CLR_CLR6_Msk                 (0x01UL << SCT_OUT1_CLR_CLR6_Pos)                       /*!< SCT OUT1_CLR: CLR6 Mask                 */
#define SCT_OUT1_CLR_CLR7_Pos                 7                                                       /*!< SCT OUT1_CLR: CLR7 Position             */
#define SCT_OUT1_CLR_CLR7_Msk                 (0x01UL << SCT_OUT1_CLR_CLR7_Pos)                       /*!< SCT OUT1_CLR: CLR7 Mask                 */
#define SCT_OUT1_CLR_CLR8_Pos                 8                                                       /*!< SCT OUT1_CLR: CLR8 Position             */
#define SCT_OUT1_CLR_CLR8_Msk                 (0x01UL << SCT_OUT1_CLR_CLR8_Pos)                       /*!< SCT OUT1_CLR: CLR8 Mask                 */
#define SCT_OUT1_CLR_CLR9_Pos                 9                                                       /*!< SCT OUT1_CLR: CLR9 Position             */
#define SCT_OUT1_CLR_CLR9_Msk                 (0x01UL << SCT_OUT1_CLR_CLR9_Pos)                       /*!< SCT OUT1_CLR: CLR9 Mask                 */
#define SCT_OUT1_CLR_CLR10_Pos                10                                                      /*!< SCT OUT1_CLR: CLR10 Position            */
#define SCT_OUT1_CLR_CLR10_Msk                (0x01UL << SCT_OUT1_CLR_CLR10_Pos)                      /*!< SCT OUT1_CLR: CLR10 Mask                */
#define SCT_OUT1_CLR_CLR11_Pos                11                                                      /*!< SCT OUT1_CLR: CLR11 Position            */
#define SCT_OUT1_CLR_CLR11_Msk                (0x01UL << SCT_OUT1_CLR_CLR11_Pos)                      /*!< SCT OUT1_CLR: CLR11 Mask                */
#define SCT_OUT1_CLR_CLR12_Pos                12                                                      /*!< SCT OUT1_CLR: CLR12 Position            */
#define SCT_OUT1_CLR_CLR12_Msk                (0x01UL << SCT_OUT1_CLR_CLR12_Pos)                      /*!< SCT OUT1_CLR: CLR12 Mask                */
#define SCT_OUT1_CLR_CLR13_Pos                13                                                      /*!< SCT OUT1_CLR: CLR13 Position            */
#define SCT_OUT1_CLR_CLR13_Msk                (0x01UL << SCT_OUT1_CLR_CLR13_Pos)                      /*!< SCT OUT1_CLR: CLR13 Mask                */
#define SCT_OUT1_CLR_CLR14_Pos                14                                                      /*!< SCT OUT1_CLR: CLR14 Position            */
#define SCT_OUT1_CLR_CLR14_Msk                (0x01UL << SCT_OUT1_CLR_CLR14_Pos)                      /*!< SCT OUT1_CLR: CLR14 Mask                */
#define SCT_OUT1_CLR_CLR15_Pos                15                                                      /*!< SCT OUT1_CLR: CLR15 Position            */
#define SCT_OUT1_CLR_CLR15_Msk                (0x01UL << SCT_OUT1_CLR_CLR15_Pos)                      /*!< SCT OUT1_CLR: CLR15 Mask                */

