MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* --------------------------------  SCT_OUT9_CLR  -------------------------------- */
#define SCT_OUT9_CLR_CLR0_Pos                 0                                                       /*!< SCT OUT9_CLR: CLR0 Position             */
#define SCT_OUT9_CLR_CLR0_Msk                 (0x01UL << SCT_OUT9_CLR_CLR0_Pos)                       /*!< SCT OUT9_CLR: CLR0 Mask                 */
#define SCT_OUT9_CLR_CLR1_Pos                 1                                                       /*!< SCT OUT9_CLR: CLR1 Position             */
#define SCT_OUT9_CLR_CLR1_Msk                 (0x01UL << SCT_OUT9_CLR_CLR1_Pos)                       /*!< SCT OUT9_CLR: CLR1 Mask                 */
#define SCT_OUT9_CLR_CLR2_Pos                 2                                                       /*!< SCT OUT9_CLR: CLR2 Position             */
#define SCT_OUT9_CLR_CLR2_Msk                 (0x01UL << SCT_OUT9_CLR_CLR2_Pos)                       /*!< SCT OUT9_CLR: CLR2 Mask                 */
#define SCT_OUT9_CLR_CLR3_Pos                 3                                                       /*!< SCT OUT9_CLR: CLR3 Position             */
#define SCT_OUT9_CLR_CLR3_Msk                 (0x01UL << SCT_OUT9_CLR_CLR3_Pos)                       /*!< SCT OUT9_CLR: CLR3 Mask                 */
#define SCT_OUT9_CLR_CLR4_Pos                 4                                                       /*!< SCT OUT9_CLR: CLR4 Position             */
#define SCT_OUT9_CLR_CLR4_Msk                 (0x01UL << SCT_OUT9_CLR_CLR4_Pos)                       /*!< SCT OUT9_CLR: CLR4 Mask                 */
#define SCT_OUT9_CLR_CLR5_Pos                 5                                                       /*!< SCT OUT9_CLR: CLR5 Position             */
#define SCT_OUT9_CLR_CLR5_Msk                 (0x01UL << SCT_OUT9_CLR_CLR5_Pos)                       /*!< SCT OUT9_CLR: CLR5 Mask                 */
#define SCT_OUT9_CLR_CLR6_Pos                 6                                                       /*!< SCT OUT9_CLR: CLR6 Position             */
#define SCT_OUT9_CLR_CLR6_Msk                 (0x01UL << SCT_OUT9_CLR_CLR6_Pos)                       /*!< SCT OUT9_CLR: CLR6 Mask                 */
#define SCT_OUT9_CLR_CLR7_Pos                 7                                                       /*!< SCT OUT9_CLR: CLR7 Position             */
#define SCT_OUT9_CLR_CLR7_Msk                 (0x01UL << SCT_OUT9_CLR_CLR7_Pos)                       /*!< SCT OUT9_CLR: CLR7 Mask                 */
#define SCT_OUT9_CLR_CLR8_Pos                 8                                                       /*!< SCT OUT9_CLR: CLR8 Position             */
#define SCT_OUT9_CLR_CLR8_Msk                 (0x01UL << SCT_OUT9_CLR_CLR8_Pos)                       /*!< SCT OUT9_CLR: CLR8 Mask                 */
#define SCT_OUT9_CLR_CLR9_Pos                 9                                                       /*!< SCT OUT9_CLR: CLR9 Position             */
#define SCT_OUT9_CLR_CLR9_Msk                 (0x01UL << SCT_OUT9_CLR_CLR9_Pos)                       /*!< SCT OUT9_CLR: CLR9 Mask                 */
#define SCT_OUT9_CLR_CLR10_Pos                10                                                      /*!< SCT OUT9_CLR: CLR10 Position            */
#define SCT_OUT9_CLR_CLR10_Msk                (0x01UL << SCT_OUT9_CLR_CLR10_Pos)                      /*!< SCT OUT9_CLR: CLR10 Mask                */
#define SCT_OUT9_CLR_CLR11_Pos                11                                                      /*!< SCT OUT9_CLR: CLR11 Position            */
#define SCT_OUT9_CLR_CLR11_Msk                (0x01UL << SCT_OUT9_CLR_CLR11_Pos)                      /*!< SCT OUT9_CLR: CLR11 Mask                */
#define SCT_OUT9_CLR_CLR12_Pos                12                                                      /*!< SCT OUT9_CLR: CLR12 Position            */
#define SCT_OUT9_CLR_CLR12_Msk                (0x01UL << SCT_OUT9_CLR_CLR12_Pos)                      /*!< SCT OUT9_CLR: CLR12 Mask                */
#define SCT_OUT9_CLR_CLR13_Pos                13                                                      /*!< SCT OUT9_CLR: CLR13 Position            */
#define SCT_OUT9_CLR_CLR13_Msk                (0x01UL << SCT_OUT9_CLR_CLR13_Pos)                      /*!< SCT OUT9_CLR: CLR13 Mask                */
#define SCT_OUT9_CLR_CLR14_Pos                14                                                      /*!< SCT OUT9_CLR: CLR14 Position            */
#define SCT_OUT9_CLR_CLR14_Msk                (0x01UL << SCT_OUT9_CLR_CLR14_Pos)                      /*!< SCT OUT9_CLR: CLR14 Mask                */
#define SCT_OUT9_CLR_CLR15_Pos                15                                                      /*!< SCT OUT9_CLR: CLR15 Position            */
#define SCT_OUT9_CLR_CLR15_Msk                (0x01UL << SCT_OUT9_CLR_CLR15_Pos)                      /*!< SCT OUT9_CLR: CLR15 Mask                */

/* --------------------------------  SCT_OUT10_SET  ------------------------------- */
#define SCT_OUT10_SET_SET0_Pos                0                                                       /*!< SCT OUT10_SET: SET0 Position            */
#define SCT_OUT10_SET_SET0_Msk                (0x01UL << SCT_OUT10_SET_SET0_Pos)                      /*!< SCT OUT10_SET: SET0 Mask                */
#define SCT_OUT10_SET_SET1_Pos                1                                                       /*!< SCT OUT10_SET: SET1 Position            */
#define SCT_OUT10_SET_SET1_Msk                (0x01UL << SCT_OUT10_SET_SET1_Pos)                      /*!< SCT OUT10_SET: SET1 Mask                */
#define SCT_OUT10_SET_SET2_Pos                2                                                       /*!< SCT OUT10_SET: SET2 Position            */
#define SCT_OUT10_SET_SET2_Msk                (0x01UL << SCT_OUT10_SET_SET2_Pos)                      /*!< SCT OUT10_SET: SET2 Mask                */
#define SCT_OUT10_SET_SET3_Pos                3                                                       /*!< SCT OUT10_SET: SET3 Position            */
#define SCT_OUT10_SET_SET3_Msk                (0x01UL << SCT_OUT10_SET_SET3_Pos)                      /*!< SCT OUT10_SET: SET3 Mask                */
#define SCT_OUT10_SET_SET4_Pos                4                                                       /*!< SCT OUT10_SET: SET4 Position            */
#define SCT_OUT10_SET_SET4_Msk                (0x01UL << SCT_OUT10_SET_SET4_Pos)                      /*!< SCT OUT10_SET: SET4 Mask                */
#define SCT_OUT10_SET_SET5_Pos                5                                                       /*!< SCT OUT10_SET: SET5 Position            */
#define SCT_OUT10_SET_SET5_Msk                (0x01UL << SCT_OUT10_SET_SET5_Pos)                      /*!< SCT OUT10_SET: SET5 Mask                */
#define SCT_OUT10_SET_SET6_Pos                6                                                       /*!< SCT OUT10_SET: SET6 Position            */
#define SCT_OUT10_SET_SET6_Msk                (0x01UL << SCT_OUT10_SET_SET6_Pos)                      /*!< SCT OUT10_SET: SET6 Mask                */
#define SCT_OUT10_SET_SET7_Pos                7                                                       /*!< SCT OUT10_SET: SET7 Position            */
#define SCT_OUT10_SET_SET7_Msk                (0x01UL << SCT_OUT10_SET_SET7_Pos)                      /*!< SCT OUT10_SET: SET7 Mask                */
#define SCT_OUT10_SET_SET8_Pos                8                                                       /*!< SCT OUT10_SET: SET8 Position            */
#define SCT_OUT10_SET_SET8_Msk                (0x01UL << SCT_OUT10_SET_SET8_Pos)                      /*!< SCT OUT10_SET: SET8 Mask                */
#define SCT_OUT10_SET_SET9_Pos                9                                                       /*!< SCT OUT10_SET: SET9 Position            */
#define SCT_OUT10_SET_SET9_Msk                (0x01UL << SCT_OUT10_SET_SET9_Pos)                      /*!< SCT OUT10_SET: SET9 Mask                */
#define SCT_OUT10_SET_SET10_Pos               10                                                      /*!< SCT OUT10_SET: SET10 Position           */
#define SCT_OUT10_SET_SET10_Msk               (0x01UL << SCT_OUT10_SET_SET10_Pos)                     /*!< SCT OUT10_SET: SET10 Mask               */
#define SCT_OUT10_SET_SET11_Pos               11                                                      /*!< SCT OUT10_SET: SET11 Position           */
#define SCT_OUT10_SET_SET11_Msk               (0x01UL << SCT_OUT10_SET_SET11_Pos)                     /*!< SCT OUT10_SET: SET11 Mask               */
#define SCT_OUT10_SET_SET12_Pos               12                                                      /*!< SCT OUT10_SET: SET12 Position           */
#define SCT_OUT10_SET_SET12_Msk               (0x01UL << SCT_OUT10_SET_SET12_Pos)                     /*!< SCT OUT10_SET: SET12 Mask               */
#define SCT_OUT10_SET_SET13_Pos               13                                                      /*!< SCT OUT10_SET: SET13 Position           */
#define SCT_OUT10_SET_SET13_Msk               (0x01UL << SCT_OUT10_SET_SET13_Pos)                     /*!< SCT OUT10_SET: SET13 Mask               */
#define SCT_OUT10_SET_SET14_Pos               14                                                      /*!< SCT OUT10_SET: SET14 Position           */
#define SCT_OUT10_SET_SET14_Msk               (0x01UL << SCT_OUT10_SET_SET14_Pos)                     /*!< SCT OUT10_SET: SET14 Mask               */
#define SCT_OUT10_SET_SET15_Pos               15                                                      /*!< SCT OUT10_SET: SET15 Position           */
#define SCT_OUT10_SET_SET15_Msk               (0x01UL << SCT_OUT10_SET_SET15_Pos)                     /*!< SCT OUT10_SET: SET15 Mask               */

/* --------------------------------  SCT_OUT10_CLR  ------------------------------- */
#define SCT_OUT10_CLR_CLR0_Pos                0                                                       /*!< SCT OUT10_CLR: CLR0 Position            */
#define SCT_OUT10_CLR_CLR0_Msk                (0x01UL << SCT_OUT10_CLR_CLR0_Pos)                      /*!< SCT OUT10_CLR: CLR0 Mask                */
#define SCT_OUT10_CLR_CLR1_Pos                1                                                       /*!< SCT OUT10_CLR: CLR1 Position            */
#define SCT_OUT10_CLR_CLR1_Msk                (0x01UL << SCT_OUT10_CLR_CLR1_Pos)                      /*!< SCT OUT10_CLR: CLR1 Mask                */
#define SCT_OUT10_CLR_CLR2_Pos                2                                                       /*!< SCT OUT10_CLR: CLR2 Position            */
#define SCT_OUT10_CLR_CLR2_Msk                (0x01UL << SCT_OUT10_CLR_CLR2_Pos)                      /*!< SCT OUT10_CLR: CLR2 Mask                */
#define SCT_OUT10_CLR_CLR3_Pos                3                                                       /*!< SCT OUT10_CLR: CLR3 Position            */
#define SCT_OUT10_CLR_CLR3_Msk                (0x01UL << SCT_OUT10_CLR_CLR3_Pos)                      /*!< SCT OUT10_CLR: CLR3 Mask                */
#define SCT_OUT10_CLR_CLR4_Pos                4                                                       /*!< SCT OUT10_CLR: CLR4 Position            */
#define SCT_OUT10_CLR_CLR4_Msk                (0x01UL << SCT_OUT10_CLR_CLR4_Pos)                      /*!< SCT OUT10_CLR: CLR4 Mask                */
#define SCT_OUT10_CLR_CLR5_Pos                5                                                       /*!< SCT OUT10_CLR: CLR5 Position            */
#define SCT_OUT10_CLR_CLR5_Msk                (0x01UL << SCT_OUT10_CLR_CLR5_Pos)                      /*!< SCT OUT10_CLR: CLR5 Mask                */
#define SCT_OUT10_CLR_CLR6_Pos                6                                                       /*!< SCT OUT10_CLR: CLR6 Position            */
#define SCT_OUT10_CLR_CLR6_Msk                (0x01UL << SCT_OUT10_CLR_CLR6_Pos)                      /*!< SCT OUT10_CLR: CLR6 Mask                */
#define SCT_OUT10_CLR_CLR7_Pos                7                                                       /*!< SCT OUT10_CLR: CLR7 Position            */
#define SCT_OUT10_CLR_CLR7_Msk                (0x01UL << SCT_OUT10_CLR_CLR7_Pos)                      /*!< SCT OUT10_CLR: CLR7 Mask                */
#define SCT_OUT10_CLR_CLR8_Pos                8                                                       /*!< SCT OUT10_CLR: CLR8 Position            */
#define SCT_OUT10_CLR_CLR8_Msk                (0x01UL << SCT_OUT10_CLR_CLR8_Pos)                      /*!< SCT OUT10_CLR: CLR8 Mask                */
#define SCT_OUT10_CLR_CLR9_Pos                9                                                       /*!< SCT OUT10_CLR: CLR9 Position            */
#define SCT_OUT10_CLR_CLR9_Msk                (0x01UL << SCT_OUT10_CLR_CLR9_Pos)                      /*!< SCT OUT10_CLR: CLR9 Mask                */
#define SCT_OUT10_CLR_CLR10_Pos               10                                                      /*!< SCT OUT10_CLR: CLR10 Position           */
#define SCT_OUT10_CLR_CLR10_Msk               (0x01UL << SCT_OUT10_CLR_CLR10_Pos)                     /*!< SCT OUT10_CLR: CLR10 Mask               */
#define SCT_OUT10_CLR_CLR11_Pos               11                                                      /*!< SCT OUT10_CLR: CLR11 Position           */
#define SCT_OUT10_CLR_CLR11_Msk               (0x01UL << SCT_OUT10_CLR_CLR11_Pos)                     /*!< SCT OUT10_CLR: CLR11 Mask               */
#define SCT_OUT10_CLR_CLR12_Pos               12                                                      /*!< SCT OUT10_CLR: CLR12 Position           */
#define SCT_OUT10_CLR_CLR12_Msk               (0x01UL << SCT_OUT10_CLR_CLR12_Pos)                     /*!< SCT OUT10_CLR: CLR12 Mask               */
#define SCT_OUT10_CLR_CLR13_Pos               13                                                      /*!< SCT OUT10_CLR: CLR13 Position           */
#define SCT_OUT10_CLR_CLR13_Msk               (0x01UL << SCT_OUT10_CLR_CLR13_Pos)                     /*!< SCT OUT10_CLR: CLR13 Mask               */
#define SCT_OUT10_CLR_CLR14_Pos               14                                                      /*!< SCT OUT10_CLR: CLR14 Position           */
#define SCT_OUT10_CLR_CLR14_Msk               (0x01UL << SCT_OUT10_CLR_CLR14_Pos)                     /*!< SCT OUT10_CLR: CLR14 Mask               */
#define SCT_OUT10_CLR_CLR15_Pos               15                                                      /*!< SCT OUT10_CLR: CLR15 Position           */
#define SCT_OUT10_CLR_CLR15_Msk               (0x01UL << SCT_OUT10_CLR_CLR15_Pos)                     /*!< SCT OUT10_CLR: CLR15 Mask               */

/* --------------------------------  SCT_OUT11_SET  ------------------------------- */
#define SCT_OUT11_SET_SET0_Pos                0                                                       /*!< SCT OUT11_SET: SET0 Position            */
#define SCT_OUT11_SET_SET0_Msk                (0x01UL << SCT_OUT11_SET_SET0_Pos)                      /*!< SCT OUT11_SET: SET0 Mask                */
#define SCT_OUT11_SET_SET1_Pos                1                                                       /*!< SCT OUT11_SET: SET1 Position            */
#define SCT_OUT11_SET_SET1_Msk                (0x01UL << SCT_OUT11_SET_SET1_Pos)                      /*!< SCT OUT11_SET: SET1 Mask                */
#define SCT_OUT11_SET_SET2_Pos                2                                                       /*!< SCT OUT11_SET: SET2 Position            */
#define SCT_OUT11_SET_SET2_Msk                (0x01UL << SCT_OUT11_SET_SET2_Pos)                      /*!< SCT OUT11_SET: SET2 Mask                */
#define SCT_OUT11_SET_SET3_Pos                3                                                       /*!< SCT OUT11_SET: SET3 Position            */
#define SCT_OUT11_SET_SET3_Msk                (0x01UL << SCT_OUT11_SET_SET3_Pos)                      /*!< SCT OUT11_SET: SET3 Mask                */
#define SCT_OUT11_SET_SET4_Pos                4                                                       /*!< SCT OUT11_SET: SET4 Position            */
#define SCT_OUT11_SET_SET4_Msk                (0x01UL << SCT_OUT11_SET_SET4_Pos)                      /*!< SCT OUT11_SET: SET4 Mask                */
#define SCT_OUT11_SET_SET5_Pos                5                                                       /*!< SCT OUT11_SET: SET5 Position            */
#define SCT_OUT11_SET_SET5_Msk                (0x01UL << SCT_OUT11_SET_SET5_Pos)                      /*!< SCT OUT11_SET: SET5 Mask                */
#define SCT_OUT11_SET_SET6_Pos                6                                                       /*!< SCT OUT11_SET: SET6 Position            */
#define SCT_OUT11_SET_SET6_Msk                (0x01UL << SCT_OUT11_SET_SET6_Pos)                      /*!< SCT OUT11_SET: SET6 Mask                */
#define SCT_OUT11_SET_SET7_Pos                7                                                       /*!< SCT OUT11_SET: SET7 Position            */
#define SCT_OUT11_SET_SET7_Msk                (0x01UL << SCT_OUT11_SET_SET7_Pos)                      /*!< SCT OUT11_SET: SET7 Mask                */
#define SCT_OUT11_SET_SET8_Pos                8                                                       /*!< SCT OUT11_SET: SET8 Position            */
#define SCT_OUT11_SET_SET8_Msk                (0x01UL << SCT_OUT11_SET_SET8_Pos)                      /*!< SCT OUT11_SET: SET8 Mask                */
#define SCT_OUT11_SET_SET9_Pos                9                                                       /*!< SCT OUT11_SET: SET9 Position            */
#define SCT_OUT11_SET_SET9_Msk                (0x01UL << SCT_OUT11_SET_SET9_Pos)                      /*!< SCT OUT11_SET: SET9 Mask                */
#define SCT_OUT11_SET_SET10_Pos               10                                                      /*!< SCT OUT11_SET: SET10 Position           */
#define SCT_OUT11_SET_SET10_Msk               (0x01UL << SCT_OUT11_SET_SET10_Pos)                     /*!< SCT OUT11_SET: SET10 Mask               */
#define SCT_OUT11_SET_SET11_Pos               11                                                      /*!< SCT OUT11_SET: SET11 Position           */
#define SCT_OUT11_SET_SET11_Msk               (0x01UL << SCT_OUT11_SET_SET11_Pos)                     /*!< SCT OUT11_SET: SET11 Mask               */
#define SCT_OUT11_SET_SET12_Pos               12                                                      /*!< SCT OUT11_SET: SET12 Position           */
#define SCT_OUT11_SET_SET12_Msk               (0x01UL << SCT_OUT11_SET_SET12_Pos)                     /*!< SCT OUT11_SET: SET12 Mask               */
#define SCT_OUT11_SET_SET13_Pos               13                                                      /*!< SCT OUT11_SET: SET13 Position           */
#define SCT_OUT11_SET_SET13_Msk               (0x01UL << SCT_OUT11_SET_SET13_Pos)                     /*!< SCT OUT11_SET: SET13 Mask               */
#define SCT_OUT11_SET_SET14_Pos               14                                                      /*!< SCT OUT11_SET: SET14 Position           */
#define SCT_OUT11_SET_SET14_Msk               (0x01UL << SCT_OUT11_SET_SET14_Pos)                     /*!< SCT OUT11_SET: SET14 Mask               */
#define SCT_OUT11_SET_SET15_Pos               15                                                      /*!< SCT OUT11_SET: SET15 Position           */
#define SCT_OUT11_SET_SET15_Msk               (0x01UL << SCT_OUT11_SET_SET15_Pos)                     /*!< SCT OUT11_SET: SET15 Mask               */

