MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -------------------------------  GPDMA_ENBLDCHNS  ------------------------------ */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS0_Pos  0                                                       /*!< GPDMA ENBLDCHNS: ENABLEDCHANNELS0 Position */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS0_Msk  (0x01UL << GPDMA_ENBLDCHNS_ENABLEDCHANNELS0_Pos)        /*!< GPDMA ENBLDCHNS: ENABLEDCHANNELS0 Mask  */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS1_Pos  1                                                       /*!< GPDMA ENBLDCHNS: ENABLEDCHANNELS1 Position */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS1_Msk  (0x01UL << GPDMA_ENBLDCHNS_ENABLEDCHANNELS1_Pos)        /*!< GPDMA ENBLDCHNS: ENABLEDCHANNELS1 Mask  */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS2_Pos  2                                                       /*!< GPDMA ENBLDCHNS: ENABLEDCHANNELS2 Position */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS2_Msk  (0x01UL << GPDMA_ENBLDCHNS_ENABLEDCHANNELS2_Pos)        /*!< GPDMA ENBLDCHNS: ENABLEDCHANNELS2 Mask  */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS3_Pos  3                                                       /*!< GPDMA ENBLDCHNS: ENABLEDCHANNELS3 Position */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS3_Msk  (0x01UL << GPDMA_ENBLDCHNS_ENABLEDCHANNELS3_Pos)        /*!< GPDMA ENBLDCHNS: ENABLEDCHANNELS3 Mask  */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS4_Pos  4                                                       /*!< GPDMA ENBLDCHNS: ENABLEDCHANNELS4 Position */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS4_Msk  (0x01UL << GPDMA_ENBLDCHNS_ENABLEDCHANNELS4_Pos)        /*!< GPDMA ENBLDCHNS: ENABLEDCHANNELS4 Mask  */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS5_Pos  5                                                       /*!< GPDMA ENBLDCHNS: ENABLEDCHANNELS5 Position */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS5_Msk  (0x01UL << GPDMA_ENBLDCHNS_ENABLEDCHANNELS5_Pos)        /*!< GPDMA ENBLDCHNS: ENABLEDCHANNELS5 Mask  */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS6_Pos  6                                                       /*!< GPDMA ENBLDCHNS: ENABLEDCHANNELS6 Position */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS6_Msk  (0x01UL << GPDMA_ENBLDCHNS_ENABLEDCHANNELS6_Pos)        /*!< GPDMA ENBLDCHNS: ENABLEDCHANNELS6 Mask  */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS7_Pos  7                                                       /*!< GPDMA ENBLDCHNS: ENABLEDCHANNELS7 Position */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS7_Msk  (0x01UL << GPDMA_ENBLDCHNS_ENABLEDCHANNELS7_Pos)        /*!< GPDMA ENBLDCHNS: ENABLEDCHANNELS7 Mask  */

/* -------------------------------  GPDMA_SOFTBREQ  ------------------------------- */
#define GPDMA_SOFTBREQ_SOFTBREQ0_Pos          0                                                       /*!< GPDMA SOFTBREQ: SOFTBREQ0 Position      */
#define GPDMA_SOFTBREQ_SOFTBREQ0_Msk          (0x01UL << GPDMA_SOFTBREQ_SOFTBREQ0_Pos)                /*!< GPDMA SOFTBREQ: SOFTBREQ0 Mask          */
#define GPDMA_SOFTBREQ_SOFTBREQ1_Pos          1                                                       /*!< GPDMA SOFTBREQ: SOFTBREQ1 Position      */
#define GPDMA_SOFTBREQ_SOFTBREQ1_Msk          (0x01UL << GPDMA_SOFTBREQ_SOFTBREQ1_Pos)                /*!< GPDMA SOFTBREQ: SOFTBREQ1 Mask          */
#define GPDMA_SOFTBREQ_SOFTBREQ2_Pos          2                                                       /*!< GPDMA SOFTBREQ: SOFTBREQ2 Position      */
#define GPDMA_SOFTBREQ_SOFTBREQ2_Msk          (0x01UL << GPDMA_SOFTBREQ_SOFTBREQ2_Pos)                /*!< GPDMA SOFTBREQ: SOFTBREQ2 Mask          */
#define GPDMA_SOFTBREQ_SOFTBREQ3_Pos          3                                                       /*!< GPDMA SOFTBREQ: SOFTBREQ3 Position      */
#define GPDMA_SOFTBREQ_SOFTBREQ3_Msk          (0x01UL << GPDMA_SOFTBREQ_SOFTBREQ3_Pos)                /*!< GPDMA SOFTBREQ: SOFTBREQ3 Mask          */
#define GPDMA_SOFTBREQ_SOFTBREQ4_Pos          4                                                       /*!< GPDMA SOFTBREQ: SOFTBREQ4 Position      */
#define GPDMA_SOFTBREQ_SOFTBREQ4_Msk          (0x01UL << GPDMA_SOFTBREQ_SOFTBREQ4_Pos)                /*!< GPDMA SOFTBREQ: SOFTBREQ4 Mask          */
#define GPDMA_SOFTBREQ_SOFTBREQ5_Pos          5                                                       /*!< GPDMA SOFTBREQ: SOFTBREQ5 Position      */
#define GPDMA_SOFTBREQ_SOFTBREQ5_Msk          (0x01UL << GPDMA_SOFTBREQ_SOFTBREQ5_Pos)                /*!< GPDMA SOFTBREQ: SOFTBREQ5 Mask          */
#define GPDMA_SOFTBREQ_SOFTBREQ6_Pos          6                                                       /*!< GPDMA SOFTBREQ: SOFTBREQ6 Position      */
#define GPDMA_SOFTBREQ_SOFTBREQ6_Msk          (0x01UL << GPDMA_SOFTBREQ_SOFTBREQ6_Pos)                /*!< GPDMA SOFTBREQ: SOFTBREQ6 Mask          */
#define GPDMA_SOFTBREQ_SOFTBREQ7_Pos          7                                                       /*!< GPDMA SOFTBREQ: SOFTBREQ7 Position      */
#define GPDMA_SOFTBREQ_SOFTBREQ7_Msk          (0x01UL << GPDMA_SOFTBREQ_SOFTBREQ7_Pos)                /*!< GPDMA SOFTBREQ: SOFTBREQ7 Mask          */
#define GPDMA_SOFTBREQ_SOFTBREQ8_Pos          8                                                       /*!< GPDMA SOFTBREQ: SOFTBREQ8 Position      */
#define GPDMA_SOFTBREQ_SOFTBREQ8_Msk          (0x01UL << GPDMA_SOFTBREQ_SOFTBREQ8_Pos)                /*!< GPDMA SOFTBREQ: SOFTBREQ8 Mask          */
#define GPDMA_SOFTBREQ_SOFTBREQ9_Pos          9                                                       /*!< GPDMA SOFTBREQ: SOFTBREQ9 Position      */
#define GPDMA_SOFTBREQ_SOFTBREQ9_Msk          (0x01UL << GPDMA_SOFTBREQ_SOFTBREQ9_Pos)                /*!< GPDMA SOFTBREQ: SOFTBREQ9 Mask          */
#define GPDMA_SOFTBREQ_SOFTBREQ10_Pos         10                                                      /*!< GPDMA SOFTBREQ: SOFTBREQ10 Position     */
#define GPDMA_SOFTBREQ_SOFTBREQ10_Msk         (0x01UL << GPDMA_SOFTBREQ_SOFTBREQ10_Pos)               /*!< GPDMA SOFTBREQ: SOFTBREQ10 Mask         */
#define GPDMA_SOFTBREQ_SOFTBREQ11_Pos         11                                                      /*!< GPDMA SOFTBREQ: SOFTBREQ11 Position     */
#define GPDMA_SOFTBREQ_SOFTBREQ11_Msk         (0x01UL << GPDMA_SOFTBREQ_SOFTBREQ11_Pos)               /*!< GPDMA SOFTBREQ: SOFTBREQ11 Mask         */
#define GPDMA_SOFTBREQ_SOFTBREQ12_Pos         12                                                      /*!< GPDMA SOFTBREQ: SOFTBREQ12 Position     */
#define GPDMA_SOFTBREQ_SOFTBREQ12_Msk         (0x01UL << GPDMA_SOFTBREQ_SOFTBREQ12_Pos)               /*!< GPDMA SOFTBREQ: SOFTBREQ12 Mask         */
#define GPDMA_SOFTBREQ_SOFTBREQ13_Pos         13                                                      /*!< GPDMA SOFTBREQ: SOFTBREQ13 Position     */
#define GPDMA_SOFTBREQ_SOFTBREQ13_Msk         (0x01UL << GPDMA_SOFTBREQ_SOFTBREQ13_Pos)               /*!< GPDMA SOFTBREQ: SOFTBREQ13 Mask         */
#define GPDMA_SOFTBREQ_SOFTBREQ14_Pos         14                                                      /*!< GPDMA SOFTBREQ: SOFTBREQ14 Position     */
#define GPDMA_SOFTBREQ_SOFTBREQ14_Msk         (0x01UL << GPDMA_SOFTBREQ_SOFTBREQ14_Pos)               /*!< GPDMA SOFTBREQ: SOFTBREQ14 Mask         */
#define GPDMA_SOFTBREQ_SOFTBREQ15_Pos         15                                                      /*!< GPDMA SOFTBREQ: SOFTBREQ15 Position     */
#define GPDMA_SOFTBREQ_SOFTBREQ15_Msk         (0x01UL << GPDMA_SOFTBREQ_SOFTBREQ15_Pos)               /*!< GPDMA SOFTBREQ: SOFTBREQ15 Mask         */

