MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -------------------------------  GPDMA_SOFTSREQ  ------------------------------- */
#define GPDMA_SOFTSREQ_SOFTSREQ0_Pos          0                                                       /*!< GPDMA SOFTSREQ: SOFTSREQ0 Position      */
#define GPDMA_SOFTSREQ_SOFTSREQ0_Msk          (0x01UL << GPDMA_SOFTSREQ_SOFTSREQ0_Pos)                /*!< GPDMA SOFTSREQ: SOFTSREQ0 Mask          */
#define GPDMA_SOFTSREQ_SOFTSREQ1_Pos          1                                                       /*!< GPDMA SOFTSREQ: SOFTSREQ1 Position      */
#define GPDMA_SOFTSREQ_SOFTSREQ1_Msk          (0x01UL << GPDMA_SOFTSREQ_SOFTSREQ1_Pos)                /*!< GPDMA SOFTSREQ: SOFTSREQ1 Mask          */
#define GPDMA_SOFTSREQ_SOFTSREQ2_Pos          2                                                       /*!< GPDMA SOFTSREQ: SOFTSREQ2 Position      */
#define GPDMA_SOFTSREQ_SOFTSREQ2_Msk          (0x01UL << GPDMA_SOFTSREQ_SOFTSREQ2_Pos)                /*!< GPDMA SOFTSREQ: SOFTSREQ2 Mask          */
#define GPDMA_SOFTSREQ_SOFTSREQ3_Pos          3                                                       /*!< GPDMA SOFTSREQ: SOFTSREQ3 Position      */
#define GPDMA_SOFTSREQ_SOFTSREQ3_Msk          (0x01UL << GPDMA_SOFTSREQ_SOFTSREQ3_Pos)                /*!< GPDMA SOFTSREQ: SOFTSREQ3 Mask          */
#define GPDMA_SOFTSREQ_SOFTSREQ4_Pos          4                                                       /*!< GPDMA SOFTSREQ: SOFTSREQ4 Position      */
#define GPDMA_SOFTSREQ_SOFTSREQ4_Msk          (0x01UL << GPDMA_SOFTSREQ_SOFTSREQ4_Pos)                /*!< GPDMA SOFTSREQ: SOFTSREQ4 Mask          */
#define GPDMA_SOFTSREQ_SOFTSREQ5_Pos          5                                                       /*!< GPDMA SOFTSREQ: SOFTSREQ5 Position      */
#define GPDMA_SOFTSREQ_SOFTSREQ5_Msk          (0x01UL << GPDMA_SOFTSREQ_SOFTSREQ5_Pos)                /*!< GPDMA SOFTSREQ: SOFTSREQ5 Mask          */
#define GPDMA_SOFTSREQ_SOFTSREQ6_Pos          6                                                       /*!< GPDMA SOFTSREQ: SOFTSREQ6 Position      */
#define GPDMA_SOFTSREQ_SOFTSREQ6_Msk          (0x01UL << GPDMA_SOFTSREQ_SOFTSREQ6_Pos)                /*!< GPDMA SOFTSREQ: SOFTSREQ6 Mask          */
#define GPDMA_SOFTSREQ_SOFTSREQ7_Pos          7                                                       /*!< GPDMA SOFTSREQ: SOFTSREQ7 Position      */
#define GPDMA_SOFTSREQ_SOFTSREQ7_Msk          (0x01UL << GPDMA_SOFTSREQ_SOFTSREQ7_Pos)                /*!< GPDMA SOFTSREQ: SOFTSREQ7 Mask          */
#define GPDMA_SOFTSREQ_SOFTSREQ8_Pos          8                                                       /*!< GPDMA SOFTSREQ: SOFTSREQ8 Position      */
#define GPDMA_SOFTSREQ_SOFTSREQ8_Msk          (0x01UL << GPDMA_SOFTSREQ_SOFTSREQ8_Pos)                /*!< GPDMA SOFTSREQ: SOFTSREQ8 Mask          */
#define GPDMA_SOFTSREQ_SOFTSREQ9_Pos          9                                                       /*!< GPDMA SOFTSREQ: SOFTSREQ9 Position      */
#define GPDMA_SOFTSREQ_SOFTSREQ9_Msk          (0x01UL << GPDMA_SOFTSREQ_SOFTSREQ9_Pos)                /*!< GPDMA SOFTSREQ: SOFTSREQ9 Mask          */
#define GPDMA_SOFTSREQ_SOFTSREQ10_Pos         10                                                      /*!< GPDMA SOFTSREQ: SOFTSREQ10 Position     */
#define GPDMA_SOFTSREQ_SOFTSREQ10_Msk         (0x01UL << GPDMA_SOFTSREQ_SOFTSREQ10_Pos)               /*!< GPDMA SOFTSREQ: SOFTSREQ10 Mask         */
#define GPDMA_SOFTSREQ_SOFTSREQ11_Pos         11                                                      /*!< GPDMA SOFTSREQ: SOFTSREQ11 Position     */
#define GPDMA_SOFTSREQ_SOFTSREQ11_Msk         (0x01UL << GPDMA_SOFTSREQ_SOFTSREQ11_Pos)               /*!< GPDMA SOFTSREQ: SOFTSREQ11 Mask         */
#define GPDMA_SOFTSREQ_SOFTSREQ12_Pos         12                                                      /*!< GPDMA SOFTSREQ: SOFTSREQ12 Position     */
#define GPDMA_SOFTSREQ_SOFTSREQ12_Msk         (0x01UL << GPDMA_SOFTSREQ_SOFTSREQ12_Pos)               /*!< GPDMA SOFTSREQ: SOFTSREQ12 Mask         */
#define GPDMA_SOFTSREQ_SOFTSREQ13_Pos         13                                                      /*!< GPDMA SOFTSREQ: SOFTSREQ13 Position     */
#define GPDMA_SOFTSREQ_SOFTSREQ13_Msk         (0x01UL << GPDMA_SOFTSREQ_SOFTSREQ13_Pos)               /*!< GPDMA SOFTSREQ: SOFTSREQ13 Mask         */
#define GPDMA_SOFTSREQ_SOFTSREQ14_Pos         14                                                      /*!< GPDMA SOFTSREQ: SOFTSREQ14 Position     */
#define GPDMA_SOFTSREQ_SOFTSREQ14_Msk         (0x01UL << GPDMA_SOFTSREQ_SOFTSREQ14_Pos)               /*!< GPDMA SOFTSREQ: SOFTSREQ14 Mask         */
#define GPDMA_SOFTSREQ_SOFTSREQ15_Pos         15                                                      /*!< GPDMA SOFTSREQ: SOFTSREQ15 Position     */
#define GPDMA_SOFTSREQ_SOFTSREQ15_Msk         (0x01UL << GPDMA_SOFTSREQ_SOFTSREQ15_Pos)               /*!< GPDMA SOFTSREQ: SOFTSREQ15 Mask         */

/* -------------------------------  GPDMA_SOFTLBREQ  ------------------------------ */
#define GPDMA_SOFTLBREQ_SOFTLBREQ0_Pos        0                                                       /*!< GPDMA SOFTLBREQ: SOFTLBREQ0 Position    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ0_Msk        (0x01UL << GPDMA_SOFTLBREQ_SOFTLBREQ0_Pos)              /*!< GPDMA SOFTLBREQ: SOFTLBREQ0 Mask        */
#define GPDMA_SOFTLBREQ_SOFTLBREQ1_Pos        1                                                       /*!< GPDMA SOFTLBREQ: SOFTLBREQ1 Position    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ1_Msk        (0x01UL << GPDMA_SOFTLBREQ_SOFTLBREQ1_Pos)              /*!< GPDMA SOFTLBREQ: SOFTLBREQ1 Mask        */
#define GPDMA_SOFTLBREQ_SOFTLBREQ2_Pos        2                                                       /*!< GPDMA SOFTLBREQ: SOFTLBREQ2 Position    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ2_Msk        (0x01UL << GPDMA_SOFTLBREQ_SOFTLBREQ2_Pos)              /*!< GPDMA SOFTLBREQ: SOFTLBREQ2 Mask        */
#define GPDMA_SOFTLBREQ_SOFTLBREQ3_Pos        3                                                       /*!< GPDMA SOFTLBREQ: SOFTLBREQ3 Position    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ3_Msk        (0x01UL << GPDMA_SOFTLBREQ_SOFTLBREQ3_Pos)              /*!< GPDMA SOFTLBREQ: SOFTLBREQ3 Mask        */
#define GPDMA_SOFTLBREQ_SOFTLBREQ4_Pos        4                                                       /*!< GPDMA SOFTLBREQ: SOFTLBREQ4 Position    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ4_Msk        (0x01UL << GPDMA_SOFTLBREQ_SOFTLBREQ4_Pos)              /*!< GPDMA SOFTLBREQ: SOFTLBREQ4 Mask        */
#define GPDMA_SOFTLBREQ_SOFTLBREQ5_Pos        5                                                       /*!< GPDMA SOFTLBREQ: SOFTLBREQ5 Position    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ5_Msk        (0x01UL << GPDMA_SOFTLBREQ_SOFTLBREQ5_Pos)              /*!< GPDMA SOFTLBREQ: SOFTLBREQ5 Mask        */
#define GPDMA_SOFTLBREQ_SOFTLBREQ6_Pos        6                                                       /*!< GPDMA SOFTLBREQ: SOFTLBREQ6 Position    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ6_Msk        (0x01UL << GPDMA_SOFTLBREQ_SOFTLBREQ6_Pos)              /*!< GPDMA SOFTLBREQ: SOFTLBREQ6 Mask        */
#define GPDMA_SOFTLBREQ_SOFTLBREQ7_Pos        7                                                       /*!< GPDMA SOFTLBREQ: SOFTLBREQ7 Position    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ7_Msk        (0x01UL << GPDMA_SOFTLBREQ_SOFTLBREQ7_Pos)              /*!< GPDMA SOFTLBREQ: SOFTLBREQ7 Mask        */
#define GPDMA_SOFTLBREQ_SOFTLBREQ8_Pos        8                                                       /*!< GPDMA SOFTLBREQ: SOFTLBREQ8 Position    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ8_Msk        (0x01UL << GPDMA_SOFTLBREQ_SOFTLBREQ8_Pos)              /*!< GPDMA SOFTLBREQ: SOFTLBREQ8 Mask        */
#define GPDMA_SOFTLBREQ_SOFTLBREQ9_Pos        9                                                       /*!< GPDMA SOFTLBREQ: SOFTLBREQ9 Position    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ9_Msk        (0x01UL << GPDMA_SOFTLBREQ_SOFTLBREQ9_Pos)              /*!< GPDMA SOFTLBREQ: SOFTLBREQ9 Mask        */
#define GPDMA_SOFTLBREQ_SOFTLBREQ10_Pos       10                                                      /*!< GPDMA SOFTLBREQ: SOFTLBREQ10 Position   */
#define GPDMA_SOFTLBREQ_SOFTLBREQ10_Msk       (0x01UL << GPDMA_SOFTLBREQ_SOFTLBREQ10_Pos)             /*!< GPDMA SOFTLBREQ: SOFTLBREQ10 Mask       */
#define GPDMA_SOFTLBREQ_SOFTLBREQ11_Pos       11                                                      /*!< GPDMA SOFTLBREQ: SOFTLBREQ11 Position   */
#define GPDMA_SOFTLBREQ_SOFTLBREQ11_Msk       (0x01UL << GPDMA_SOFTLBREQ_SOFTLBREQ11_Pos)             /*!< GPDMA SOFTLBREQ: SOFTLBREQ11 Mask       */
#define GPDMA_SOFTLBREQ_SOFTLBREQ12_Pos       12                                                      /*!< GPDMA SOFTLBREQ: SOFTLBREQ12 Position   */
#define GPDMA_SOFTLBREQ_SOFTLBREQ12_Msk       (0x01UL << GPDMA_SOFTLBREQ_SOFTLBREQ12_Pos)             /*!< GPDMA SOFTLBREQ: SOFTLBREQ12 Mask       */
#define GPDMA_SOFTLBREQ_SOFTLBREQ13_Pos       13                                                      /*!< GPDMA SOFTLBREQ: SOFTLBREQ13 Position   */
#define GPDMA_SOFTLBREQ_SOFTLBREQ13_Msk       (0x01UL << GPDMA_SOFTLBREQ_SOFTLBREQ13_Pos)             /*!< GPDMA SOFTLBREQ: SOFTLBREQ13 Mask       */
#define GPDMA_SOFTLBREQ_SOFTLBREQ14_Pos       14                                                      /*!< GPDMA SOFTLBREQ: SOFTLBREQ14 Position   */
#define GPDMA_SOFTLBREQ_SOFTLBREQ14_Msk       (0x01UL << GPDMA_SOFTLBREQ_SOFTLBREQ14_Pos)             /*!< GPDMA SOFTLBREQ: SOFTLBREQ14 Mask       */
#define GPDMA_SOFTLBREQ_SOFTLBREQ15_Pos       15                                                      /*!< GPDMA SOFTLBREQ: SOFTLBREQ15 Position   */
#define GPDMA_SOFTLBREQ_SOFTLBREQ15_Msk       (0x01UL << GPDMA_SOFTLBREQ_SOFTLBREQ15_Pos)             /*!< GPDMA SOFTLBREQ: SOFTLBREQ15 Mask       */

/* -------------------------------  GPDMA_SOFTLSREQ  ------------------------------ */
#define GPDMA_SOFTLSREQ_SOFTLSREQ0_Pos        0                                                       /*!< GPDMA SOFTLSREQ: SOFTLSREQ0 Position    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ0_Msk        (0x01UL << GPDMA_SOFTLSREQ_SOFTLSREQ0_Pos)              /*!< GPDMA SOFTLSREQ: SOFTLSREQ0 Mask        */
#define GPDMA_SOFTLSREQ_SOFTLSREQ1_Pos        1                                                       /*!< GPDMA SOFTLSREQ: SOFTLSREQ1 Position    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ1_Msk        (0x01UL << GPDMA_SOFTLSREQ_SOFTLSREQ1_Pos)              /*!< GPDMA SOFTLSREQ: SOFTLSREQ1 Mask        */
#define GPDMA_SOFTLSREQ_SOFTLSREQ2_Pos        2                                                       /*!< GPDMA SOFTLSREQ: SOFTLSREQ2 Position    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ2_Msk        (0x01UL << GPDMA_SOFTLSREQ_SOFTLSREQ2_Pos)              /*!< GPDMA SOFTLSREQ: SOFTLSREQ2 Mask        */
#define GPDMA_SOFTLSREQ_SOFTLSREQ3_Pos        3                                                       /*!< GPDMA SOFTLSREQ: SOFTLSREQ3 Position    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ3_Msk        (0x01UL << GPDMA_SOFTLSREQ_SOFTLSREQ3_Pos)              /*!< GPDMA SOFTLSREQ: SOFTLSREQ3 Mask        */
#define GPDMA_SOFTLSREQ_SOFTLSREQ4_Pos        4                                                       /*!< GPDMA SOFTLSREQ: SOFTLSREQ4 Position    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ4_Msk        (0x01UL << GPDMA_SOFTLSREQ_SOFTLSREQ4_Pos)              /*!< GPDMA SOFTLSREQ: SOFTLSREQ4 Mask        */
#define GPDMA_SOFTLSREQ_SOFTLSREQ5_Pos        5                                                       /*!< GPDMA SOFTLSREQ: SOFTLSREQ5 Position    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ5_Msk        (0x01UL << GPDMA_SOFTLSREQ_SOFTLSREQ5_Pos)              /*!< GPDMA SOFTLSREQ: SOFTLSREQ5 Mask        */
#define GPDMA_SOFTLSREQ_SOFTLSREQ6_Pos        6                                                       /*!< GPDMA SOFTLSREQ: SOFTLSREQ6 Position    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ6_Msk        (0x01UL << GPDMA_SOFTLSREQ_SOFTLSREQ6_Pos)              /*!< GPDMA SOFTLSREQ: SOFTLSREQ6 Mask        */
#define GPDMA_SOFTLSREQ_SOFTLSREQ7_Pos        7                                                       /*!< GPDMA SOFTLSREQ: SOFTLSREQ7 Position    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ7_Msk        (0x01UL << GPDMA_SOFTLSREQ_SOFTLSREQ7_Pos)              /*!< GPDMA SOFTLSREQ: SOFTLSREQ7 Mask        */
#define GPDMA_SOFTLSREQ_SOFTLSREQ8_Pos        8                                                       /*!< GPDMA SOFTLSREQ: SOFTLSREQ8 Position    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ8_Msk        (0x01UL << GPDMA_SOFTLSREQ_SOFTLSREQ8_Pos)              /*!< GPDMA SOFTLSREQ: SOFTLSREQ8 Mask        */
#define GPDMA_SOFTLSREQ_SOFTLSREQ9_Pos        9                                                       /*!< GPDMA SOFTLSREQ: SOFTLSREQ9 Position    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ9_Msk        (0x01UL << GPDMA_SOFTLSREQ_SOFTLSREQ9_Pos)              /*!< GPDMA SOFTLSREQ: SOFTLSREQ9 Mask        */
#define GPDMA_SOFTLSREQ_SOFTLSREQ10_Pos       10                                                      /*!< GPDMA SOFTLSREQ: SOFTLSREQ10 Position   */
#define GPDMA_SOFTLSREQ_SOFTLSREQ10_Msk       (0x01UL << GPDMA_SOFTLSREQ_SOFTLSREQ10_Pos)             /*!< GPDMA SOFTLSREQ: SOFTLSREQ10 Mask       */
#define GPDMA_SOFTLSREQ_SOFTLSREQ11_Pos       11                                                      /*!< GPDMA SOFTLSREQ: SOFTLSREQ11 Position   */
#define GPDMA_SOFTLSREQ_SOFTLSREQ11_Msk       (0x01UL << GPDMA_SOFTLSREQ_SOFTLSREQ11_Pos)             /*!< GPDMA SOFTLSREQ: SOFTLSREQ11 Mask       */
#define GPDMA_SOFTLSREQ_SOFTLSREQ12_Pos       12                                                      /*!< GPDMA SOFTLSREQ: SOFTLSREQ12 Position   */
#define GPDMA_SOFTLSREQ_SOFTLSREQ12_Msk       (0x01UL << GPDMA_SOFTLSREQ_SOFTLSREQ12_Pos)             /*!< GPDMA SOFTLSREQ: SOFTLSREQ12 Mask       */
#define GPDMA_SOFTLSREQ_SOFTLSREQ13_Pos       13                                                      /*!< GPDMA SOFTLSREQ: SOFTLSREQ13 Position   */
#define GPDMA_SOFTLSREQ_SOFTLSREQ13_Msk       (0x01UL << GPDMA_SOFTLSREQ_SOFTLSREQ13_Pos)             /*!< GPDMA SOFTLSREQ: SOFTLSREQ13 Mask       */
#define GPDMA_SOFTLSREQ_SOFTLSREQ14_Pos       14                                                      /*!< GPDMA SOFTLSREQ: SOFTLSREQ14 Position   */
#define GPDMA_SOFTLSREQ_SOFTLSREQ14_Msk       (0x01UL << GPDMA_SOFTLSREQ_SOFTLSREQ14_Pos)             /*!< GPDMA SOFTLSREQ: SOFTLSREQ14 Mask       */
#define GPDMA_SOFTLSREQ_SOFTLSREQ15_Pos       15                                                      /*!< GPDMA SOFTLSREQ: SOFTLSREQ15 Position   */
#define GPDMA_SOFTLSREQ_SOFTLSREQ15_Msk       (0x01UL << GPDMA_SOFTLSREQ_SOFTLSREQ15_Pos)             /*!< GPDMA SOFTLSREQ: SOFTLSREQ15 Mask       */

