MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* --------------------------------  GPDMA_CONFIG  -------------------------------- */
#define GPDMA_CONFIG_E_Pos                    0                                                       /*!< GPDMA CONFIG: E Position                */
#define GPDMA_CONFIG_E_Msk                    (0x01UL << GPDMA_CONFIG_E_Pos)                          /*!< GPDMA CONFIG: E Mask                    */
#define GPDMA_CONFIG_M0_Pos                   1                                                       /*!< GPDMA CONFIG: M0 Position               */
#define GPDMA_CONFIG_M0_Msk                   (0x01UL << GPDMA_CONFIG_M0_Pos)                         /*!< GPDMA CONFIG: M0 Mask                   */
#define GPDMA_CONFIG_M1_Pos                   2                                                       /*!< GPDMA CONFIG: M1 Position               */
#define GPDMA_CONFIG_M1_Msk                   (0x01UL << GPDMA_CONFIG_M1_Pos)                         /*!< GPDMA CONFIG: M1 Mask                   */

/* ---------------------------------  GPDMA_SYNC  --------------------------------- */
#define GPDMA_SYNC_DMACSYNC0_Pos              0                                                       /*!< GPDMA SYNC: DMACSYNC0 Position          */
#define GPDMA_SYNC_DMACSYNC0_Msk              (0x01UL << GPDMA_SYNC_DMACSYNC0_Pos)                    /*!< GPDMA SYNC: DMACSYNC0 Mask              */
#define GPDMA_SYNC_DMACSYNC1_Pos              1                                                       /*!< GPDMA SYNC: DMACSYNC1 Position          */
#define GPDMA_SYNC_DMACSYNC1_Msk              (0x01UL << GPDMA_SYNC_DMACSYNC1_Pos)                    /*!< GPDMA SYNC: DMACSYNC1 Mask              */
#define GPDMA_SYNC_DMACSYNC2_Pos              2                                                       /*!< GPDMA SYNC: DMACSYNC2 Position          */
#define GPDMA_SYNC_DMACSYNC2_Msk              (0x01UL << GPDMA_SYNC_DMACSYNC2_Pos)                    /*!< GPDMA SYNC: DMACSYNC2 Mask              */
#define GPDMA_SYNC_DMACSYNC3_Pos              3                                                       /*!< GPDMA SYNC: DMACSYNC3 Position          */
#define GPDMA_SYNC_DMACSYNC3_Msk              (0x01UL << GPDMA_SYNC_DMACSYNC3_Pos)                    /*!< GPDMA SYNC: DMACSYNC3 Mask              */
#define GPDMA_SYNC_DMACSYNC4_Pos              4                                                       /*!< GPDMA SYNC: DMACSYNC4 Position          */
#define GPDMA_SYNC_DMACSYNC4_Msk              (0x01UL << GPDMA_SYNC_DMACSYNC4_Pos)                    /*!< GPDMA SYNC: DMACSYNC4 Mask              */
#define GPDMA_SYNC_DMACSYNC5_Pos              5                                                       /*!< GPDMA SYNC: DMACSYNC5 Position          */
#define GPDMA_SYNC_DMACSYNC5_Msk              (0x01UL << GPDMA_SYNC_DMACSYNC5_Pos)                    /*!< GPDMA SYNC: DMACSYNC5 Mask              */
#define GPDMA_SYNC_DMACSYNC6_Pos              6                                                       /*!< GPDMA SYNC: DMACSYNC6 Position          */
#define GPDMA_SYNC_DMACSYNC6_Msk              (0x01UL << GPDMA_SYNC_DMACSYNC6_Pos)                    /*!< GPDMA SYNC: DMACSYNC6 Mask              */
#define GPDMA_SYNC_DMACSYNC7_Pos              7                                                       /*!< GPDMA SYNC: DMACSYNC7 Position          */
#define GPDMA_SYNC_DMACSYNC7_Msk              (0x01UL << GPDMA_SYNC_DMACSYNC7_Pos)                    /*!< GPDMA SYNC: DMACSYNC7 Mask              */
#define GPDMA_SYNC_DMACSYNC8_Pos              8                                                       /*!< GPDMA SYNC: DMACSYNC8 Position          */
#define GPDMA_SYNC_DMACSYNC8_Msk              (0x01UL << GPDMA_SYNC_DMACSYNC8_Pos)                    /*!< GPDMA SYNC: DMACSYNC8 Mask              */
#define GPDMA_SYNC_DMACSYNC9_Pos              9                                                       /*!< GPDMA SYNC: DMACSYNC9 Position          */
#define GPDMA_SYNC_DMACSYNC9_Msk              (0x01UL << GPDMA_SYNC_DMACSYNC9_Pos)                    /*!< GPDMA SYNC: DMACSYNC9 Mask              */
#define GPDMA_SYNC_DMACSYNC10_Pos             10                                                      /*!< GPDMA SYNC: DMACSYNC10 Position         */
#define GPDMA_SYNC_DMACSYNC10_Msk             (0x01UL << GPDMA_SYNC_DMACSYNC10_Pos)                   /*!< GPDMA SYNC: DMACSYNC10 Mask             */
#define GPDMA_SYNC_DMACSYNC11_Pos             11                                                      /*!< GPDMA SYNC: DMACSYNC11 Position         */
#define GPDMA_SYNC_DMACSYNC11_Msk             (0x01UL << GPDMA_SYNC_DMACSYNC11_Pos)                   /*!< GPDMA SYNC: DMACSYNC11 Mask             */
#define GPDMA_SYNC_DMACSYNC12_Pos             12                                                      /*!< GPDMA SYNC: DMACSYNC12 Position         */
#define GPDMA_SYNC_DMACSYNC12_Msk             (0x01UL << GPDMA_SYNC_DMACSYNC12_Pos)                   /*!< GPDMA SYNC: DMACSYNC12 Mask             */
#define GPDMA_SYNC_DMACSYNC13_Pos             13                                                      /*!< GPDMA SYNC: DMACSYNC13 Position         */
#define GPDMA_SYNC_DMACSYNC13_Msk             (0x01UL << GPDMA_SYNC_DMACSYNC13_Pos)                   /*!< GPDMA SYNC: DMACSYNC13 Mask             */
#define GPDMA_SYNC_DMACSYNC14_Pos             14                                                      /*!< GPDMA SYNC: DMACSYNC14 Position         */
#define GPDMA_SYNC_DMACSYNC14_Msk             (0x01UL << GPDMA_SYNC_DMACSYNC14_Pos)                   /*!< GPDMA SYNC: DMACSYNC14 Mask             */
#define GPDMA_SYNC_DMACSYNC15_Pos             15                                                      /*!< GPDMA SYNC: DMACSYNC15 Position         */
#define GPDMA_SYNC_DMACSYNC15_Msk             (0x01UL << GPDMA_SYNC_DMACSYNC15_Pos)                   /*!< GPDMA SYNC: DMACSYNC15 Mask             */

/* -------------------------------  GPDMA_C0SRCADDR  ------------------------------ */
#define GPDMA_C0SRCADDR_SRCADDR_Pos           0                                                       /*!< GPDMA C0SRCADDR: SRCADDR Position       */
#define GPDMA_C0SRCADDR_SRCADDR_Msk           (0xffffffffUL << GPDMA_C0SRCADDR_SRCADDR_Pos)           /*!< GPDMA C0SRCADDR: SRCADDR Mask           */

/* ------------------------------  GPDMA_C0DESTADDR  ------------------------------ */
#define GPDMA_C0DESTADDR_DESTADDR_Pos         0                                                       /*!< GPDMA C0DESTADDR: DESTADDR Position     */
#define GPDMA_C0DESTADDR_DESTADDR_Msk         (0xffffffffUL << GPDMA_C0DESTADDR_DESTADDR_Pos)         /*!< GPDMA C0DESTADDR: DESTADDR Mask         */

/* ---------------------------------  GPDMA_C0LLI  -------------------------------- */
#define GPDMA_C0LLI_LM_Pos                    0                                                       /*!< GPDMA C0LLI: LM Position                */
#define GPDMA_C0LLI_LM_Msk                    (0x01UL << GPDMA_C0LLI_LM_Pos)                          /*!< GPDMA C0LLI: LM Mask                    */
#define GPDMA_C0LLI_R_Pos                     1                                                       /*!< GPDMA C0LLI: R Position                 */
#define GPDMA_C0LLI_R_Msk                     (0x01UL << GPDMA_C0LLI_R_Pos)                           /*!< GPDMA C0LLI: R Mask                     */
#define GPDMA_C0LLI_LLI_Pos                   2                                                       /*!< GPDMA C0LLI: LLI Position               */
#define GPDMA_C0LLI_LLI_Msk                   (0x3fffffffUL << GPDMA_C0LLI_LLI_Pos)                   /*!< GPDMA C0LLI: LLI Mask                   */

/* -------------------------------  GPDMA_C0CONTROL  ------------------------------ */
#define GPDMA_C0CONTROL_TRANSFERSIZE_Pos      0                                                       /*!< GPDMA C0CONTROL: TRANSFERSIZE Position  */
#define GPDMA_C0CONTROL_TRANSFERSIZE_Msk      (0x00000fffUL << GPDMA_C0CONTROL_TRANSFERSIZE_Pos)      /*!< GPDMA C0CONTROL: TRANSFERSIZE Mask      */
#define GPDMA_C0CONTROL_SBSIZE_Pos            12                                                      /*!< GPDMA C0CONTROL: SBSIZE Position        */
#define GPDMA_C0CONTROL_SBSIZE_Msk            (0x07UL << GPDMA_C0CONTROL_SBSIZE_Pos)                  /*!< GPDMA C0CONTROL: SBSIZE Mask            */
#define GPDMA_C0CONTROL_DBSIZE_Pos            15                                                      /*!< GPDMA C0CONTROL: DBSIZE Position        */
#define GPDMA_C0CONTROL_DBSIZE_Msk            (0x07UL << GPDMA_C0CONTROL_DBSIZE_Pos)                  /*!< GPDMA C0CONTROL: DBSIZE Mask            */
#define GPDMA_C0CONTROL_SWIDTH_Pos            18                                                      /*!< GPDMA C0CONTROL: SWIDTH Position        */
#define GPDMA_C0CONTROL_SWIDTH_Msk            (0x07UL << GPDMA_C0CONTROL_SWIDTH_Pos)                  /*!< GPDMA C0CONTROL: SWIDTH Mask            */
#define GPDMA_C0CONTROL_DWIDTH_Pos            21                                                      /*!< GPDMA C0CONTROL: DWIDTH Position        */
#define GPDMA_C0CONTROL_DWIDTH_Msk            (0x07UL << GPDMA_C0CONTROL_DWIDTH_Pos)                  /*!< GPDMA C0CONTROL: DWIDTH Mask            */
#define GPDMA_C0CONTROL_S_Pos                 24                                                      /*!< GPDMA C0CONTROL: S Position             */
#define GPDMA_C0CONTROL_S_Msk                 (0x01UL << GPDMA_C0CONTROL_S_Pos)                       /*!< GPDMA C0CONTROL: S Mask                 */
#define GPDMA_C0CONTROL_D_Pos                 25                                                      /*!< GPDMA C0CONTROL: D Position             */
#define GPDMA_C0CONTROL_D_Msk                 (0x01UL << GPDMA_C0CONTROL_D_Pos)                       /*!< GPDMA C0CONTROL: D Mask                 */
#define GPDMA_C0CONTROL_SI_Pos                26                                                      /*!< GPDMA C0CONTROL: SI Position            */
#define GPDMA_C0CONTROL_SI_Msk                (0x01UL << GPDMA_C0CONTROL_SI_Pos)                      /*!< GPDMA C0CONTROL: SI Mask                */
#define GPDMA_C0CONTROL_DI_Pos                27                                                      /*!< GPDMA C0CONTROL: DI Position            */
#define GPDMA_C0CONTROL_DI_Msk                (0x01UL << GPDMA_C0CONTROL_DI_Pos)                      /*!< GPDMA C0CONTROL: DI Mask                */
#define GPDMA_C0CONTROL_PROT1_Pos             28                                                      /*!< GPDMA C0CONTROL: PROT1 Position         */
#define GPDMA_C0CONTROL_PROT1_Msk             (0x01UL << GPDMA_C0CONTROL_PROT1_Pos)                   /*!< GPDMA C0CONTROL: PROT1 Mask             */
#define GPDMA_C0CONTROL_PROT2_Pos             29                                                      /*!< GPDMA C0CONTROL: PROT2 Position         */
#define GPDMA_C0CONTROL_PROT2_Msk             (0x01UL << GPDMA_C0CONTROL_PROT2_Pos)                   /*!< GPDMA C0CONTROL: PROT2 Mask             */
#define GPDMA_C0CONTROL_PROT3_Pos             30                                                      /*!< GPDMA C0CONTROL: PROT3 Position         */
#define GPDMA_C0CONTROL_PROT3_Msk             (0x01UL << GPDMA_C0CONTROL_PROT3_Pos)                   /*!< GPDMA C0CONTROL: PROT3 Mask             */
#define GPDMA_C0CONTROL_I_Pos                 31                                                      /*!< GPDMA C0CONTROL: I Position             */
#define GPDMA_C0CONTROL_I_Msk                 (0x01UL << GPDMA_C0CONTROL_I_Pos)                       /*!< GPDMA C0CONTROL: I Mask                 */

/* -------------------------------  GPDMA_C0CONFIG  ------------------------------- */
#define GPDMA_C0CONFIG_E_Pos                  0                                                       /*!< GPDMA C0CONFIG: E Position              */
#define GPDMA_C0CONFIG_E_Msk                  (0x01UL << GPDMA_C0CONFIG_E_Pos)                        /*!< GPDMA C0CONFIG: E Mask                  */
#define GPDMA_C0CONFIG_SRCPERIPHERAL_Pos      1                                                       /*!< GPDMA C0CONFIG: SRCPERIPHERAL Position  */
#define GPDMA_C0CONFIG_SRCPERIPHERAL_Msk      (0x1fUL << GPDMA_C0CONFIG_SRCPERIPHERAL_Pos)            /*!< GPDMA C0CONFIG: SRCPERIPHERAL Mask      */
#define GPDMA_C0CONFIG_DESTPERIPHERAL_Pos     6                                                       /*!< GPDMA C0CONFIG: DESTPERIPHERAL Position */
#define GPDMA_C0CONFIG_DESTPERIPHERAL_Msk     (0x1fUL << GPDMA_C0CONFIG_DESTPERIPHERAL_Pos)           /*!< GPDMA C0CONFIG: DESTPERIPHERAL Mask     */
#define GPDMA_C0CONFIG_FLOWCNTRL_Pos          11                                                      /*!< GPDMA C0CONFIG: FLOWCNTRL Position      */
#define GPDMA_C0CONFIG_FLOWCNTRL_Msk          (0x07UL << GPDMA_C0CONFIG_FLOWCNTRL_Pos)                /*!< GPDMA C0CONFIG: FLOWCNTRL Mask          */
#define GPDMA_C0CONFIG_IE_Pos                 14                                                      /*!< GPDMA C0CONFIG: IE Position             */
#define GPDMA_C0CONFIG_IE_Msk                 (0x01UL << GPDMA_C0CONFIG_IE_Pos)                       /*!< GPDMA C0CONFIG: IE Mask                 */
#define GPDMA_C0CONFIG_ITC_Pos                15                                                      /*!< GPDMA C0CONFIG: ITC Position            */
#define GPDMA_C0CONFIG_ITC_Msk                (0x01UL << GPDMA_C0CONFIG_ITC_Pos)                      /*!< GPDMA C0CONFIG: ITC Mask                */
#define GPDMA_C0CONFIG_L_Pos                  16                                                      /*!< GPDMA C0CONFIG: L Position              */
#define GPDMA_C0CONFIG_L_Msk                  (0x01UL << GPDMA_C0CONFIG_L_Pos)                        /*!< GPDMA C0CONFIG: L Mask                  */
#define GPDMA_C0CONFIG_A_Pos                  17                                                      /*!< GPDMA C0CONFIG: A Position              */
#define GPDMA_C0CONFIG_A_Msk                  (0x01UL << GPDMA_C0CONFIG_A_Pos)                        /*!< GPDMA C0CONFIG: A Mask                  */
#define GPDMA_C0CONFIG_H_Pos                  18                                                      /*!< GPDMA C0CONFIG: H Position              */
#define GPDMA_C0CONFIG_H_Msk                  (0x01UL << GPDMA_C0CONFIG_H_Pos)                        /*!< GPDMA C0CONFIG: H Mask                  */

/* -------------------------------  GPDMA_C1SRCADDR  ------------------------------ */
#define GPDMA_C1SRCADDR_SRCADDR_Pos           0                                                       /*!< GPDMA C1SRCADDR: SRCADDR Position       */
#define GPDMA_C1SRCADDR_SRCADDR_Msk           (0xffffffffUL << GPDMA_C1SRCADDR_SRCADDR_Pos)           /*!< GPDMA C1SRCADDR: SRCADDR Mask           */

/* ------------------------------  GPDMA_C1DESTADDR  ------------------------------ */
#define GPDMA_C1DESTADDR_DESTADDR_Pos         0                                                       /*!< GPDMA C1DESTADDR: DESTADDR Position     */
#define GPDMA_C1DESTADDR_DESTADDR_Msk         (0xffffffffUL << GPDMA_C1DESTADDR_DESTADDR_Pos)         /*!< GPDMA C1DESTADDR: DESTADDR Mask         */

/* ---------------------------------  GPDMA_C1LLI  -------------------------------- */
#define GPDMA_C1LLI_LM_Pos                    0                                                       /*!< GPDMA C1LLI: LM Position                */
#define GPDMA_C1LLI_LM_Msk                    (0x01UL << GPDMA_C1LLI_LM_Pos)                          /*!< GPDMA C1LLI: LM Mask                    */
#define GPDMA_C1LLI_R_Pos                     1                                                       /*!< GPDMA C1LLI: R Position                 */
#define GPDMA_C1LLI_R_Msk                     (0x01UL << GPDMA_C1LLI_R_Pos)                           /*!< GPDMA C1LLI: R Mask                     */
#define GPDMA_C1LLI_LLI_Pos                   2                                                       /*!< GPDMA C1LLI: LLI Position               */
#define GPDMA_C1LLI_LLI_Msk                   (0x3fffffffUL << GPDMA_C1LLI_LLI_Pos)                   /*!< GPDMA C1LLI: LLI Mask                   */

/* -------------------------------  GPDMA_C1CONTROL  ------------------------------ */
#define GPDMA_C1CONTROL_TRANSFERSIZE_Pos      0                                                       /*!< GPDMA C1CONTROL: TRANSFERSIZE Position  */
#define GPDMA_C1CONTROL_TRANSFERSIZE_Msk      (0x00000fffUL << GPDMA_C1CONTROL_TRANSFERSIZE_Pos)      /*!< GPDMA C1CONTROL: TRANSFERSIZE Mask      */
#define GPDMA_C1CONTROL_SBSIZE_Pos            12                                                      /*!< GPDMA C1CONTROL: SBSIZE Position        */
#define GPDMA_C1CONTROL_SBSIZE_Msk            (0x07UL << GPDMA_C1CONTROL_SBSIZE_Pos)                  /*!< GPDMA C1CONTROL: SBSIZE Mask            */
#define GPDMA_C1CONTROL_DBSIZE_Pos            15                                                      /*!< GPDMA C1CONTROL: DBSIZE Position        */
#define GPDMA_C1CONTROL_DBSIZE_Msk            (0x07UL << GPDMA_C1CONTROL_DBSIZE_Pos)                  /*!< GPDMA C1CONTROL: DBSIZE Mask            */
#define GPDMA_C1CONTROL_SWIDTH_Pos            18                                                      /*!< GPDMA C1CONTROL: SWIDTH Position        */
#define GPDMA_C1CONTROL_SWIDTH_Msk            (0x07UL << GPDMA_C1CONTROL_SWIDTH_Pos)                  /*!< GPDMA C1CONTROL: SWIDTH Mask            */
#define GPDMA_C1CONTROL_DWIDTH_Pos            21                                                      /*!< GPDMA C1CONTROL: DWIDTH Position        */
#define GPDMA_C1CONTROL_DWIDTH_Msk            (0x07UL << GPDMA_C1CONTROL_DWIDTH_Pos)                  /*!< GPDMA C1CONTROL: DWIDTH Mask            */
#define GPDMA_C1CONTROL_S_Pos                 24                                                      /*!< GPDMA C1CONTROL: S Position             */
#define GPDMA_C1CONTROL_S_Msk                 (0x01UL << GPDMA_C1CONTROL_S_Pos)                       /*!< GPDMA C1CONTROL: S Mask                 */
#define GPDMA_C1CONTROL_D_Pos                 25                                                      /*!< GPDMA C1CONTROL: D Position             */
#define GPDMA_C1CONTROL_D_Msk                 (0x01UL << GPDMA_C1CONTROL_D_Pos)                       /*!< GPDMA C1CONTROL: D Mask                 */
#define GPDMA_C1CONTROL_SI_Pos                26                                                      /*!< GPDMA C1CONTROL: SI Position            */
#define GPDMA_C1CONTROL_SI_Msk                (0x01UL << GPDMA_C1CONTROL_SI_Pos)                      /*!< GPDMA C1CONTROL: SI Mask                */
#define GPDMA_C1CONTROL_DI_Pos                27                                                      /*!< GPDMA C1CONTROL: DI Position            */
#define GPDMA_C1CONTROL_DI_Msk                (0x01UL << GPDMA_C1CONTROL_DI_Pos)                      /*!< GPDMA C1CONTROL: DI Mask                */
#define GPDMA_C1CONTROL_PROT1_Pos             28                                                      /*!< GPDMA C1CONTROL: PROT1 Position         */
#define GPDMA_C1CONTROL_PROT1_Msk             (0x01UL << GPDMA_C1CONTROL_PROT1_Pos)                   /*!< GPDMA C1CONTROL: PROT1 Mask             */
#define GPDMA_C1CONTROL_PROT2_Pos             29                                                      /*!< GPDMA C1CONTROL: PROT2 Position         */
#define GPDMA_C1CONTROL_PROT2_Msk             (0x01UL << GPDMA_C1CONTROL_PROT2_Pos)                   /*!< GPDMA C1CONTROL: PROT2 Mask             */
#define GPDMA_C1CONTROL_PROT3_Pos             30                                                      /*!< GPDMA C1CONTROL: PROT3 Position         */
#define GPDMA_C1CONTROL_PROT3_Msk             (0x01UL << GPDMA_C1CONTROL_PROT3_Pos)                   /*!< GPDMA C1CONTROL: PROT3 Mask             */
#define GPDMA_C1CONTROL_I_Pos                 31                                                      /*!< GPDMA C1CONTROL: I Position             */
#define GPDMA_C1CONTROL_I_Msk                 (0x01UL << GPDMA_C1CONTROL_I_Pos)                       /*!< GPDMA C1CONTROL: I Mask                 */

/* -------------------------------  GPDMA_C1CONFIG  ------------------------------- */
#define GPDMA_C1CONFIG_E_Pos                  0                                                       /*!< GPDMA C1CONFIG: E Position              */
#define GPDMA_C1CONFIG_E_Msk                  (0x01UL << GPDMA_C1CONFIG_E_Pos)                        /*!< GPDMA C1CONFIG: E Mask                  */
#define GPDMA_C1CONFIG_SRCPERIPHERAL_Pos      1                                                       /*!< GPDMA C1CONFIG: SRCPERIPHERAL Position  */
#define GPDMA_C1CONFIG_SRCPERIPHERAL_Msk      (0x1fUL << GPDMA_C1CONFIG_SRCPERIPHERAL_Pos)            /*!< GPDMA C1CONFIG: SRCPERIPHERAL Mask      */
#define GPDMA_C1CONFIG_DESTPERIPHERAL_Pos     6                                                       /*!< GPDMA C1CONFIG: DESTPERIPHERAL Position */
#define GPDMA_C1CONFIG_DESTPERIPHERAL_Msk     (0x1fUL << GPDMA_C1CONFIG_DESTPERIPHERAL_Pos)           /*!< GPDMA C1CONFIG: DESTPERIPHERAL Mask     */
#define GPDMA_C1CONFIG_FLOWCNTRL_Pos          11                                                      /*!< GPDMA C1CONFIG: FLOWCNTRL Position      */
#define GPDMA_C1CONFIG_FLOWCNTRL_Msk          (0x07UL << GPDMA_C1CONFIG_FLOWCNTRL_Pos)                /*!< GPDMA C1CONFIG: FLOWCNTRL Mask          */
#define GPDMA_C1CONFIG_IE_Pos                 14                                                      /*!< GPDMA C1CONFIG: IE Position             */
#define GPDMA_C1CONFIG_IE_Msk                 (0x01UL << GPDMA_C1CONFIG_IE_Pos)                       /*!< GPDMA C1CONFIG: IE Mask                 */
#define GPDMA_C1CONFIG_ITC_Pos                15                                                      /*!< GPDMA C1CONFIG: ITC Position            */
#define GPDMA_C1CONFIG_ITC_Msk                (0x01UL << GPDMA_C1CONFIG_ITC_Pos)                      /*!< GPDMA C1CONFIG: ITC Mask                */
#define GPDMA_C1CONFIG_L_Pos                  16                                                      /*!< GPDMA C1CONFIG: L Position              */
#define GPDMA_C1CONFIG_L_Msk                  (0x01UL << GPDMA_C1CONFIG_L_Pos)                        /*!< GPDMA C1CONFIG: L Mask                  */
#define GPDMA_C1CONFIG_A_Pos                  17                                                      /*!< GPDMA C1CONFIG: A Position              */
#define GPDMA_C1CONFIG_A_Msk                  (0x01UL << GPDMA_C1CONFIG_A_Pos)                        /*!< GPDMA C1CONFIG: A Mask                  */
#define GPDMA_C1CONFIG_H_Pos                  18                                                      /*!< GPDMA C1CONFIG: H Position              */
#define GPDMA_C1CONFIG_H_Msk                  (0x01UL << GPDMA_C1CONFIG_H_Pos)                        /*!< GPDMA C1CONFIG: H Mask                  */

/* -------------------------------  GPDMA_C2SRCADDR  ------------------------------ */
#define GPDMA_C2SRCADDR_SRCADDR_Pos           0                                                       /*!< GPDMA C2SRCADDR: SRCADDR Position       */
#define GPDMA_C2SRCADDR_SRCADDR_Msk           (0xffffffffUL << GPDMA_C2SRCADDR_SRCADDR_Pos)           /*!< GPDMA C2SRCADDR: SRCADDR Mask           */

/* ------------------------------  GPDMA_C2DESTADDR  ------------------------------ */
#define GPDMA_C2DESTADDR_DESTADDR_Pos         0                                                       /*!< GPDMA C2DESTADDR: DESTADDR Position     */
#define GPDMA_C2DESTADDR_DESTADDR_Msk         (0xffffffffUL << GPDMA_C2DESTADDR_DESTADDR_Pos)         /*!< GPDMA C2DESTADDR: DESTADDR Mask         */

