MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  GPDMA_C2LLI  -------------------------------- */
#define GPDMA_C2LLI_LM_Pos                    0                                                       /*!< GPDMA C2LLI: LM Position                */
#define GPDMA_C2LLI_LM_Msk                    (0x01UL << GPDMA_C2LLI_LM_Pos)                          /*!< GPDMA C2LLI: LM Mask                    */
#define GPDMA_C2LLI_R_Pos                     1                                                       /*!< GPDMA C2LLI: R Position                 */
#define GPDMA_C2LLI_R_Msk                     (0x01UL << GPDMA_C2LLI_R_Pos)                           /*!< GPDMA C2LLI: R Mask                     */
#define GPDMA_C2LLI_LLI_Pos                   2                                                       /*!< GPDMA C2LLI: LLI Position               */
#define GPDMA_C2LLI_LLI_Msk                   (0x3fffffffUL << GPDMA_C2LLI_LLI_Pos)                   /*!< GPDMA C2LLI: LLI Mask                   */

/* -------------------------------  GPDMA_C2CONTROL  ------------------------------ */
#define GPDMA_C2CONTROL_TRANSFERSIZE_Pos      0                                                       /*!< GPDMA C2CONTROL: TRANSFERSIZE Position  */
#define GPDMA_C2CONTROL_TRANSFERSIZE_Msk      (0x00000fffUL << GPDMA_C2CONTROL_TRANSFERSIZE_Pos)      /*!< GPDMA C2CONTROL: TRANSFERSIZE Mask      */
#define GPDMA_C2CONTROL_SBSIZE_Pos            12                                                      /*!< GPDMA C2CONTROL: SBSIZE Position        */
#define GPDMA_C2CONTROL_SBSIZE_Msk            (0x07UL << GPDMA_C2CONTROL_SBSIZE_Pos)                  /*!< GPDMA C2CONTROL: SBSIZE Mask            */
#define GPDMA_C2CONTROL_DBSIZE_Pos            15                                                      /*!< GPDMA C2CONTROL: DBSIZE Position        */
#define GPDMA_C2CONTROL_DBSIZE_Msk            (0x07UL << GPDMA_C2CONTROL_DBSIZE_Pos)                  /*!< GPDMA C2CONTROL: DBSIZE Mask            */
#define GPDMA_C2CONTROL_SWIDTH_Pos            18                                                      /*!< GPDMA C2CONTROL: SWIDTH Position        */
#define GPDMA_C2CONTROL_SWIDTH_Msk            (0x07UL << GPDMA_C2CONTROL_SWIDTH_Pos)                  /*!< GPDMA C2CONTROL: SWIDTH Mask            */
#define GPDMA_C2CONTROL_DWIDTH_Pos            21                                                      /*!< GPDMA C2CONTROL: DWIDTH Position        */
#define GPDMA_C2CONTROL_DWIDTH_Msk            (0x07UL << GPDMA_C2CONTROL_DWIDTH_Pos)                  /*!< GPDMA C2CONTROL: DWIDTH Mask            */
#define GPDMA_C2CONTROL_S_Pos                 24                                                      /*!< GPDMA C2CONTROL: S Position             */
#define GPDMA_C2CONTROL_S_Msk                 (0x01UL << GPDMA_C2CONTROL_S_Pos)                       /*!< GPDMA C2CONTROL: S Mask                 */
#define GPDMA_C2CONTROL_D_Pos                 25                                                      /*!< GPDMA C2CONTROL: D Position             */
#define GPDMA_C2CONTROL_D_Msk                 (0x01UL << GPDMA_C2CONTROL_D_Pos)                       /*!< GPDMA C2CONTROL: D Mask                 */
#define GPDMA_C2CONTROL_SI_Pos                26                                                      /*!< GPDMA C2CONTROL: SI Position            */
#define GPDMA_C2CONTROL_SI_Msk                (0x01UL << GPDMA_C2CONTROL_SI_Pos)                      /*!< GPDMA C2CONTROL: SI Mask                */
#define GPDMA_C2CONTROL_DI_Pos                27                                                      /*!< GPDMA C2CONTROL: DI Position            */
#define GPDMA_C2CONTROL_DI_Msk                (0x01UL << GPDMA_C2CONTROL_DI_Pos)                      /*!< GPDMA C2CONTROL: DI Mask                */
#define GPDMA_C2CONTROL_PROT1_Pos             28                                                      /*!< GPDMA C2CONTROL: PROT1 Position         */
#define GPDMA_C2CONTROL_PROT1_Msk             (0x01UL << GPDMA_C2CONTROL_PROT1_Pos)                   /*!< GPDMA C2CONTROL: PROT1 Mask             */
#define GPDMA_C2CONTROL_PROT2_Pos             29                                                      /*!< GPDMA C2CONTROL: PROT2 Position         */
#define GPDMA_C2CONTROL_PROT2_Msk             (0x01UL << GPDMA_C2CONTROL_PROT2_Pos)                   /*!< GPDMA C2CONTROL: PROT2 Mask             */
#define GPDMA_C2CONTROL_PROT3_Pos             30                                                      /*!< GPDMA C2CONTROL: PROT3 Position         */
#define GPDMA_C2CONTROL_PROT3_Msk             (0x01UL << GPDMA_C2CONTROL_PROT3_Pos)                   /*!< GPDMA C2CONTROL: PROT3 Mask             */
#define GPDMA_C2CONTROL_I_Pos                 31                                                      /*!< GPDMA C2CONTROL: I Position             */
#define GPDMA_C2CONTROL_I_Msk                 (0x01UL << GPDMA_C2CONTROL_I_Pos)                       /*!< GPDMA C2CONTROL: I Mask                 */

/* -------------------------------  GPDMA_C2CONFIG  ------------------------------- */
#define GPDMA_C2CONFIG_E_Pos                  0                                                       /*!< GPDMA C2CONFIG: E Position              */
#define GPDMA_C2CONFIG_E_Msk                  (0x01UL << GPDMA_C2CONFIG_E_Pos)                        /*!< GPDMA C2CONFIG: E Mask                  */
#define GPDMA_C2CONFIG_SRCPERIPHERAL_Pos      1                                                       /*!< GPDMA C2CONFIG: SRCPERIPHERAL Position  */
#define GPDMA_C2CONFIG_SRCPERIPHERAL_Msk      (0x1fUL << GPDMA_C2CONFIG_SRCPERIPHERAL_Pos)            /*!< GPDMA C2CONFIG: SRCPERIPHERAL Mask      */
#define GPDMA_C2CONFIG_DESTPERIPHERAL_Pos     6                                                       /*!< GPDMA C2CONFIG: DESTPERIPHERAL Position */
#define GPDMA_C2CONFIG_DESTPERIPHERAL_Msk     (0x1fUL << GPDMA_C2CONFIG_DESTPERIPHERAL_Pos)           /*!< GPDMA C2CONFIG: DESTPERIPHERAL Mask     */
#define GPDMA_C2CONFIG_FLOWCNTRL_Pos          11                                                      /*!< GPDMA C2CONFIG: FLOWCNTRL Position      */
#define GPDMA_C2CONFIG_FLOWCNTRL_Msk          (0x07UL << GPDMA_C2CONFIG_FLOWCNTRL_Pos)                /*!< GPDMA C2CONFIG: FLOWCNTRL Mask          */
#define GPDMA_C2CONFIG_IE_Pos                 14                                                      /*!< GPDMA C2CONFIG: IE Position             */
#define GPDMA_C2CONFIG_IE_Msk                 (0x01UL << GPDMA_C2CONFIG_IE_Pos)                       /*!< GPDMA C2CONFIG: IE Mask                 */
#define GPDMA_C2CONFIG_ITC_Pos                15                                                      /*!< GPDMA C2CONFIG: ITC Position            */
#define GPDMA_C2CONFIG_ITC_Msk                (0x01UL << GPDMA_C2CONFIG_ITC_Pos)                      /*!< GPDMA C2CONFIG: ITC Mask                */
#define GPDMA_C2CONFIG_L_Pos                  16                                                      /*!< GPDMA C2CONFIG: L Position              */
#define GPDMA_C2CONFIG_L_Msk                  (0x01UL << GPDMA_C2CONFIG_L_Pos)                        /*!< GPDMA C2CONFIG: L Mask                  */
#define GPDMA_C2CONFIG_A_Pos                  17                                                      /*!< GPDMA C2CONFIG: A Position              */
#define GPDMA_C2CONFIG_A_Msk                  (0x01UL << GPDMA_C2CONFIG_A_Pos)                        /*!< GPDMA C2CONFIG: A Mask                  */
#define GPDMA_C2CONFIG_H_Pos                  18                                                      /*!< GPDMA C2CONFIG: H Position              */
#define GPDMA_C2CONFIG_H_Msk                  (0x01UL << GPDMA_C2CONFIG_H_Pos)                        /*!< GPDMA C2CONFIG: H Mask                  */

