MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -------------------------------  GPDMA_C3SRCADDR  ------------------------------ */
#define GPDMA_C3SRCADDR_SRCADDR_Pos           0                                                       /*!< GPDMA C3SRCADDR: SRCADDR Position       */
#define GPDMA_C3SRCADDR_SRCADDR_Msk           (0xffffffffUL << GPDMA_C3SRCADDR_SRCADDR_Pos)           /*!< GPDMA C3SRCADDR: SRCADDR Mask           */

/* ------------------------------  GPDMA_C3DESTADDR  ------------------------------ */
#define GPDMA_C3DESTADDR_DESTADDR_Pos         0                                                       /*!< GPDMA C3DESTADDR: DESTADDR Position     */
#define GPDMA_C3DESTADDR_DESTADDR_Msk         (0xffffffffUL << GPDMA_C3DESTADDR_DESTADDR_Pos)         /*!< GPDMA C3DESTADDR: DESTADDR Mask         */

/* ---------------------------------  GPDMA_C3LLI  -------------------------------- */
#define GPDMA_C3LLI_LM_Pos                    0                                                       /*!< GPDMA C3LLI: LM Position                */
#define GPDMA_C3LLI_LM_Msk                    (0x01UL << GPDMA_C3LLI_LM_Pos)                          /*!< GPDMA C3LLI: LM Mask                    */
#define GPDMA_C3LLI_R_Pos                     1                                                       /*!< GPDMA C3LLI: R Position                 */
#define GPDMA_C3LLI_R_Msk                     (0x01UL << GPDMA_C3LLI_R_Pos)                           /*!< GPDMA C3LLI: R Mask                     */
#define GPDMA_C3LLI_LLI_Pos                   2                                                       /*!< GPDMA C3LLI: LLI Position               */
#define GPDMA_C3LLI_LLI_Msk                   (0x3fffffffUL << GPDMA_C3LLI_LLI_Pos)                   /*!< GPDMA C3LLI: LLI Mask                   */

/* -------------------------------  GPDMA_C3CONTROL  ------------------------------ */
#define GPDMA_C3CONTROL_TRANSFERSIZE_Pos      0                                                       /*!< GPDMA C3CONTROL: TRANSFERSIZE Position  */
#define GPDMA_C3CONTROL_TRANSFERSIZE_Msk      (0x00000fffUL << GPDMA_C3CONTROL_TRANSFERSIZE_Pos)      /*!< GPDMA C3CONTROL: TRANSFERSIZE Mask      */
#define GPDMA_C3CONTROL_SBSIZE_Pos            12                                                      /*!< GPDMA C3CONTROL: SBSIZE Position        */
#define GPDMA_C3CONTROL_SBSIZE_Msk            (0x07UL << GPDMA_C3CONTROL_SBSIZE_Pos)                  /*!< GPDMA C3CONTROL: SBSIZE Mask            */
#define GPDMA_C3CONTROL_DBSIZE_Pos            15                                                      /*!< GPDMA C3CONTROL: DBSIZE Position        */
#define GPDMA_C3CONTROL_DBSIZE_Msk            (0x07UL << GPDMA_C3CONTROL_DBSIZE_Pos)                  /*!< GPDMA C3CONTROL: DBSIZE Mask            */
#define GPDMA_C3CONTROL_SWIDTH_Pos            18                                                      /*!< GPDMA C3CONTROL: SWIDTH Position        */
#define GPDMA_C3CONTROL_SWIDTH_Msk            (0x07UL << GPDMA_C3CONTROL_SWIDTH_Pos)                  /*!< GPDMA C3CONTROL: SWIDTH Mask            */
#define GPDMA_C3CONTROL_DWIDTH_Pos            21                                                      /*!< GPDMA C3CONTROL: DWIDTH Position        */
#define GPDMA_C3CONTROL_DWIDTH_Msk            (0x07UL << GPDMA_C3CONTROL_DWIDTH_Pos)                  /*!< GPDMA C3CONTROL: DWIDTH Mask            */
#define GPDMA_C3CONTROL_S_Pos                 24                                                      /*!< GPDMA C3CONTROL: S Position             */
#define GPDMA_C3CONTROL_S_Msk                 (0x01UL << GPDMA_C3CONTROL_S_Pos)                       /*!< GPDMA C3CONTROL: S Mask                 */
#define GPDMA_C3CONTROL_D_Pos                 25                                                      /*!< GPDMA C3CONTROL: D Position             */
#define GPDMA_C3CONTROL_D_Msk                 (0x01UL << GPDMA_C3CONTROL_D_Pos)                       /*!< GPDMA C3CONTROL: D Mask                 */
#define GPDMA_C3CONTROL_SI_Pos                26                                                      /*!< GPDMA C3CONTROL: SI Position            */
#define GPDMA_C3CONTROL_SI_Msk                (0x01UL << GPDMA_C3CONTROL_SI_Pos)                      /*!< GPDMA C3CONTROL: SI Mask                */
#define GPDMA_C3CONTROL_DI_Pos                27                                                      /*!< GPDMA C3CONTROL: DI Position            */
#define GPDMA_C3CONTROL_DI_Msk                (0x01UL << GPDMA_C3CONTROL_DI_Pos)                      /*!< GPDMA C3CONTROL: DI Mask                */
#define GPDMA_C3CONTROL_PROT1_Pos             28                                                      /*!< GPDMA C3CONTROL: PROT1 Position         */
#define GPDMA_C3CONTROL_PROT1_Msk             (0x01UL << GPDMA_C3CONTROL_PROT1_Pos)                   /*!< GPDMA C3CONTROL: PROT1 Mask             */
#define GPDMA_C3CONTROL_PROT2_Pos             29                                                      /*!< GPDMA C3CONTROL: PROT2 Position         */
#define GPDMA_C3CONTROL_PROT2_Msk             (0x01UL << GPDMA_C3CONTROL_PROT2_Pos)                   /*!< GPDMA C3CONTROL: PROT2 Mask             */
#define GPDMA_C3CONTROL_PROT3_Pos             30                                                      /*!< GPDMA C3CONTROL: PROT3 Position         */
#define GPDMA_C3CONTROL_PROT3_Msk             (0x01UL << GPDMA_C3CONTROL_PROT3_Pos)                   /*!< GPDMA C3CONTROL: PROT3 Mask             */
#define GPDMA_C3CONTROL_I_Pos                 31                                                      /*!< GPDMA C3CONTROL: I Position             */
#define GPDMA_C3CONTROL_I_Msk                 (0x01UL << GPDMA_C3CONTROL_I_Pos)                       /*!< GPDMA C3CONTROL: I Mask                 */

/* -------------------------------  GPDMA_C3CONFIG  ------------------------------- */
#define GPDMA_C3CONFIG_E_Pos                  0                                                       /*!< GPDMA C3CONFIG: E Position              */
#define GPDMA_C3CONFIG_E_Msk                  (0x01UL << GPDMA_C3CONFIG_E_Pos)                        /*!< GPDMA C3CONFIG: E Mask                  */
#define GPDMA_C3CONFIG_SRCPERIPHERAL_Pos      1                                                       /*!< GPDMA C3CONFIG: SRCPERIPHERAL Position  */
#define GPDMA_C3CONFIG_SRCPERIPHERAL_Msk      (0x1fUL << GPDMA_C3CONFIG_SRCPERIPHERAL_Pos)            /*!< GPDMA C3CONFIG: SRCPERIPHERAL Mask      */
#define GPDMA_C3CONFIG_DESTPERIPHERAL_Pos     6                                                       /*!< GPDMA C3CONFIG: DESTPERIPHERAL Position */
#define GPDMA_C3CONFIG_DESTPERIPHERAL_Msk     (0x1fUL << GPDMA_C3CONFIG_DESTPERIPHERAL_Pos)           /*!< GPDMA C3CONFIG: DESTPERIPHERAL Mask     */
#define GPDMA_C3CONFIG_FLOWCNTRL_Pos          11                                                      /*!< GPDMA C3CONFIG: FLOWCNTRL Position      */
#define GPDMA_C3CONFIG_FLOWCNTRL_Msk          (0x07UL << GPDMA_C3CONFIG_FLOWCNTRL_Pos)                /*!< GPDMA C3CONFIG: FLOWCNTRL Mask          */
#define GPDMA_C3CONFIG_IE_Pos                 14                                                      /*!< GPDMA C3CONFIG: IE Position             */
#define GPDMA_C3CONFIG_IE_Msk                 (0x01UL << GPDMA_C3CONFIG_IE_Pos)                       /*!< GPDMA C3CONFIG: IE Mask                 */
#define GPDMA_C3CONFIG_ITC_Pos                15                                                      /*!< GPDMA C3CONFIG: ITC Position            */
#define GPDMA_C3CONFIG_ITC_Msk                (0x01UL << GPDMA_C3CONFIG_ITC_Pos)                      /*!< GPDMA C3CONFIG: ITC Mask                */
#define GPDMA_C3CONFIG_L_Pos                  16                                                      /*!< GPDMA C3CONFIG: L Position              */
#define GPDMA_C3CONFIG_L_Msk                  (0x01UL << GPDMA_C3CONFIG_L_Pos)                        /*!< GPDMA C3CONFIG: L Mask                  */
#define GPDMA_C3CONFIG_A_Pos                  17                                                      /*!< GPDMA C3CONFIG: A Position              */
#define GPDMA_C3CONFIG_A_Msk                  (0x01UL << GPDMA_C3CONFIG_A_Pos)                        /*!< GPDMA C3CONFIG: A Mask                  */
#define GPDMA_C3CONFIG_H_Pos                  18                                                      /*!< GPDMA C3CONFIG: H Position              */
#define GPDMA_C3CONFIG_H_Msk                  (0x01UL << GPDMA_C3CONFIG_H_Pos)                        /*!< GPDMA C3CONFIG: H Mask                  */

