MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -------------------------------  GPDMA_C4SRCADDR  ------------------------------ */
#define GPDMA_C4SRCADDR_SRCADDR_Pos           0                                                       /*!< GPDMA C4SRCADDR: SRCADDR Position       */
#define GPDMA_C4SRCADDR_SRCADDR_Msk           (0xffffffffUL << GPDMA_C4SRCADDR_SRCADDR_Pos)           /*!< GPDMA C4SRCADDR: SRCADDR Mask           */

/* ------------------------------  GPDMA_C4DESTADDR  ------------------------------ */
#define GPDMA_C4DESTADDR_DESTADDR_Pos         0                                                       /*!< GPDMA C4DESTADDR: DESTADDR Position     */
#define GPDMA_C4DESTADDR_DESTADDR_Msk         (0xffffffffUL << GPDMA_C4DESTADDR_DESTADDR_Pos)         /*!< GPDMA C4DESTADDR: DESTADDR Mask         */

/* ---------------------------------  GPDMA_C4LLI  -------------------------------- */
#define GPDMA_C4LLI_LM_Pos                    0                                                       /*!< GPDMA C4LLI: LM Position                */
#define GPDMA_C4LLI_LM_Msk                    (0x01UL << GPDMA_C4LLI_LM_Pos)                          /*!< GPDMA C4LLI: LM Mask                    */
#define GPDMA_C4LLI_R_Pos                     1                                                       /*!< GPDMA C4LLI: R Position                 */
#define GPDMA_C4LLI_R_Msk                     (0x01UL << GPDMA_C4LLI_R_Pos)                           /*!< GPDMA C4LLI: R Mask                     */
#define GPDMA_C4LLI_LLI_Pos                   2                                                       /*!< GPDMA C4LLI: LLI Position               */
#define GPDMA_C4LLI_LLI_Msk                   (0x3fffffffUL << GPDMA_C4LLI_LLI_Pos)                   /*!< GPDMA C4LLI: LLI Mask                   */

/* -------------------------------  GPDMA_C4CONTROL  ------------------------------ */
#define GPDMA_C4CONTROL_TRANSFERSIZE_Pos      0                                                       /*!< GPDMA C4CONTROL: TRANSFERSIZE Position  */
#define GPDMA_C4CONTROL_TRANSFERSIZE_Msk      (0x00000fffUL << GPDMA_C4CONTROL_TRANSFERSIZE_Pos)      /*!< GPDMA C4CONTROL: TRANSFERSIZE Mask      */
#define GPDMA_C4CONTROL_SBSIZE_Pos            12                                                      /*!< GPDMA C4CONTROL: SBSIZE Position        */
#define GPDMA_C4CONTROL_SBSIZE_Msk            (0x07UL << GPDMA_C4CONTROL_SBSIZE_Pos)                  /*!< GPDMA C4CONTROL: SBSIZE Mask            */
#define GPDMA_C4CONTROL_DBSIZE_Pos            15                                                      /*!< GPDMA C4CONTROL: DBSIZE Position        */
#define GPDMA_C4CONTROL_DBSIZE_Msk            (0x07UL << GPDMA_C4CONTROL_DBSIZE_Pos)                  /*!< GPDMA C4CONTROL: DBSIZE Mask            */
#define GPDMA_C4CONTROL_SWIDTH_Pos            18                                                      /*!< GPDMA C4CONTROL: SWIDTH Position        */
#define GPDMA_C4CONTROL_SWIDTH_Msk            (0x07UL << GPDMA_C4CONTROL_SWIDTH_Pos)                  /*!< GPDMA C4CONTROL: SWIDTH Mask            */
#define GPDMA_C4CONTROL_DWIDTH_Pos            21                                                      /*!< GPDMA C4CONTROL: DWIDTH Position        */
#define GPDMA_C4CONTROL_DWIDTH_Msk            (0x07UL << GPDMA_C4CONTROL_DWIDTH_Pos)                  /*!< GPDMA C4CONTROL: DWIDTH Mask            */
#define GPDMA_C4CONTROL_S_Pos                 24                                                      /*!< GPDMA C4CONTROL: S Position             */
#define GPDMA_C4CONTROL_S_Msk                 (0x01UL << GPDMA_C4CONTROL_S_Pos)                       /*!< GPDMA C4CONTROL: S Mask                 */
#define GPDMA_C4CONTROL_D_Pos                 25                                                      /*!< GPDMA C4CONTROL: D Position             */
#define GPDMA_C4CONTROL_D_Msk                 (0x01UL << GPDMA_C4CONTROL_D_Pos)                       /*!< GPDMA C4CONTROL: D Mask                 */
#define GPDMA_C4CONTROL_SI_Pos                26                                                      /*!< GPDMA C4CONTROL: SI Position            */
#define GPDMA_C4CONTROL_SI_Msk                (0x01UL << GPDMA_C4CONTROL_SI_Pos)                      /*!< GPDMA C4CONTROL: SI Mask                */
#define GPDMA_C4CONTROL_DI_Pos                27                                                      /*!< GPDMA C4CONTROL: DI Position            */
#define GPDMA_C4CONTROL_DI_Msk                (0x01UL << GPDMA_C4CONTROL_DI_Pos)                      /*!< GPDMA C4CONTROL: DI Mask                */
#define GPDMA_C4CONTROL_PROT1_Pos             28                                                      /*!< GPDMA C4CONTROL: PROT1 Position         */
#define GPDMA_C4CONTROL_PROT1_Msk             (0x01UL << GPDMA_C4CONTROL_PROT1_Pos)                   /*!< GPDMA C4CONTROL: PROT1 Mask             */
#define GPDMA_C4CONTROL_PROT2_Pos             29                                                      /*!< GPDMA C4CONTROL: PROT2 Position         */
#define GPDMA_C4CONTROL_PROT2_Msk             (0x01UL << GPDMA_C4CONTROL_PROT2_Pos)                   /*!< GPDMA C4CONTROL: PROT2 Mask             */
#define GPDMA_C4CONTROL_PROT3_Pos             30                                                      /*!< GPDMA C4CONTROL: PROT3 Position         */
#define GPDMA_C4CONTROL_PROT3_Msk             (0x01UL << GPDMA_C4CONTROL_PROT3_Pos)                   /*!< GPDMA C4CONTROL: PROT3 Mask             */
#define GPDMA_C4CONTROL_I_Pos                 31                                                      /*!< GPDMA C4CONTROL: I Position             */
#define GPDMA_C4CONTROL_I_Msk                 (0x01UL << GPDMA_C4CONTROL_I_Pos)                       /*!< GPDMA C4CONTROL: I Mask                 */

/* -------------------------------  GPDMA_C4CONFIG  ------------------------------- */
#define GPDMA_C4CONFIG_E_Pos                  0                                                       /*!< GPDMA C4CONFIG: E Position              */
#define GPDMA_C4CONFIG_E_Msk                  (0x01UL << GPDMA_C4CONFIG_E_Pos)                        /*!< GPDMA C4CONFIG: E Mask                  */
#define GPDMA_C4CONFIG_SRCPERIPHERAL_Pos      1                                                       /*!< GPDMA C4CONFIG: SRCPERIPHERAL Position  */
#define GPDMA_C4CONFIG_SRCPERIPHERAL_Msk      (0x1fUL << GPDMA_C4CONFIG_SRCPERIPHERAL_Pos)            /*!< GPDMA C4CONFIG: SRCPERIPHERAL Mask      */
#define GPDMA_C4CONFIG_DESTPERIPHERAL_Pos     6                                                       /*!< GPDMA C4CONFIG: DESTPERIPHERAL Position */
#define GPDMA_C4CONFIG_DESTPERIPHERAL_Msk     (0x1fUL << GPDMA_C4CONFIG_DESTPERIPHERAL_Pos)           /*!< GPDMA C4CONFIG: DESTPERIPHERAL Mask     */
#define GPDMA_C4CONFIG_FLOWCNTRL_Pos          11                                                      /*!< GPDMA C4CONFIG: FLOWCNTRL Position      */
#define GPDMA_C4CONFIG_FLOWCNTRL_Msk          (0x07UL << GPDMA_C4CONFIG_FLOWCNTRL_Pos)                /*!< GPDMA C4CONFIG: FLOWCNTRL Mask          */
#define GPDMA_C4CONFIG_IE_Pos                 14                                                      /*!< GPDMA C4CONFIG: IE Position             */
#define GPDMA_C4CONFIG_IE_Msk                 (0x01UL << GPDMA_C4CONFIG_IE_Pos)                       /*!< GPDMA C4CONFIG: IE Mask                 */
#define GPDMA_C4CONFIG_ITC_Pos                15                                                      /*!< GPDMA C4CONFIG: ITC Position            */
#define GPDMA_C4CONFIG_ITC_Msk                (0x01UL << GPDMA_C4CONFIG_ITC_Pos)                      /*!< GPDMA C4CONFIG: ITC Mask                */
#define GPDMA_C4CONFIG_L_Pos                  16                                                      /*!< GPDMA C4CONFIG: L Position              */
#define GPDMA_C4CONFIG_L_Msk                  (0x01UL << GPDMA_C4CONFIG_L_Pos)                        /*!< GPDMA C4CONFIG: L Mask                  */
#define GPDMA_C4CONFIG_A_Pos                  17                                                      /*!< GPDMA C4CONFIG: A Position              */
#define GPDMA_C4CONFIG_A_Msk                  (0x01UL << GPDMA_C4CONFIG_A_Pos)                        /*!< GPDMA C4CONFIG: A Mask                  */
#define GPDMA_C4CONFIG_H_Pos                  18                                                      /*!< GPDMA C4CONFIG: H Position              */
#define GPDMA_C4CONFIG_H_Msk                  (0x01UL << GPDMA_C4CONFIG_H_Pos)                        /*!< GPDMA C4CONFIG: H Mask                  */

/* -------------------------------  GPDMA_C5SRCADDR  ------------------------------ */
#define GPDMA_C5SRCADDR_SRCADDR_Pos           0                                                       /*!< GPDMA C5SRCADDR: SRCADDR Position       */
#define GPDMA_C5SRCADDR_SRCADDR_Msk           (0xffffffffUL << GPDMA_C5SRCADDR_SRCADDR_Pos)           /*!< GPDMA C5SRCADDR: SRCADDR Mask           */

/* ------------------------------  GPDMA_C5DESTADDR  ------------------------------ */
#define GPDMA_C5DESTADDR_DESTADDR_Pos         0                                                       /*!< GPDMA C5DESTADDR: DESTADDR Position     */
#define GPDMA_C5DESTADDR_DESTADDR_Msk         (0xffffffffUL << GPDMA_C5DESTADDR_DESTADDR_Pos)         /*!< GPDMA C5DESTADDR: DESTADDR Mask         */

/* ---------------------------------  GPDMA_C5LLI  -------------------------------- */
#define GPDMA_C5LLI_LM_Pos                    0                                                       /*!< GPDMA C5LLI: LM Position                */
#define GPDMA_C5LLI_LM_Msk                    (0x01UL << GPDMA_C5LLI_LM_Pos)                          /*!< GPDMA C5LLI: LM Mask                    */
#define GPDMA_C5LLI_R_Pos                     1                                                       /*!< GPDMA C5LLI: R Position                 */
#define GPDMA_C5LLI_R_Msk                     (0x01UL << GPDMA_C5LLI_R_Pos)                           /*!< GPDMA C5LLI: R Mask                     */
#define GPDMA_C5LLI_LLI_Pos                   2                                                       /*!< GPDMA C5LLI: LLI Position               */
#define GPDMA_C5LLI_LLI_Msk                   (0x3fffffffUL << GPDMA_C5LLI_LLI_Pos)                   /*!< GPDMA C5LLI: LLI Mask                   */

