MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ================================================================================ */
/* ================         struct 'SPIFI' Position & Mask         ================ */
/* ================================================================================ */


/* ---------------------------------  SPIFI_CTRL  --------------------------------- */
#define SPIFI_CTRL_TIMEOUT_Pos                0                                                       /*!< SPIFI CTRL: TIMEOUT Position            */
#define SPIFI_CTRL_TIMEOUT_Msk                (0x0000ffffUL << SPIFI_CTRL_TIMEOUT_Pos)                /*!< SPIFI CTRL: TIMEOUT Mask                */
#define SPIFI_CTRL_CSHIGH_Pos                 16                                                      /*!< SPIFI CTRL: CSHIGH Position             */
#define SPIFI_CTRL_CSHIGH_Msk                 (0x0fUL << SPIFI_CTRL_CSHIGH_Pos)                       /*!< SPIFI CTRL: CSHIGH Mask                 */
#define SPIFI_CTRL_D_PRFTCH_DIS_Pos           21                                                      /*!< SPIFI CTRL: D_PRFTCH_DIS Position       */
#define SPIFI_CTRL_D_PRFTCH_DIS_Msk           (0x01UL << SPIFI_CTRL_D_PRFTCH_DIS_Pos)                 /*!< SPIFI CTRL: D_PRFTCH_DIS Mask           */
#define SPIFI_CTRL_INTEN_Pos                  22                                                      /*!< SPIFI CTRL: INTEN Position              */
#define SPIFI_CTRL_INTEN_Msk                  (0x01UL << SPIFI_CTRL_INTEN_Pos)                        /*!< SPIFI CTRL: INTEN Mask                  */
#define SPIFI_CTRL_MODE3_Pos                  23                                                      /*!< SPIFI CTRL: MODE3 Position              */
#define SPIFI_CTRL_MODE3_Msk                  (0x01UL << SPIFI_CTRL_MODE3_Pos)                        /*!< SPIFI CTRL: MODE3 Mask                  */
#define SPIFI_CTRL_PRFTCH_DIS_Pos             27                                                      /*!< SPIFI CTRL: PRFTCH_DIS Position         */
#define SPIFI_CTRL_PRFTCH_DIS_Msk             (0x01UL << SPIFI_CTRL_PRFTCH_DIS_Pos)                   /*!< SPIFI CTRL: PRFTCH_DIS Mask             */
#define SPIFI_CTRL_DUAL_Pos                   28                                                      /*!< SPIFI CTRL: DUAL Position               */
#define SPIFI_CTRL_DUAL_Msk                   (0x01UL << SPIFI_CTRL_DUAL_Pos)                         /*!< SPIFI CTRL: DUAL Mask                   */
#define SPIFI_CTRL_RFCLK_Pos                  29                                                      /*!< SPIFI CTRL: RFCLK Position              */
#define SPIFI_CTRL_RFCLK_Msk                  (0x01UL << SPIFI_CTRL_RFCLK_Pos)                        /*!< SPIFI CTRL: RFCLK Mask                  */
#define SPIFI_CTRL_FBCLK_Pos                  30                                                      /*!< SPIFI CTRL: FBCLK Position              */
#define SPIFI_CTRL_FBCLK_Msk                  (0x01UL << SPIFI_CTRL_FBCLK_Pos)                        /*!< SPIFI CTRL: FBCLK Mask                  */
#define SPIFI_CTRL_DMAEN_Pos                  31                                                      /*!< SPIFI CTRL: DMAEN Position              */
#define SPIFI_CTRL_DMAEN_Msk                  (0x01UL << SPIFI_CTRL_DMAEN_Pos)                        /*!< SPIFI CTRL: DMAEN Mask                  */

/* ----------------------------------  SPIFI_CMD  --------------------------------- */
#define SPIFI_CMD_DATALEN_Pos                 0                                                       /*!< SPIFI CMD: DATALEN Position             */
#define SPIFI_CMD_DATALEN_Msk                 (0x00003fffUL << SPIFI_CMD_DATALEN_Pos)                 /*!< SPIFI CMD: DATALEN Mask                 */
#define SPIFI_CMD_POLL_Pos                    14                                                      /*!< SPIFI CMD: POLL Position                */
#define SPIFI_CMD_POLL_Msk                    (0x01UL << SPIFI_CMD_POLL_Pos)                          /*!< SPIFI CMD: POLL Mask                    */
#define SPIFI_CMD_DOUT_Pos                    15                                                      /*!< SPIFI CMD: DOUT Position                */
#define SPIFI_CMD_DOUT_Msk                    (0x01UL << SPIFI_CMD_DOUT_Pos)                          /*!< SPIFI CMD: DOUT Mask                    */
#define SPIFI_CMD_INTLEN_Pos                  16                                                      /*!< SPIFI CMD: INTLEN Position              */
#define SPIFI_CMD_INTLEN_Msk                  (0x07UL << SPIFI_CMD_INTLEN_Pos)                        /*!< SPIFI CMD: INTLEN Mask                  */
#define SPIFI_CMD_FIELDFORM_Pos               19                                                      /*!< SPIFI CMD: FIELDFORM Position           */
#define SPIFI_CMD_FIELDFORM_Msk               (0x03UL << SPIFI_CMD_FIELDFORM_Pos)                     /*!< SPIFI CMD: FIELDFORM Mask               */
#define SPIFI_CMD_FRAMEFORM_Pos               21                                                      /*!< SPIFI CMD: FRAMEFORM Position           */
#define SPIFI_CMD_FRAMEFORM_Msk               (0x07UL << SPIFI_CMD_FRAMEFORM_Pos)                     /*!< SPIFI CMD: FRAMEFORM Mask               */
#define SPIFI_CMD_OPCODE_Pos                  24                                                      /*!< SPIFI CMD: OPCODE Position              */
#define SPIFI_CMD_OPCODE_Msk                  (0x000000ffUL << SPIFI_CMD_OPCODE_Pos)                  /*!< SPIFI CMD: OPCODE Mask                  */

/* ---------------------------------  SPIFI_ADDR  --------------------------------- */
#define SPIFI_ADDR_ADDRESS_Pos                0                                                       /*!< SPIFI ADDR: ADDRESS Position            */
#define SPIFI_ADDR_ADDRESS_Msk                (0xffffffffUL << SPIFI_ADDR_ADDRESS_Pos)                /*!< SPIFI ADDR: ADDRESS Mask                */

/* ---------------------------------  SPIFI_IDATA  -------------------------------- */
#define SPIFI_IDATA_IDATA_Pos                 0                                                       /*!< SPIFI IDATA: IDATA Position             */
#define SPIFI_IDATA_IDATA_Msk                 (0xffffffffUL << SPIFI_IDATA_IDATA_Pos)                 /*!< SPIFI IDATA: IDATA Mask                 */

/* --------------------------------  SPIFI_CLIMIT  -------------------------------- */
#define SPIFI_CLIMIT_CLIMIT_Pos               0                                                       /*!< SPIFI CLIMIT: CLIMIT Position           */
#define SPIFI_CLIMIT_CLIMIT_Msk               (0xffffffffUL << SPIFI_CLIMIT_CLIMIT_Pos)               /*!< SPIFI CLIMIT: CLIMIT Mask               */

/* ---------------------------------  SPIFI_DATA  --------------------------------- */
#define SPIFI_DATA_DATA_Pos                   0                                                       /*!< SPIFI DATA: DATA Position               */
#define SPIFI_DATA_DATA_Msk                   (0xffffffffUL << SPIFI_DATA_DATA_Pos)                   /*!< SPIFI DATA: DATA Mask                   */

/* ---------------------------------  SPIFI_MCMD  --------------------------------- */
#define SPIFI_MCMD_POLL_Pos                   14                                                      /*!< SPIFI MCMD: POLL Position               */
#define SPIFI_MCMD_POLL_Msk                   (0x01UL << SPIFI_MCMD_POLL_Pos)                         /*!< SPIFI MCMD: POLL Mask                   */
#define SPIFI_MCMD_DOUT_Pos                   15                                                      /*!< SPIFI MCMD: DOUT Position               */
#define SPIFI_MCMD_DOUT_Msk                   (0x01UL << SPIFI_MCMD_DOUT_Pos)                         /*!< SPIFI MCMD: DOUT Mask                   */
#define SPIFI_MCMD_INTLEN_Pos                 16                                                      /*!< SPIFI MCMD: INTLEN Position             */
#define SPIFI_MCMD_INTLEN_Msk                 (0x07UL << SPIFI_MCMD_INTLEN_Pos)                       /*!< SPIFI MCMD: INTLEN Mask                 */
#define SPIFI_MCMD_FIELDFORM_Pos              19                                                      /*!< SPIFI MCMD: FIELDFORM Position          */
#define SPIFI_MCMD_FIELDFORM_Msk              (0x03UL << SPIFI_MCMD_FIELDFORM_Pos)                    /*!< SPIFI MCMD: FIELDFORM Mask              */
#define SPIFI_MCMD_FRAMEFORM_Pos              21                                                      /*!< SPIFI MCMD: FRAMEFORM Position          */
#define SPIFI_MCMD_FRAMEFORM_Msk              (0x07UL << SPIFI_MCMD_FRAMEFORM_Pos)                    /*!< SPIFI MCMD: FRAMEFORM Mask              */
#define SPIFI_MCMD_OPCODE_Pos                 24                                                      /*!< SPIFI MCMD: OPCODE Position             */
#define SPIFI_MCMD_OPCODE_Msk                 (0x000000ffUL << SPIFI_MCMD_OPCODE_Pos)                 /*!< SPIFI MCMD: OPCODE Mask                 */

