MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  SDMMC_RESP0  -------------------------------- */
#define SDMMC_RESP0_RESPONSE0_Pos             0                                                       /*!< SDMMC RESP0: RESPONSE0 Position         */
#define SDMMC_RESP0_RESPONSE0_Msk             (0xffffffffUL << SDMMC_RESP0_RESPONSE0_Pos)             /*!< SDMMC RESP0: RESPONSE0 Mask             */

/* ---------------------------------  SDMMC_RESP1  -------------------------------- */
#define SDMMC_RESP1_RESPONSE1_Pos             0                                                       /*!< SDMMC RESP1: RESPONSE1 Position         */
#define SDMMC_RESP1_RESPONSE1_Msk             (0xffffffffUL << SDMMC_RESP1_RESPONSE1_Pos)             /*!< SDMMC RESP1: RESPONSE1 Mask             */

/* ---------------------------------  SDMMC_RESP2  -------------------------------- */
#define SDMMC_RESP2_RESPONSE2_Pos             0                                                       /*!< SDMMC RESP2: RESPONSE2 Position         */
#define SDMMC_RESP2_RESPONSE2_Msk             (0xffffffffUL << SDMMC_RESP2_RESPONSE2_Pos)             /*!< SDMMC RESP2: RESPONSE2 Mask             */

/* ---------------------------------  SDMMC_RESP3  -------------------------------- */
#define SDMMC_RESP3_RESPONSE3_Pos             0                                                       /*!< SDMMC RESP3: RESPONSE3 Position         */
#define SDMMC_RESP3_RESPONSE3_Msk             (0xffffffffUL << SDMMC_RESP3_RESPONSE3_Pos)             /*!< SDMMC RESP3: RESPONSE3 Mask             */

/* --------------------------------  SDMMC_MINTSTS  ------------------------------- */
#define SDMMC_MINTSTS_CDET_Pos                0                                                       /*!< SDMMC MINTSTS: CDET Position            */
#define SDMMC_MINTSTS_CDET_Msk                (0x01UL << SDMMC_MINTSTS_CDET_Pos)                      /*!< SDMMC MINTSTS: CDET Mask                */
#define SDMMC_MINTSTS_RE_Pos                  1                                                       /*!< SDMMC MINTSTS: RE Position              */
#define SDMMC_MINTSTS_RE_Msk                  (0x01UL << SDMMC_MINTSTS_RE_Pos)                        /*!< SDMMC MINTSTS: RE Mask                  */
#define SDMMC_MINTSTS_CDONE_Pos               2                                                       /*!< SDMMC MINTSTS: CDONE Position           */
#define SDMMC_MINTSTS_CDONE_Msk               (0x01UL << SDMMC_MINTSTS_CDONE_Pos)                     /*!< SDMMC MINTSTS: CDONE Mask               */
#define SDMMC_MINTSTS_DTO_Pos                 3                                                       /*!< SDMMC MINTSTS: DTO Position             */
#define SDMMC_MINTSTS_DTO_Msk                 (0x01UL << SDMMC_MINTSTS_DTO_Pos)                       /*!< SDMMC MINTSTS: DTO Mask                 */
#define SDMMC_MINTSTS_TXDR_Pos                4                                                       /*!< SDMMC MINTSTS: TXDR Position            */
#define SDMMC_MINTSTS_TXDR_Msk                (0x01UL << SDMMC_MINTSTS_TXDR_Pos)                      /*!< SDMMC MINTSTS: TXDR Mask                */
#define SDMMC_MINTSTS_RXDR_Pos                5                                                       /*!< SDMMC MINTSTS: RXDR Position            */
#define SDMMC_MINTSTS_RXDR_Msk                (0x01UL << SDMMC_MINTSTS_RXDR_Pos)                      /*!< SDMMC MINTSTS: RXDR Mask                */
#define SDMMC_MINTSTS_RCRC_Pos                6                                                       /*!< SDMMC MINTSTS: RCRC Position            */
#define SDMMC_MINTSTS_RCRC_Msk                (0x01UL << SDMMC_MINTSTS_RCRC_Pos)                      /*!< SDMMC MINTSTS: RCRC Mask                */
#define SDMMC_MINTSTS_DCRC_Pos                7                                                       /*!< SDMMC MINTSTS: DCRC Position            */
#define SDMMC_MINTSTS_DCRC_Msk                (0x01UL << SDMMC_MINTSTS_DCRC_Pos)                      /*!< SDMMC MINTSTS: DCRC Mask                */
#define SDMMC_MINTSTS_RTO_Pos                 8                                                       /*!< SDMMC MINTSTS: RTO Position             */
#define SDMMC_MINTSTS_RTO_Msk                 (0x01UL << SDMMC_MINTSTS_RTO_Pos)                       /*!< SDMMC MINTSTS: RTO Mask                 */
#define SDMMC_MINTSTS_DRTO_Pos                9                                                       /*!< SDMMC MINTSTS: DRTO Position            */
#define SDMMC_MINTSTS_DRTO_Msk                (0x01UL << SDMMC_MINTSTS_DRTO_Pos)                      /*!< SDMMC MINTSTS: DRTO Mask                */
#define SDMMC_MINTSTS_HTO_Pos                 10                                                      /*!< SDMMC MINTSTS: HTO Position             */
#define SDMMC_MINTSTS_HTO_Msk                 (0x01UL << SDMMC_MINTSTS_HTO_Pos)                       /*!< SDMMC MINTSTS: HTO Mask                 */
#define SDMMC_MINTSTS_FRUN_Pos                11                                                      /*!< SDMMC MINTSTS: FRUN Position            */
#define SDMMC_MINTSTS_FRUN_Msk                (0x01UL << SDMMC_MINTSTS_FRUN_Pos)                      /*!< SDMMC MINTSTS: FRUN Mask                */
#define SDMMC_MINTSTS_HLE_Pos                 12                                                      /*!< SDMMC MINTSTS: HLE Position             */
#define SDMMC_MINTSTS_HLE_Msk                 (0x01UL << SDMMC_MINTSTS_HLE_Pos)                       /*!< SDMMC MINTSTS: HLE Mask                 */
#define SDMMC_MINTSTS_SBE_Pos                 13                                                      /*!< SDMMC MINTSTS: SBE Position             */
#define SDMMC_MINTSTS_SBE_Msk                 (0x01UL << SDMMC_MINTSTS_SBE_Pos)                       /*!< SDMMC MINTSTS: SBE Mask                 */
#define SDMMC_MINTSTS_ACD_Pos                 14                                                      /*!< SDMMC MINTSTS: ACD Position             */
#define SDMMC_MINTSTS_ACD_Msk                 (0x01UL << SDMMC_MINTSTS_ACD_Pos)                       /*!< SDMMC MINTSTS: ACD Mask                 */
#define SDMMC_MINTSTS_EBE_Pos                 15                                                      /*!< SDMMC MINTSTS: EBE Position             */
#define SDMMC_MINTSTS_EBE_Msk                 (0x01UL << SDMMC_MINTSTS_EBE_Pos)                       /*!< SDMMC MINTSTS: EBE Mask                 */
#define SDMMC_MINTSTS_SDIO_INTERRUPT_Pos      16                                                      /*!< SDMMC MINTSTS: SDIO_INTERRUPT Position  */
#define SDMMC_MINTSTS_SDIO_INTERRUPT_Msk      (0x01UL << SDMMC_MINTSTS_SDIO_INTERRUPT_Pos)            /*!< SDMMC MINTSTS: SDIO_INTERRUPT Mask      */

