MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -----------------------------  EMC_STATICWAITOEN0  ----------------------------- */
#define EMC_STATICWAITOEN0_WAITOEN_Pos        0                                                       /*!< EMC STATICWAITOEN0: WAITOEN Position    */
#define EMC_STATICWAITOEN0_WAITOEN_Msk        (0x0fUL << EMC_STATICWAITOEN0_WAITOEN_Pos)              /*!< EMC STATICWAITOEN0: WAITOEN Mask        */

/* ------------------------------  EMC_STATICWAITRD0  ----------------------------- */
#define EMC_STATICWAITRD0_WAITRD_Pos          0                                                       /*!< EMC STATICWAITRD0: WAITRD Position      */
#define EMC_STATICWAITRD0_WAITRD_Msk          (0x1fUL << EMC_STATICWAITRD0_WAITRD_Pos)                /*!< EMC STATICWAITRD0: WAITRD Mask          */

/* -----------------------------  EMC_STATICWAITPAGE0  ---------------------------- */
#define EMC_STATICWAITPAGE0_WAITPAGE_Pos      0                                                       /*!< EMC STATICWAITPAGE0: WAITPAGE Position  */
#define EMC_STATICWAITPAGE0_WAITPAGE_Msk      (0x1fUL << EMC_STATICWAITPAGE0_WAITPAGE_Pos)            /*!< EMC STATICWAITPAGE0: WAITPAGE Mask      */

/* ------------------------------  EMC_STATICWAITWR0  ----------------------------- */
#define EMC_STATICWAITWR0_WAITWR_Pos          0                                                       /*!< EMC STATICWAITWR0: WAITWR Position      */
#define EMC_STATICWAITWR0_WAITWR_Msk          (0x1fUL << EMC_STATICWAITWR0_WAITWR_Pos)                /*!< EMC STATICWAITWR0: WAITWR Mask          */

/* -----------------------------  EMC_STATICWAITTURN0  ---------------------------- */
#define EMC_STATICWAITTURN0_WAITTURN_Pos      0                                                       /*!< EMC STATICWAITTURN0: WAITTURN Position  */
#define EMC_STATICWAITTURN0_WAITTURN_Msk      (0x0fUL << EMC_STATICWAITTURN0_WAITTURN_Pos)            /*!< EMC STATICWAITTURN0: WAITTURN Mask      */

/* ------------------------------  EMC_STATICCONFIG1  ----------------------------- */
#define EMC_STATICCONFIG1_MW_Pos              0                                                       /*!< EMC STATICCONFIG1: MW Position          */
#define EMC_STATICCONFIG1_MW_Msk              (0x03UL << EMC_STATICCONFIG1_MW_Pos)                    /*!< EMC STATICCONFIG1: MW Mask              */
#define EMC_STATICCONFIG1_PM_Pos              3                                                       /*!< EMC STATICCONFIG1: PM Position          */
#define EMC_STATICCONFIG1_PM_Msk              (0x01UL << EMC_STATICCONFIG1_PM_Pos)                    /*!< EMC STATICCONFIG1: PM Mask              */
#define EMC_STATICCONFIG1_PC_Pos              6                                                       /*!< EMC STATICCONFIG1: PC Position          */
#define EMC_STATICCONFIG1_PC_Msk              (0x01UL << EMC_STATICCONFIG1_PC_Pos)                    /*!< EMC STATICCONFIG1: PC Mask              */
#define EMC_STATICCONFIG1_PB_Pos              7                                                       /*!< EMC STATICCONFIG1: PB Position          */
#define EMC_STATICCONFIG1_PB_Msk              (0x01UL << EMC_STATICCONFIG1_PB_Pos)                    /*!< EMC STATICCONFIG1: PB Mask              */
#define EMC_STATICCONFIG1_EW_Pos              8                                                       /*!< EMC STATICCONFIG1: EW Position          */
#define EMC_STATICCONFIG1_EW_Msk              (0x01UL << EMC_STATICCONFIG1_EW_Pos)                    /*!< EMC STATICCONFIG1: EW Mask              */
#define EMC_STATICCONFIG1_B_Pos               19                                                      /*!< EMC STATICCONFIG1: B Position           */
#define EMC_STATICCONFIG1_B_Msk               (0x01UL << EMC_STATICCONFIG1_B_Pos)                     /*!< EMC STATICCONFIG1: B Mask               */
#define EMC_STATICCONFIG1_P_Pos               20                                                      /*!< EMC STATICCONFIG1: P Position           */
#define EMC_STATICCONFIG1_P_Msk               (0x01UL << EMC_STATICCONFIG1_P_Pos)                     /*!< EMC STATICCONFIG1: P Mask               */

/* -----------------------------  EMC_STATICWAITWEN1  ----------------------------- */
#define EMC_STATICWAITWEN1_WAITWEN_Pos        0                                                       /*!< EMC STATICWAITWEN1: WAITWEN Position    */
#define EMC_STATICWAITWEN1_WAITWEN_Msk        (0x0fUL << EMC_STATICWAITWEN1_WAITWEN_Pos)              /*!< EMC STATICWAITWEN1: WAITWEN Mask        */

/* -----------------------------  EMC_STATICWAITOEN1  ----------------------------- */
#define EMC_STATICWAITOEN1_WAITOEN_Pos        0                                                       /*!< EMC STATICWAITOEN1: WAITOEN Position    */
#define EMC_STATICWAITOEN1_WAITOEN_Msk        (0x0fUL << EMC_STATICWAITOEN1_WAITOEN_Pos)              /*!< EMC STATICWAITOEN1: WAITOEN Mask        */

/* ------------------------------  EMC_STATICWAITRD1  ----------------------------- */
#define EMC_STATICWAITRD1_WAITRD_Pos          0                                                       /*!< EMC STATICWAITRD1: WAITRD Position      */
#define EMC_STATICWAITRD1_WAITRD_Msk          (0x1fUL << EMC_STATICWAITRD1_WAITRD_Pos)                /*!< EMC STATICWAITRD1: WAITRD Mask          */

/* -----------------------------  EMC_STATICWAITPAGE1  ---------------------------- */
#define EMC_STATICWAITPAGE1_WAITPAGE_Pos      0                                                       /*!< EMC STATICWAITPAGE1: WAITPAGE Position  */
#define EMC_STATICWAITPAGE1_WAITPAGE_Msk      (0x1fUL << EMC_STATICWAITPAGE1_WAITPAGE_Pos)            /*!< EMC STATICWAITPAGE1: WAITPAGE Mask      */

/* ------------------------------  EMC_STATICWAITWR1  ----------------------------- */
#define EMC_STATICWAITWR1_WAITWR_Pos          0                                                       /*!< EMC STATICWAITWR1: WAITWR Position      */
#define EMC_STATICWAITWR1_WAITWR_Msk          (0x1fUL << EMC_STATICWAITWR1_WAITWR_Pos)                /*!< EMC STATICWAITWR1: WAITWR Mask          */

/* -----------------------------  EMC_STATICWAITTURN1  ---------------------------- */
#define EMC_STATICWAITTURN1_WAITTURN_Pos      0                                                       /*!< EMC STATICWAITTURN1: WAITTURN Position  */
#define EMC_STATICWAITTURN1_WAITTURN_Msk      (0x0fUL << EMC_STATICWAITTURN1_WAITTURN_Pos)            /*!< EMC STATICWAITTURN1: WAITTURN Mask      */

