MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -------------------------------  USB0_USBINTR_H  ------------------------------- */
#define USB0_USBINTR_H_UE_Pos                 0                                                       /*!< USB0 USBINTR_H: UE Position             */
#define USB0_USBINTR_H_UE_Msk                 (0x01UL << USB0_USBINTR_H_UE_Pos)                       /*!< USB0 USBINTR_H: UE Mask                 */
#define USB0_USBINTR_H_UEE_Pos                1                                                       /*!< USB0 USBINTR_H: UEE Position            */
#define USB0_USBINTR_H_UEE_Msk                (0x01UL << USB0_USBINTR_H_UEE_Pos)                      /*!< USB0 USBINTR_H: UEE Mask                */
#define USB0_USBINTR_H_PCE_Pos                2                                                       /*!< USB0 USBINTR_H: PCE Position            */
#define USB0_USBINTR_H_PCE_Msk                (0x01UL << USB0_USBINTR_H_PCE_Pos)                      /*!< USB0 USBINTR_H: PCE Mask                */
#define USB0_USBINTR_H_FRE_Pos                3                                                       /*!< USB0 USBINTR_H: FRE Position            */
#define USB0_USBINTR_H_FRE_Msk                (0x01UL << USB0_USBINTR_H_FRE_Pos)                      /*!< USB0 USBINTR_H: FRE Mask                */
#define USB0_USBINTR_H_AAE_Pos                5                                                       /*!< USB0 USBINTR_H: AAE Position            */
#define USB0_USBINTR_H_AAE_Msk                (0x01UL << USB0_USBINTR_H_AAE_Pos)                      /*!< USB0 USBINTR_H: AAE Mask                */
#define USB0_USBINTR_H_SRE_Pos                7                                                       /*!< USB0 USBINTR_H: SRE Position            */
#define USB0_USBINTR_H_SRE_Msk                (0x01UL << USB0_USBINTR_H_SRE_Pos)                      /*!< USB0 USBINTR_H: SRE Mask                */
#define USB0_USBINTR_H_UAIE_Pos               18                                                      /*!< USB0 USBINTR_H: UAIE Position           */
#define USB0_USBINTR_H_UAIE_Msk               (0x01UL << USB0_USBINTR_H_UAIE_Pos)                     /*!< USB0 USBINTR_H: UAIE Mask               */
#define USB0_USBINTR_H_UPIA_Pos               19                                                      /*!< USB0 USBINTR_H: UPIA Position           */
#define USB0_USBINTR_H_UPIA_Msk               (0x01UL << USB0_USBINTR_H_UPIA_Pos)                     /*!< USB0 USBINTR_H: UPIA Mask               */

/* -------------------------------  USB0_FRINDEX_D  ------------------------------- */
#define USB0_FRINDEX_D_FRINDEX2_0_Pos         0                                                       /*!< USB0 FRINDEX_D: FRINDEX2_0 Position     */
#define USB0_FRINDEX_D_FRINDEX2_0_Msk         (0x07UL << USB0_FRINDEX_D_FRINDEX2_0_Pos)               /*!< USB0 FRINDEX_D: FRINDEX2_0 Mask         */
#define USB0_FRINDEX_D_FRINDEX13_3_Pos        3                                                       /*!< USB0 FRINDEX_D: FRINDEX13_3 Position    */
#define USB0_FRINDEX_D_FRINDEX13_3_Msk        (0x000007ffUL << USB0_FRINDEX_D_FRINDEX13_3_Pos)        /*!< USB0 FRINDEX_D: FRINDEX13_3 Mask        */

/* -------------------------------  USB0_FRINDEX_H  ------------------------------- */
#define USB0_FRINDEX_H_FRINDEX2_0_Pos         0                                                       /*!< USB0 FRINDEX_H: FRINDEX2_0 Position     */
#define USB0_FRINDEX_H_FRINDEX2_0_Msk         (0x07UL << USB0_FRINDEX_H_FRINDEX2_0_Pos)               /*!< USB0 FRINDEX_H: FRINDEX2_0 Mask         */
#define USB0_FRINDEX_H_FRINDEX12_3_Pos        3                                                       /*!< USB0 FRINDEX_H: FRINDEX12_3 Position    */
#define USB0_FRINDEX_H_FRINDEX12_3_Msk        (0x000003ffUL << USB0_FRINDEX_H_FRINDEX12_3_Pos)        /*!< USB0 FRINDEX_H: FRINDEX12_3 Mask        */

/* -------------------------------  USB0_DEVICEADDR  ------------------------------ */
#define USB0_DEVICEADDR_USBADRA_Pos           24                                                      /*!< USB0 DEVICEADDR: USBADRA Position       */
#define USB0_DEVICEADDR_USBADRA_Msk           (0x01UL << USB0_DEVICEADDR_USBADRA_Pos)                 /*!< USB0 DEVICEADDR: USBADRA Mask           */
#define USB0_DEVICEADDR_USBADR_Pos            25                                                      /*!< USB0 DEVICEADDR: USBADR Position        */
#define USB0_DEVICEADDR_USBADR_Msk            (0x7fUL << USB0_DEVICEADDR_USBADR_Pos)                  /*!< USB0 DEVICEADDR: USBADR Mask            */

/* ----------------------------  USB0_PERIODICLISTBASE  --------------------------- */
#define USB0_PERIODICLISTBASE_PERBASE31_12_Pos 12                                                     /*!< USB0 PERIODICLISTBASE: PERBASE31_12 Position */
#define USB0_PERIODICLISTBASE_PERBASE31_12_Msk (0x000fffffUL << USB0_PERIODICLISTBASE_PERBASE31_12_Pos)/*!< USB0 PERIODICLISTBASE: PERBASE31_12 Mask */

/* ----------------------------  USB0_ENDPOINTLISTADDR  --------------------------- */
#define USB0_ENDPOINTLISTADDR_EPBASE31_11_Pos 11                                                      /*!< USB0 ENDPOINTLISTADDR: EPBASE31_11 Position */
#define USB0_ENDPOINTLISTADDR_EPBASE31_11_Msk (0x001fffffUL << USB0_ENDPOINTLISTADDR_EPBASE31_11_Pos) /*!< USB0 ENDPOINTLISTADDR: EPBASE31_11 Mask */

/* -----------------------------  USB0_ASYNCLISTADDR  ----------------------------- */
#define USB0_ASYNCLISTADDR_ASYBASE31_5_Pos    5                                                       /*!< USB0 ASYNCLISTADDR: ASYBASE31_5 Position */
#define USB0_ASYNCLISTADDR_ASYBASE31_5_Msk    (0x07ffffffUL << USB0_ASYNCLISTADDR_ASYBASE31_5_Pos)    /*!< USB0 ASYNCLISTADDR: ASYBASE31_5 Mask    */

/* ---------------------------------  USB0_TTCTRL  -------------------------------- */
#define USB0_TTCTRL_TTHA_Pos                  24                                                      /*!< USB0 TTCTRL: TTHA Position              */
#define USB0_TTCTRL_TTHA_Msk                  (0x7fUL << USB0_TTCTRL_TTHA_Pos)                        /*!< USB0 TTCTRL: TTHA Mask                  */

/* -------------------------------  USB0_BURSTSIZE  ------------------------------- */
#define USB0_BURSTSIZE_RXPBURST_Pos           0                                                       /*!< USB0 BURSTSIZE: RXPBURST Position       */
#define USB0_BURSTSIZE_RXPBURST_Msk           (0x000000ffUL << USB0_BURSTSIZE_RXPBURST_Pos)           /*!< USB0 BURSTSIZE: RXPBURST Mask           */
#define USB0_BURSTSIZE_TXPBURST_Pos           8                                                       /*!< USB0 BURSTSIZE: TXPBURST Position       */
#define USB0_BURSTSIZE_TXPBURST_Msk           (0x000000ffUL << USB0_BURSTSIZE_TXPBURST_Pos)           /*!< USB0 BURSTSIZE: TXPBURST Mask           */

/* ------------------------------  USB0_TXFILLTUNING  ----------------------------- */
#define USB0_TXFILLTUNING_TXSCHOH_Pos         0                                                       /*!< USB0 TXFILLTUNING: TXSCHOH Position     */
#define USB0_TXFILLTUNING_TXSCHOH_Msk         (0x000000ffUL << USB0_TXFILLTUNING_TXSCHOH_Pos)         /*!< USB0 TXFILLTUNING: TXSCHOH Mask         */
#define USB0_TXFILLTUNING_TXSCHEATLTH_Pos     8                                                       /*!< USB0 TXFILLTUNING: TXSCHEATLTH Position */
#define USB0_TXFILLTUNING_TXSCHEATLTH_Msk     (0x1fUL << USB0_TXFILLTUNING_TXSCHEATLTH_Pos)           /*!< USB0 TXFILLTUNING: TXSCHEATLTH Mask     */
#define USB0_TXFILLTUNING_TXFIFOTHRES_Pos     16                                                      /*!< USB0 TXFILLTUNING: TXFIFOTHRES Position */
#define USB0_TXFILLTUNING_TXFIFOTHRES_Msk     (0x3fUL << USB0_TXFILLTUNING_TXFIFOTHRES_Pos)           /*!< USB0 TXFILLTUNING: TXFIFOTHRES Mask     */

/* -------------------------------  USB0_BINTERVAL  ------------------------------- */
#define USB0_BINTERVAL_BINT_Pos               0                                                       /*!< USB0 BINTERVAL: BINT Position           */
#define USB0_BINTERVAL_BINT_Msk               (0x0fUL << USB0_BINTERVAL_BINT_Pos)                     /*!< USB0 BINTERVAL: BINT Mask               */

/* --------------------------------  USB0_ENDPTNAK  ------------------------------- */
#define USB0_ENDPTNAK_EPRN0_Pos               0                                                       /*!< USB0 ENDPTNAK: EPRN0 Position           */
#define USB0_ENDPTNAK_EPRN0_Msk               (0x01UL << USB0_ENDPTNAK_EPRN0_Pos)                     /*!< USB0 ENDPTNAK: EPRN0 Mask               */
#define USB0_ENDPTNAK_EPRN1_Pos               1                                                       /*!< USB0 ENDPTNAK: EPRN1 Position           */
#define USB0_ENDPTNAK_EPRN1_Msk               (0x01UL << USB0_ENDPTNAK_EPRN1_Pos)                     /*!< USB0 ENDPTNAK: EPRN1 Mask               */
#define USB0_ENDPTNAK_EPRN2_Pos               2                                                       /*!< USB0 ENDPTNAK: EPRN2 Position           */
#define USB0_ENDPTNAK_EPRN2_Msk               (0x01UL << USB0_ENDPTNAK_EPRN2_Pos)                     /*!< USB0 ENDPTNAK: EPRN2 Mask               */
#define USB0_ENDPTNAK_EPRN3_Pos               3                                                       /*!< USB0 ENDPTNAK: EPRN3 Position           */
#define USB0_ENDPTNAK_EPRN3_Msk               (0x01UL << USB0_ENDPTNAK_EPRN3_Pos)                     /*!< USB0 ENDPTNAK: EPRN3 Mask               */
#define USB0_ENDPTNAK_EPRN4_Pos               4                                                       /*!< USB0 ENDPTNAK: EPRN4 Position           */
#define USB0_ENDPTNAK_EPRN4_Msk               (0x01UL << USB0_ENDPTNAK_EPRN4_Pos)                     /*!< USB0 ENDPTNAK: EPRN4 Mask               */
#define USB0_ENDPTNAK_EPRN5_Pos               5                                                       /*!< USB0 ENDPTNAK: EPRN5 Position           */
#define USB0_ENDPTNAK_EPRN5_Msk               (0x01UL << USB0_ENDPTNAK_EPRN5_Pos)                     /*!< USB0 ENDPTNAK: EPRN5 Mask               */
#define USB0_ENDPTNAK_EPTN0_Pos               16                                                      /*!< USB0 ENDPTNAK: EPTN0 Position           */
#define USB0_ENDPTNAK_EPTN0_Msk               (0x01UL << USB0_ENDPTNAK_EPTN0_Pos)                     /*!< USB0 ENDPTNAK: EPTN0 Mask               */
#define USB0_ENDPTNAK_EPTN1_Pos               17                                                      /*!< USB0 ENDPTNAK: EPTN1 Position           */
#define USB0_ENDPTNAK_EPTN1_Msk               (0x01UL << USB0_ENDPTNAK_EPTN1_Pos)                     /*!< USB0 ENDPTNAK: EPTN1 Mask               */
#define USB0_ENDPTNAK_EPTN2_Pos               18                                                      /*!< USB0 ENDPTNAK: EPTN2 Position           */
#define USB0_ENDPTNAK_EPTN2_Msk               (0x01UL << USB0_ENDPTNAK_EPTN2_Pos)                     /*!< USB0 ENDPTNAK: EPTN2 Mask               */
#define USB0_ENDPTNAK_EPTN3_Pos               19                                                      /*!< USB0 ENDPTNAK: EPTN3 Position           */
#define USB0_ENDPTNAK_EPTN3_Msk               (0x01UL << USB0_ENDPTNAK_EPTN3_Pos)                     /*!< USB0 ENDPTNAK: EPTN3 Mask               */
#define USB0_ENDPTNAK_EPTN4_Pos               20                                                      /*!< USB0 ENDPTNAK: EPTN4 Position           */
#define USB0_ENDPTNAK_EPTN4_Msk               (0x01UL << USB0_ENDPTNAK_EPTN4_Pos)                     /*!< USB0 ENDPTNAK: EPTN4 Mask               */
#define USB0_ENDPTNAK_EPTN5_Pos               21                                                      /*!< USB0 ENDPTNAK: EPTN5 Position           */
#define USB0_ENDPTNAK_EPTN5_Msk               (0x01UL << USB0_ENDPTNAK_EPTN5_Pos)                     /*!< USB0 ENDPTNAK: EPTN5 Mask               */

