MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -------------------------------  USB0_ENDPTNAKEN  ------------------------------ */
#define USB0_ENDPTNAKEN_EPRNE0_Pos            0                                                       /*!< USB0 ENDPTNAKEN: EPRNE0 Position        */
#define USB0_ENDPTNAKEN_EPRNE0_Msk            (0x01UL << USB0_ENDPTNAKEN_EPRNE0_Pos)                  /*!< USB0 ENDPTNAKEN: EPRNE0 Mask            */
#define USB0_ENDPTNAKEN_EPRNE1_Pos            1                                                       /*!< USB0 ENDPTNAKEN: EPRNE1 Position        */
#define USB0_ENDPTNAKEN_EPRNE1_Msk            (0x01UL << USB0_ENDPTNAKEN_EPRNE1_Pos)                  /*!< USB0 ENDPTNAKEN: EPRNE1 Mask            */
#define USB0_ENDPTNAKEN_EPRNE2_Pos            2                                                       /*!< USB0 ENDPTNAKEN: EPRNE2 Position        */
#define USB0_ENDPTNAKEN_EPRNE2_Msk            (0x01UL << USB0_ENDPTNAKEN_EPRNE2_Pos)                  /*!< USB0 ENDPTNAKEN: EPRNE2 Mask            */
#define USB0_ENDPTNAKEN_EPRNE3_Pos            3                                                       /*!< USB0 ENDPTNAKEN: EPRNE3 Position        */
#define USB0_ENDPTNAKEN_EPRNE3_Msk            (0x01UL << USB0_ENDPTNAKEN_EPRNE3_Pos)                  /*!< USB0 ENDPTNAKEN: EPRNE3 Mask            */
#define USB0_ENDPTNAKEN_EPRNE4_Pos            4                                                       /*!< USB0 ENDPTNAKEN: EPRNE4 Position        */
#define USB0_ENDPTNAKEN_EPRNE4_Msk            (0x01UL << USB0_ENDPTNAKEN_EPRNE4_Pos)                  /*!< USB0 ENDPTNAKEN: EPRNE4 Mask            */
#define USB0_ENDPTNAKEN_EPRNE5_Pos            5                                                       /*!< USB0 ENDPTNAKEN: EPRNE5 Position        */
#define USB0_ENDPTNAKEN_EPRNE5_Msk            (0x01UL << USB0_ENDPTNAKEN_EPRNE5_Pos)                  /*!< USB0 ENDPTNAKEN: EPRNE5 Mask            */
#define USB0_ENDPTNAKEN_EPTNE0_Pos            16                                                      /*!< USB0 ENDPTNAKEN: EPTNE0 Position        */
#define USB0_ENDPTNAKEN_EPTNE0_Msk            (0x01UL << USB0_ENDPTNAKEN_EPTNE0_Pos)                  /*!< USB0 ENDPTNAKEN: EPTNE0 Mask            */
#define USB0_ENDPTNAKEN_EPTNE1_Pos            17                                                      /*!< USB0 ENDPTNAKEN: EPTNE1 Position        */
#define USB0_ENDPTNAKEN_EPTNE1_Msk            (0x01UL << USB0_ENDPTNAKEN_EPTNE1_Pos)                  /*!< USB0 ENDPTNAKEN: EPTNE1 Mask            */
#define USB0_ENDPTNAKEN_EPTNE2_Pos            18                                                      /*!< USB0 ENDPTNAKEN: EPTNE2 Position        */
#define USB0_ENDPTNAKEN_EPTNE2_Msk            (0x01UL << USB0_ENDPTNAKEN_EPTNE2_Pos)                  /*!< USB0 ENDPTNAKEN: EPTNE2 Mask            */
#define USB0_ENDPTNAKEN_EPTNE3_Pos            19                                                      /*!< USB0 ENDPTNAKEN: EPTNE3 Position        */
#define USB0_ENDPTNAKEN_EPTNE3_Msk            (0x01UL << USB0_ENDPTNAKEN_EPTNE3_Pos)                  /*!< USB0 ENDPTNAKEN: EPTNE3 Mask            */
#define USB0_ENDPTNAKEN_EPTNE4_Pos            20                                                      /*!< USB0 ENDPTNAKEN: EPTNE4 Position        */
#define USB0_ENDPTNAKEN_EPTNE4_Msk            (0x01UL << USB0_ENDPTNAKEN_EPTNE4_Pos)                  /*!< USB0 ENDPTNAKEN: EPTNE4 Mask            */
#define USB0_ENDPTNAKEN_EPTNE5_Pos            21                                                      /*!< USB0 ENDPTNAKEN: EPTNE5 Position        */
#define USB0_ENDPTNAKEN_EPTNE5_Msk            (0x01UL << USB0_ENDPTNAKEN_EPTNE5_Pos)                  /*!< USB0 ENDPTNAKEN: EPTNE5 Mask            */

/* -------------------------------  USB0_PORTSC1_D  ------------------------------- */
#define USB0_PORTSC1_D_CCS_Pos                0                                                       /*!< USB0 PORTSC1_D: CCS Position            */
#define USB0_PORTSC1_D_CCS_Msk                (0x01UL << USB0_PORTSC1_D_CCS_Pos)                      /*!< USB0 PORTSC1_D: CCS Mask                */
#define USB0_PORTSC1_D_PE_Pos                 2                                                       /*!< USB0 PORTSC1_D: PE Position             */
#define USB0_PORTSC1_D_PE_Msk                 (0x01UL << USB0_PORTSC1_D_PE_Pos)                       /*!< USB0 PORTSC1_D: PE Mask                 */
#define USB0_PORTSC1_D_PEC_Pos                3                                                       /*!< USB0 PORTSC1_D: PEC Position            */
#define USB0_PORTSC1_D_PEC_Msk                (0x01UL << USB0_PORTSC1_D_PEC_Pos)                      /*!< USB0 PORTSC1_D: PEC Mask                */
#define USB0_PORTSC1_D_FPR_Pos                6                                                       /*!< USB0 PORTSC1_D: FPR Position            */
#define USB0_PORTSC1_D_FPR_Msk                (0x01UL << USB0_PORTSC1_D_FPR_Pos)                      /*!< USB0 PORTSC1_D: FPR Mask                */
#define USB0_PORTSC1_D_SUSP_Pos               7                                                       /*!< USB0 PORTSC1_D: SUSP Position           */
#define USB0_PORTSC1_D_SUSP_Msk               (0x01UL << USB0_PORTSC1_D_SUSP_Pos)                     /*!< USB0 PORTSC1_D: SUSP Mask               */
#define USB0_PORTSC1_D_PR_Pos                 8                                                       /*!< USB0 PORTSC1_D: PR Position             */
#define USB0_PORTSC1_D_PR_Msk                 (0x01UL << USB0_PORTSC1_D_PR_Pos)                       /*!< USB0 PORTSC1_D: PR Mask                 */
#define USB0_PORTSC1_D_HSP_Pos                9                                                       /*!< USB0 PORTSC1_D: HSP Position            */
#define USB0_PORTSC1_D_HSP_Msk                (0x01UL << USB0_PORTSC1_D_HSP_Pos)                      /*!< USB0 PORTSC1_D: HSP Mask                */
#define USB0_PORTSC1_D_PIC1_0_Pos             14                                                      /*!< USB0 PORTSC1_D: PIC1_0 Position         */
#define USB0_PORTSC1_D_PIC1_0_Msk             (0x03UL << USB0_PORTSC1_D_PIC1_0_Pos)                   /*!< USB0 PORTSC1_D: PIC1_0 Mask             */
#define USB0_PORTSC1_D_PTC3_0_Pos             16                                                      /*!< USB0 PORTSC1_D: PTC3_0 Position         */
#define USB0_PORTSC1_D_PTC3_0_Msk             (0x0fUL << USB0_PORTSC1_D_PTC3_0_Pos)                   /*!< USB0 PORTSC1_D: PTC3_0 Mask             */
#define USB0_PORTSC1_D_PHCD_Pos               23                                                      /*!< USB0 PORTSC1_D: PHCD Position           */
#define USB0_PORTSC1_D_PHCD_Msk               (0x01UL << USB0_PORTSC1_D_PHCD_Pos)                     /*!< USB0 PORTSC1_D: PHCD Mask               */
#define USB0_PORTSC1_D_PFSC_Pos               24                                                      /*!< USB0 PORTSC1_D: PFSC Position           */
#define USB0_PORTSC1_D_PFSC_Msk               (0x01UL << USB0_PORTSC1_D_PFSC_Pos)                     /*!< USB0 PORTSC1_D: PFSC Mask               */
#define USB0_PORTSC1_D_PSPD_Pos               26                                                      /*!< USB0 PORTSC1_D: PSPD Position           */
#define USB0_PORTSC1_D_PSPD_Msk               (0x03UL << USB0_PORTSC1_D_PSPD_Pos)                     /*!< USB0 PORTSC1_D: PSPD Mask               */

/* -------------------------------  USB0_PORTSC1_H  ------------------------------- */
#define USB0_PORTSC1_H_CCS_Pos                0                                                       /*!< USB0 PORTSC1_H: CCS Position            */
#define USB0_PORTSC1_H_CCS_Msk                (0x01UL << USB0_PORTSC1_H_CCS_Pos)                      /*!< USB0 PORTSC1_H: CCS Mask                */
#define USB0_PORTSC1_H_CSC_Pos                1                                                       /*!< USB0 PORTSC1_H: CSC Position            */
#define USB0_PORTSC1_H_CSC_Msk                (0x01UL << USB0_PORTSC1_H_CSC_Pos)                      /*!< USB0 PORTSC1_H: CSC Mask                */
#define USB0_PORTSC1_H_PE_Pos                 2                                                       /*!< USB0 PORTSC1_H: PE Position             */
#define USB0_PORTSC1_H_PE_Msk                 (0x01UL << USB0_PORTSC1_H_PE_Pos)                       /*!< USB0 PORTSC1_H: PE Mask                 */
#define USB0_PORTSC1_H_PEC_Pos                3                                                       /*!< USB0 PORTSC1_H: PEC Position            */
#define USB0_PORTSC1_H_PEC_Msk                (0x01UL << USB0_PORTSC1_H_PEC_Pos)                      /*!< USB0 PORTSC1_H: PEC Mask                */
#define USB0_PORTSC1_H_OCA_Pos                4                                                       /*!< USB0 PORTSC1_H: OCA Position            */
#define USB0_PORTSC1_H_OCA_Msk                (0x01UL << USB0_PORTSC1_H_OCA_Pos)                      /*!< USB0 PORTSC1_H: OCA Mask                */
#define USB0_PORTSC1_H_OCC_Pos                5                                                       /*!< USB0 PORTSC1_H: OCC Position            */
#define USB0_PORTSC1_H_OCC_Msk                (0x01UL << USB0_PORTSC1_H_OCC_Pos)                      /*!< USB0 PORTSC1_H: OCC Mask                */
#define USB0_PORTSC1_H_FPR_Pos                6                                                       /*!< USB0 PORTSC1_H: FPR Position            */
#define USB0_PORTSC1_H_FPR_Msk                (0x01UL << USB0_PORTSC1_H_FPR_Pos)                      /*!< USB0 PORTSC1_H: FPR Mask                */
#define USB0_PORTSC1_H_SUSP_Pos               7                                                       /*!< USB0 PORTSC1_H: SUSP Position           */
#define USB0_PORTSC1_H_SUSP_Msk               (0x01UL << USB0_PORTSC1_H_SUSP_Pos)                     /*!< USB0 PORTSC1_H: SUSP Mask               */
#define USB0_PORTSC1_H_PR_Pos                 8                                                       /*!< USB0 PORTSC1_H: PR Position             */
#define USB0_PORTSC1_H_PR_Msk                 (0x01UL << USB0_PORTSC1_H_PR_Pos)                       /*!< USB0 PORTSC1_H: PR Mask                 */
#define USB0_PORTSC1_H_HSP_Pos                9                                                       /*!< USB0 PORTSC1_H: HSP Position            */
#define USB0_PORTSC1_H_HSP_Msk                (0x01UL << USB0_PORTSC1_H_HSP_Pos)                      /*!< USB0 PORTSC1_H: HSP Mask                */
#define USB0_PORTSC1_H_LS_Pos                 10                                                      /*!< USB0 PORTSC1_H: LS Position             */
#define USB0_PORTSC1_H_LS_Msk                 (0x03UL << USB0_PORTSC1_H_LS_Pos)                       /*!< USB0 PORTSC1_H: LS Mask                 */
#define USB0_PORTSC1_H_PP_Pos                 12                                                      /*!< USB0 PORTSC1_H: PP Position             */
#define USB0_PORTSC1_H_PP_Msk                 (0x01UL << USB0_PORTSC1_H_PP_Pos)                       /*!< USB0 PORTSC1_H: PP Mask                 */
#define USB0_PORTSC1_H_PIC1_0_Pos             14                                                      /*!< USB0 PORTSC1_H: PIC1_0 Position         */
#define USB0_PORTSC1_H_PIC1_0_Msk             (0x03UL << USB0_PORTSC1_H_PIC1_0_Pos)                   /*!< USB0 PORTSC1_H: PIC1_0 Mask             */
#define USB0_PORTSC1_H_PTC3_0_Pos             16                                                      /*!< USB0 PORTSC1_H: PTC3_0 Position         */
#define USB0_PORTSC1_H_PTC3_0_Msk             (0x0fUL << USB0_PORTSC1_H_PTC3_0_Pos)                   /*!< USB0 PORTSC1_H: PTC3_0 Mask             */
#define USB0_PORTSC1_H_WKCN_Pos               20                                                      /*!< USB0 PORTSC1_H: WKCN Position           */
#define USB0_PORTSC1_H_WKCN_Msk               (0x01UL << USB0_PORTSC1_H_WKCN_Pos)                     /*!< USB0 PORTSC1_H: WKCN Mask               */
#define USB0_PORTSC1_H_WKDC_Pos               21                                                      /*!< USB0 PORTSC1_H: WKDC Position           */
#define USB0_PORTSC1_H_WKDC_Msk               (0x01UL << USB0_PORTSC1_H_WKDC_Pos)                     /*!< USB0 PORTSC1_H: WKDC Mask               */
#define USB0_PORTSC1_H_WKOC_Pos               22                                                      /*!< USB0 PORTSC1_H: WKOC Position           */
#define USB0_PORTSC1_H_WKOC_Msk               (0x01UL << USB0_PORTSC1_H_WKOC_Pos)                     /*!< USB0 PORTSC1_H: WKOC Mask               */
#define USB0_PORTSC1_H_PHCD_Pos               23                                                      /*!< USB0 PORTSC1_H: PHCD Position           */
#define USB0_PORTSC1_H_PHCD_Msk               (0x01UL << USB0_PORTSC1_H_PHCD_Pos)                     /*!< USB0 PORTSC1_H: PHCD Mask               */
#define USB0_PORTSC1_H_PFSC_Pos               24                                                      /*!< USB0 PORTSC1_H: PFSC Position           */
#define USB0_PORTSC1_H_PFSC_Msk               (0x01UL << USB0_PORTSC1_H_PFSC_Pos)                     /*!< USB0 PORTSC1_H: PFSC Mask               */
#define USB0_PORTSC1_H_PSPD_Pos               26                                                      /*!< USB0 PORTSC1_H: PSPD Position           */
#define USB0_PORTSC1_H_PSPD_Msk               (0x03UL << USB0_PORTSC1_H_PSPD_Pos)                     /*!< USB0 PORTSC1_H: PSPD Mask               */

/* ---------------------------------  USB0_OTGSC  --------------------------------- */
#define USB0_OTGSC_VD_Pos                     0                                                       /*!< USB0 OTGSC: VD Position                 */
#define USB0_OTGSC_VD_Msk                     (0x01UL << USB0_OTGSC_VD_Pos)                           /*!< USB0 OTGSC: VD Mask                     */
#define USB0_OTGSC_VC_Pos                     1                                                       /*!< USB0 OTGSC: VC Position                 */
#define USB0_OTGSC_VC_Msk                     (0x01UL << USB0_OTGSC_VC_Pos)                           /*!< USB0 OTGSC: VC Mask                     */
#define USB0_OTGSC_HAAR_Pos                   2                                                       /*!< USB0 OTGSC: HAAR Position               */
#define USB0_OTGSC_HAAR_Msk                   (0x01UL << USB0_OTGSC_HAAR_Pos)                         /*!< USB0 OTGSC: HAAR Mask                   */
#define USB0_OTGSC_OT_Pos                     3                                                       /*!< USB0 OTGSC: OT Position                 */
#define USB0_OTGSC_OT_Msk                     (0x01UL << USB0_OTGSC_OT_Pos)                           /*!< USB0 OTGSC: OT Mask                     */
#define USB0_OTGSC_DP_Pos                     4                                                       /*!< USB0 OTGSC: DP Position                 */
#define USB0_OTGSC_DP_Msk                     (0x01UL << USB0_OTGSC_DP_Pos)                           /*!< USB0 OTGSC: DP Mask                     */
#define USB0_OTGSC_IDPU_Pos                   5                                                       /*!< USB0 OTGSC: IDPU Position               */
#define USB0_OTGSC_IDPU_Msk                   (0x01UL << USB0_OTGSC_IDPU_Pos)                         /*!< USB0 OTGSC: IDPU Mask                   */
#define USB0_OTGSC_HADP_Pos                   6                                                       /*!< USB0 OTGSC: HADP Position               */
#define USB0_OTGSC_HADP_Msk                   (0x01UL << USB0_OTGSC_HADP_Pos)                         /*!< USB0 OTGSC: HADP Mask                   */
#define USB0_OTGSC_HABA_Pos                   7                                                       /*!< USB0 OTGSC: HABA Position               */
#define USB0_OTGSC_HABA_Msk                   (0x01UL << USB0_OTGSC_HABA_Pos)                         /*!< USB0 OTGSC: HABA Mask                   */
#define USB0_OTGSC_ID_Pos                     8                                                       /*!< USB0 OTGSC: ID Position                 */
#define USB0_OTGSC_ID_Msk                     (0x01UL << USB0_OTGSC_ID_Pos)                           /*!< USB0 OTGSC: ID Mask                     */
#define USB0_OTGSC_AVV_Pos                    9                                                       /*!< USB0 OTGSC: AVV Position                */
#define USB0_OTGSC_AVV_Msk                    (0x01UL << USB0_OTGSC_AVV_Pos)                          /*!< USB0 OTGSC: AVV Mask                    */
#define USB0_OTGSC_ASV_Pos                    10                                                      /*!< USB0 OTGSC: ASV Position                */
#define USB0_OTGSC_ASV_Msk                    (0x01UL << USB0_OTGSC_ASV_Pos)                          /*!< USB0 OTGSC: ASV Mask                    */
#define USB0_OTGSC_BSV_Pos                    11                                                      /*!< USB0 OTGSC: BSV Position                */
#define USB0_OTGSC_BSV_Msk                    (0x01UL << USB0_OTGSC_BSV_Pos)                          /*!< USB0 OTGSC: BSV Mask                    */
#define USB0_OTGSC_BSE_Pos                    12                                                      /*!< USB0 OTGSC: BSE Position                */
#define USB0_OTGSC_BSE_Msk                    (0x01UL << USB0_OTGSC_BSE_Pos)                          /*!< USB0 OTGSC: BSE Mask                    */
#define USB0_OTGSC_MS1T_Pos                   13                                                      /*!< USB0 OTGSC: MS1T Position               */
#define USB0_OTGSC_MS1T_Msk                   (0x01UL << USB0_OTGSC_MS1T_Pos)                         /*!< USB0 OTGSC: MS1T Mask                   */
#define USB0_OTGSC_DPS_Pos                    14                                                      /*!< USB0 OTGSC: DPS Position                */
#define USB0_OTGSC_DPS_Msk                    (0x01UL << USB0_OTGSC_DPS_Pos)                          /*!< USB0 OTGSC: DPS Mask                    */
#define USB0_OTGSC_IDIS_Pos                   16                                                      /*!< USB0 OTGSC: IDIS Position               */
#define USB0_OTGSC_IDIS_Msk                   (0x01UL << USB0_OTGSC_IDIS_Pos)                         /*!< USB0 OTGSC: IDIS Mask                   */
#define USB0_OTGSC_AVVIS_Pos                  17                                                      /*!< USB0 OTGSC: AVVIS Position              */
#define USB0_OTGSC_AVVIS_Msk                  (0x01UL << USB0_OTGSC_AVVIS_Pos)                        /*!< USB0 OTGSC: AVVIS Mask                  */
#define USB0_OTGSC_ASVIS_Pos                  18                                                      /*!< USB0 OTGSC: ASVIS Position              */
#define USB0_OTGSC_ASVIS_Msk                  (0x01UL << USB0_OTGSC_ASVIS_Pos)                        /*!< USB0 OTGSC: ASVIS Mask                  */
#define USB0_OTGSC_BSVIS_Pos                  19                                                      /*!< USB0 OTGSC: BSVIS Position              */
#define USB0_OTGSC_BSVIS_Msk                  (0x01UL << USB0_OTGSC_BSVIS_Pos)                        /*!< USB0 OTGSC: BSVIS Mask                  */
#define USB0_OTGSC_BSEIS_Pos                  20                                                      /*!< USB0 OTGSC: BSEIS Position              */
#define USB0_OTGSC_BSEIS_Msk                  (0x01UL << USB0_OTGSC_BSEIS_Pos)                        /*!< USB0 OTGSC: BSEIS Mask                  */
#define USB0_OTGSC_ms1S_Pos                   21                                                      /*!< USB0 OTGSC: ms1S Position               */
#define USB0_OTGSC_ms1S_Msk                   (0x01UL << USB0_OTGSC_ms1S_Pos)                         /*!< USB0 OTGSC: ms1S Mask                   */
#define USB0_OTGSC_DPIS_Pos                   22                                                      /*!< USB0 OTGSC: DPIS Position               */
#define USB0_OTGSC_DPIS_Msk                   (0x01UL << USB0_OTGSC_DPIS_Pos)                         /*!< USB0 OTGSC: DPIS Mask                   */
#define USB0_OTGSC_IDIE_Pos                   24                                                      /*!< USB0 OTGSC: IDIE Position               */
#define USB0_OTGSC_IDIE_Msk                   (0x01UL << USB0_OTGSC_IDIE_Pos)                         /*!< USB0 OTGSC: IDIE Mask                   */
#define USB0_OTGSC_AVVIE_Pos                  25                                                      /*!< USB0 OTGSC: AVVIE Position              */
#define USB0_OTGSC_AVVIE_Msk                  (0x01UL << USB0_OTGSC_AVVIE_Pos)                        /*!< USB0 OTGSC: AVVIE Mask                  */
#define USB0_OTGSC_ASVIE_Pos                  26                                                      /*!< USB0 OTGSC: ASVIE Position              */
#define USB0_OTGSC_ASVIE_Msk                  (0x01UL << USB0_OTGSC_ASVIE_Pos)                        /*!< USB0 OTGSC: ASVIE Mask                  */
#define USB0_OTGSC_BSVIE_Pos                  27                                                      /*!< USB0 OTGSC: BSVIE Position              */
#define USB0_OTGSC_BSVIE_Msk                  (0x01UL << USB0_OTGSC_BSVIE_Pos)                        /*!< USB0 OTGSC: BSVIE Mask                  */
#define USB0_OTGSC_BSEIE_Pos                  28                                                      /*!< USB0 OTGSC: BSEIE Position              */
#define USB0_OTGSC_BSEIE_Msk                  (0x01UL << USB0_OTGSC_BSEIE_Pos)                        /*!< USB0 OTGSC: BSEIE Mask                  */
#define USB0_OTGSC_MS1E_Pos                   29                                                      /*!< USB0 OTGSC: MS1E Position               */
#define USB0_OTGSC_MS1E_Msk                   (0x01UL << USB0_OTGSC_MS1E_Pos)                         /*!< USB0 OTGSC: MS1E Mask                   */
#define USB0_OTGSC_DPIE_Pos                   30                                                      /*!< USB0 OTGSC: DPIE Position               */
#define USB0_OTGSC_DPIE_Msk                   (0x01UL << USB0_OTGSC_DPIE_Pos)                         /*!< USB0 OTGSC: DPIE Mask                   */

/* -------------------------------  USB0_USBMODE_D  ------------------------------- */
#define USB0_USBMODE_D_CM1_0_Pos              0                                                       /*!< USB0 USBMODE_D: CM1_0 Position          */
#define USB0_USBMODE_D_CM1_0_Msk              (0x03UL << USB0_USBMODE_D_CM1_0_Pos)                    /*!< USB0 USBMODE_D: CM1_0 Mask              */
#define USB0_USBMODE_D_ES_Pos                 2                                                       /*!< USB0 USBMODE_D: ES Position             */
#define USB0_USBMODE_D_ES_Msk                 (0x01UL << USB0_USBMODE_D_ES_Pos)                       /*!< USB0 USBMODE_D: ES Mask                 */
#define USB0_USBMODE_D_SLOM_Pos               3                                                       /*!< USB0 USBMODE_D: SLOM Position           */
#define USB0_USBMODE_D_SLOM_Msk               (0x01UL << USB0_USBMODE_D_SLOM_Pos)                     /*!< USB0 USBMODE_D: SLOM Mask               */
#define USB0_USBMODE_D_SDIS_Pos               4                                                       /*!< USB0 USBMODE_D: SDIS Position           */
#define USB0_USBMODE_D_SDIS_Msk               (0x01UL << USB0_USBMODE_D_SDIS_Pos)                     /*!< USB0 USBMODE_D: SDIS Mask               */

