MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -------------------------------  USB0_USBMODE_H  ------------------------------- */
#define USB0_USBMODE_H_CM_Pos                 0                                                       /*!< USB0 USBMODE_H: CM Position             */
#define USB0_USBMODE_H_CM_Msk                 (0x03UL << USB0_USBMODE_H_CM_Pos)                       /*!< USB0 USBMODE_H: CM Mask                 */
#define USB0_USBMODE_H_ES_Pos                 2                                                       /*!< USB0 USBMODE_H: ES Position             */
#define USB0_USBMODE_H_ES_Msk                 (0x01UL << USB0_USBMODE_H_ES_Pos)                       /*!< USB0 USBMODE_H: ES Mask                 */
#define USB0_USBMODE_H_SDIS_Pos               4                                                       /*!< USB0 USBMODE_H: SDIS Position           */
#define USB0_USBMODE_H_SDIS_Msk               (0x01UL << USB0_USBMODE_H_SDIS_Pos)                     /*!< USB0 USBMODE_H: SDIS Mask               */
#define USB0_USBMODE_H_VBPS_Pos               5                                                       /*!< USB0 USBMODE_H: VBPS Position           */
#define USB0_USBMODE_H_VBPS_Msk               (0x01UL << USB0_USBMODE_H_VBPS_Pos)                     /*!< USB0 USBMODE_H: VBPS Mask               */

/* -----------------------------  USB0_ENDPTSETUPSTAT  ---------------------------- */
#define USB0_ENDPTSETUPSTAT_ENDPTSETUPSTAT0_Pos 0                                                     /*!< USB0 ENDPTSETUPSTAT: ENDPTSETUPSTAT0 Position */
#define USB0_ENDPTSETUPSTAT_ENDPTSETUPSTAT0_Msk (0x01UL << USB0_ENDPTSETUPSTAT_ENDPTSETUPSTAT0_Pos)   /*!< USB0 ENDPTSETUPSTAT: ENDPTSETUPSTAT0 Mask */
#define USB0_ENDPTSETUPSTAT_ENDPTSETUPSTAT1_Pos 1                                                     /*!< USB0 ENDPTSETUPSTAT: ENDPTSETUPSTAT1 Position */
#define USB0_ENDPTSETUPSTAT_ENDPTSETUPSTAT1_Msk (0x01UL << USB0_ENDPTSETUPSTAT_ENDPTSETUPSTAT1_Pos)   /*!< USB0 ENDPTSETUPSTAT: ENDPTSETUPSTAT1 Mask */
#define USB0_ENDPTSETUPSTAT_ENDPTSETUPSTAT2_Pos 2                                                     /*!< USB0 ENDPTSETUPSTAT: ENDPTSETUPSTAT2 Position */
#define USB0_ENDPTSETUPSTAT_ENDPTSETUPSTAT2_Msk (0x01UL << USB0_ENDPTSETUPSTAT_ENDPTSETUPSTAT2_Pos)   /*!< USB0 ENDPTSETUPSTAT: ENDPTSETUPSTAT2 Mask */
#define USB0_ENDPTSETUPSTAT_ENDPTSETUPSTAT3_Pos 3                                                     /*!< USB0 ENDPTSETUPSTAT: ENDPTSETUPSTAT3 Position */
#define USB0_ENDPTSETUPSTAT_ENDPTSETUPSTAT3_Msk (0x01UL << USB0_ENDPTSETUPSTAT_ENDPTSETUPSTAT3_Pos)   /*!< USB0 ENDPTSETUPSTAT: ENDPTSETUPSTAT3 Mask */
#define USB0_ENDPTSETUPSTAT_ENDPTSETUPSTAT4_Pos 4                                                     /*!< USB0 ENDPTSETUPSTAT: ENDPTSETUPSTAT4 Position */
#define USB0_ENDPTSETUPSTAT_ENDPTSETUPSTAT4_Msk (0x01UL << USB0_ENDPTSETUPSTAT_ENDPTSETUPSTAT4_Pos)   /*!< USB0 ENDPTSETUPSTAT: ENDPTSETUPSTAT4 Mask */
#define USB0_ENDPTSETUPSTAT_ENDPTSETUPSTAT5_Pos 5                                                     /*!< USB0 ENDPTSETUPSTAT: ENDPTSETUPSTAT5 Position */
#define USB0_ENDPTSETUPSTAT_ENDPTSETUPSTAT5_Msk (0x01UL << USB0_ENDPTSETUPSTAT_ENDPTSETUPSTAT5_Pos)   /*!< USB0 ENDPTSETUPSTAT: ENDPTSETUPSTAT5 Mask */

/* -------------------------------  USB0_ENDPTPRIME  ------------------------------ */
#define USB0_ENDPTPRIME_PERB0_Pos             0                                                       /*!< USB0 ENDPTPRIME: PERB0 Position         */
#define USB0_ENDPTPRIME_PERB0_Msk             (0x01UL << USB0_ENDPTPRIME_PERB0_Pos)                   /*!< USB0 ENDPTPRIME: PERB0 Mask             */
#define USB0_ENDPTPRIME_PERB1_Pos             1                                                       /*!< USB0 ENDPTPRIME: PERB1 Position         */
#define USB0_ENDPTPRIME_PERB1_Msk             (0x01UL << USB0_ENDPTPRIME_PERB1_Pos)                   /*!< USB0 ENDPTPRIME: PERB1 Mask             */
#define USB0_ENDPTPRIME_PERB2_Pos             2                                                       /*!< USB0 ENDPTPRIME: PERB2 Position         */
#define USB0_ENDPTPRIME_PERB2_Msk             (0x01UL << USB0_ENDPTPRIME_PERB2_Pos)                   /*!< USB0 ENDPTPRIME: PERB2 Mask             */
#define USB0_ENDPTPRIME_PERB3_Pos             3                                                       /*!< USB0 ENDPTPRIME: PERB3 Position         */
#define USB0_ENDPTPRIME_PERB3_Msk             (0x01UL << USB0_ENDPTPRIME_PERB3_Pos)                   /*!< USB0 ENDPTPRIME: PERB3 Mask             */
#define USB0_ENDPTPRIME_PERB4_Pos             4                                                       /*!< USB0 ENDPTPRIME: PERB4 Position         */
#define USB0_ENDPTPRIME_PERB4_Msk             (0x01UL << USB0_ENDPTPRIME_PERB4_Pos)                   /*!< USB0 ENDPTPRIME: PERB4 Mask             */
#define USB0_ENDPTPRIME_PERB5_Pos             5                                                       /*!< USB0 ENDPTPRIME: PERB5 Position         */
#define USB0_ENDPTPRIME_PERB5_Msk             (0x01UL << USB0_ENDPTPRIME_PERB5_Pos)                   /*!< USB0 ENDPTPRIME: PERB5 Mask             */
#define USB0_ENDPTPRIME_PETB0_Pos             16                                                      /*!< USB0 ENDPTPRIME: PETB0 Position         */
#define USB0_ENDPTPRIME_PETB0_Msk             (0x01UL << USB0_ENDPTPRIME_PETB0_Pos)                   /*!< USB0 ENDPTPRIME: PETB0 Mask             */
#define USB0_ENDPTPRIME_PETB1_Pos             17                                                      /*!< USB0 ENDPTPRIME: PETB1 Position         */
#define USB0_ENDPTPRIME_PETB1_Msk             (0x01UL << USB0_ENDPTPRIME_PETB1_Pos)                   /*!< USB0 ENDPTPRIME: PETB1 Mask             */
#define USB0_ENDPTPRIME_PETB2_Pos             18                                                      /*!< USB0 ENDPTPRIME: PETB2 Position         */
#define USB0_ENDPTPRIME_PETB2_Msk             (0x01UL << USB0_ENDPTPRIME_PETB2_Pos)                   /*!< USB0 ENDPTPRIME: PETB2 Mask             */
#define USB0_ENDPTPRIME_PETB3_Pos             19                                                      /*!< USB0 ENDPTPRIME: PETB3 Position         */
#define USB0_ENDPTPRIME_PETB3_Msk             (0x01UL << USB0_ENDPTPRIME_PETB3_Pos)                   /*!< USB0 ENDPTPRIME: PETB3 Mask             */
#define USB0_ENDPTPRIME_PETB4_Pos             20                                                      /*!< USB0 ENDPTPRIME: PETB4 Position         */
#define USB0_ENDPTPRIME_PETB4_Msk             (0x01UL << USB0_ENDPTPRIME_PETB4_Pos)                   /*!< USB0 ENDPTPRIME: PETB4 Mask             */
#define USB0_ENDPTPRIME_PETB5_Pos             21                                                      /*!< USB0 ENDPTPRIME: PETB5 Position         */
#define USB0_ENDPTPRIME_PETB5_Msk             (0x01UL << USB0_ENDPTPRIME_PETB5_Pos)                   /*!< USB0 ENDPTPRIME: PETB5 Mask             */

