MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -------------------------------  USB0_ENDPTCTRL0  ------------------------------ */
#define USB0_ENDPTCTRL0_RXS_Pos               0                                                       /*!< USB0 ENDPTCTRL0: RXS Position           */
#define USB0_ENDPTCTRL0_RXS_Msk               (0x01UL << USB0_ENDPTCTRL0_RXS_Pos)                     /*!< USB0 ENDPTCTRL0: RXS Mask               */
#define USB0_ENDPTCTRL0_RXT1_0_Pos            2                                                       /*!< USB0 ENDPTCTRL0: RXT1_0 Position        */
#define USB0_ENDPTCTRL0_RXT1_0_Msk            (0x03UL << USB0_ENDPTCTRL0_RXT1_0_Pos)                  /*!< USB0 ENDPTCTRL0: RXT1_0 Mask            */
#define USB0_ENDPTCTRL0_RXE_Pos               7                                                       /*!< USB0 ENDPTCTRL0: RXE Position           */
#define USB0_ENDPTCTRL0_RXE_Msk               (0x01UL << USB0_ENDPTCTRL0_RXE_Pos)                     /*!< USB0 ENDPTCTRL0: RXE Mask               */
#define USB0_ENDPTCTRL0_TXS_Pos               16                                                      /*!< USB0 ENDPTCTRL0: TXS Position           */
#define USB0_ENDPTCTRL0_TXS_Msk               (0x01UL << USB0_ENDPTCTRL0_TXS_Pos)                     /*!< USB0 ENDPTCTRL0: TXS Mask               */
#define USB0_ENDPTCTRL0_TXT1_0_Pos            18                                                      /*!< USB0 ENDPTCTRL0: TXT1_0 Position        */
#define USB0_ENDPTCTRL0_TXT1_0_Msk            (0x03UL << USB0_ENDPTCTRL0_TXT1_0_Pos)                  /*!< USB0 ENDPTCTRL0: TXT1_0 Mask            */
#define USB0_ENDPTCTRL0_TXE_Pos               23                                                      /*!< USB0 ENDPTCTRL0: TXE Position           */
#define USB0_ENDPTCTRL0_TXE_Msk               (0x01UL << USB0_ENDPTCTRL0_TXE_Pos)                     /*!< USB0 ENDPTCTRL0: TXE Mask               */

/* -------------------------------  USB0_ENDPTCTRL1  ------------------------------ */
#define USB0_ENDPTCTRL1_RXS_Pos               0                                                       /*!< USB0 ENDPTCTRL1: RXS Position           */
#define USB0_ENDPTCTRL1_RXS_Msk               (0x01UL << USB0_ENDPTCTRL1_RXS_Pos)                     /*!< USB0 ENDPTCTRL1: RXS Mask               */
#define USB0_ENDPTCTRL1_RXT_Pos               2                                                       /*!< USB0 ENDPTCTRL1: RXT Position           */
#define USB0_ENDPTCTRL1_RXT_Msk               (0x03UL << USB0_ENDPTCTRL1_RXT_Pos)                     /*!< USB0 ENDPTCTRL1: RXT Mask               */
#define USB0_ENDPTCTRL1_RXI_Pos               5                                                       /*!< USB0 ENDPTCTRL1: RXI Position           */
#define USB0_ENDPTCTRL1_RXI_Msk               (0x01UL << USB0_ENDPTCTRL1_RXI_Pos)                     /*!< USB0 ENDPTCTRL1: RXI Mask               */
#define USB0_ENDPTCTRL1_RXR_Pos               6                                                       /*!< USB0 ENDPTCTRL1: RXR Position           */
#define USB0_ENDPTCTRL1_RXR_Msk               (0x01UL << USB0_ENDPTCTRL1_RXR_Pos)                     /*!< USB0 ENDPTCTRL1: RXR Mask               */
#define USB0_ENDPTCTRL1_RXE_Pos               7                                                       /*!< USB0 ENDPTCTRL1: RXE Position           */
#define USB0_ENDPTCTRL1_RXE_Msk               (0x01UL << USB0_ENDPTCTRL1_RXE_Pos)                     /*!< USB0 ENDPTCTRL1: RXE Mask               */
#define USB0_ENDPTCTRL1_TXS_Pos               16                                                      /*!< USB0 ENDPTCTRL1: TXS Position           */
#define USB0_ENDPTCTRL1_TXS_Msk               (0x01UL << USB0_ENDPTCTRL1_TXS_Pos)                     /*!< USB0 ENDPTCTRL1: TXS Mask               */
#define USB0_ENDPTCTRL1_TXT1_0_Pos            18                                                      /*!< USB0 ENDPTCTRL1: TXT1_0 Position        */
#define USB0_ENDPTCTRL1_TXT1_0_Msk            (0x03UL << USB0_ENDPTCTRL1_TXT1_0_Pos)                  /*!< USB0 ENDPTCTRL1: TXT1_0 Mask            */
#define USB0_ENDPTCTRL1_TXI_Pos               21                                                      /*!< USB0 ENDPTCTRL1: TXI Position           */
#define USB0_ENDPTCTRL1_TXI_Msk               (0x01UL << USB0_ENDPTCTRL1_TXI_Pos)                     /*!< USB0 ENDPTCTRL1: TXI Mask               */
#define USB0_ENDPTCTRL1_TXR_Pos               22                                                      /*!< USB0 ENDPTCTRL1: TXR Position           */
#define USB0_ENDPTCTRL1_TXR_Msk               (0x01UL << USB0_ENDPTCTRL1_TXR_Pos)                     /*!< USB0 ENDPTCTRL1: TXR Mask               */
#define USB0_ENDPTCTRL1_TXE_Pos               23                                                      /*!< USB0 ENDPTCTRL1: TXE Position           */
#define USB0_ENDPTCTRL1_TXE_Msk               (0x01UL << USB0_ENDPTCTRL1_TXE_Pos)                     /*!< USB0 ENDPTCTRL1: TXE Mask               */

/* -------------------------------  USB0_ENDPTCTRL2  ------------------------------ */
#define USB0_ENDPTCTRL2_RXS_Pos               0                                                       /*!< USB0 ENDPTCTRL2: RXS Position           */
#define USB0_ENDPTCTRL2_RXS_Msk               (0x01UL << USB0_ENDPTCTRL2_RXS_Pos)                     /*!< USB0 ENDPTCTRL2: RXS Mask               */
#define USB0_ENDPTCTRL2_RXT_Pos               2                                                       /*!< USB0 ENDPTCTRL2: RXT Position           */
#define USB0_ENDPTCTRL2_RXT_Msk               (0x03UL << USB0_ENDPTCTRL2_RXT_Pos)                     /*!< USB0 ENDPTCTRL2: RXT Mask               */
#define USB0_ENDPTCTRL2_RXI_Pos               5                                                       /*!< USB0 ENDPTCTRL2: RXI Position           */
#define USB0_ENDPTCTRL2_RXI_Msk               (0x01UL << USB0_ENDPTCTRL2_RXI_Pos)                     /*!< USB0 ENDPTCTRL2: RXI Mask               */
#define USB0_ENDPTCTRL2_RXR_Pos               6                                                       /*!< USB0 ENDPTCTRL2: RXR Position           */
#define USB0_ENDPTCTRL2_RXR_Msk               (0x01UL << USB0_ENDPTCTRL2_RXR_Pos)                     /*!< USB0 ENDPTCTRL2: RXR Mask               */
#define USB0_ENDPTCTRL2_RXE_Pos               7                                                       /*!< USB0 ENDPTCTRL2: RXE Position           */
#define USB0_ENDPTCTRL2_RXE_Msk               (0x01UL << USB0_ENDPTCTRL2_RXE_Pos)                     /*!< USB0 ENDPTCTRL2: RXE Mask               */
#define USB0_ENDPTCTRL2_TXS_Pos               16                                                      /*!< USB0 ENDPTCTRL2: TXS Position           */
#define USB0_ENDPTCTRL2_TXS_Msk               (0x01UL << USB0_ENDPTCTRL2_TXS_Pos)                     /*!< USB0 ENDPTCTRL2: TXS Mask               */
#define USB0_ENDPTCTRL2_TXT1_0_Pos            18                                                      /*!< USB0 ENDPTCTRL2: TXT1_0 Position        */
#define USB0_ENDPTCTRL2_TXT1_0_Msk            (0x03UL << USB0_ENDPTCTRL2_TXT1_0_Pos)                  /*!< USB0 ENDPTCTRL2: TXT1_0 Mask            */
#define USB0_ENDPTCTRL2_TXI_Pos               21                                                      /*!< USB0 ENDPTCTRL2: TXI Position           */
#define USB0_ENDPTCTRL2_TXI_Msk               (0x01UL << USB0_ENDPTCTRL2_TXI_Pos)                     /*!< USB0 ENDPTCTRL2: TXI Mask               */
#define USB0_ENDPTCTRL2_TXR_Pos               22                                                      /*!< USB0 ENDPTCTRL2: TXR Position           */
#define USB0_ENDPTCTRL2_TXR_Msk               (0x01UL << USB0_ENDPTCTRL2_TXR_Pos)                     /*!< USB0 ENDPTCTRL2: TXR Mask               */
#define USB0_ENDPTCTRL2_TXE_Pos               23                                                      /*!< USB0 ENDPTCTRL2: TXE Position           */
#define USB0_ENDPTCTRL2_TXE_Msk               (0x01UL << USB0_ENDPTCTRL2_TXE_Pos)                     /*!< USB0 ENDPTCTRL2: TXE Mask               */

/* -------------------------------  USB0_ENDPTCTRL3  ------------------------------ */
#define USB0_ENDPTCTRL3_RXS_Pos               0                                                       /*!< USB0 ENDPTCTRL3: RXS Position           */
#define USB0_ENDPTCTRL3_RXS_Msk               (0x01UL << USB0_ENDPTCTRL3_RXS_Pos)                     /*!< USB0 ENDPTCTRL3: RXS Mask               */
#define USB0_ENDPTCTRL3_RXT_Pos               2                                                       /*!< USB0 ENDPTCTRL3: RXT Position           */
#define USB0_ENDPTCTRL3_RXT_Msk               (0x03UL << USB0_ENDPTCTRL3_RXT_Pos)                     /*!< USB0 ENDPTCTRL3: RXT Mask               */
#define USB0_ENDPTCTRL3_RXI_Pos               5                                                       /*!< USB0 ENDPTCTRL3: RXI Position           */
#define USB0_ENDPTCTRL3_RXI_Msk               (0x01UL << USB0_ENDPTCTRL3_RXI_Pos)                     /*!< USB0 ENDPTCTRL3: RXI Mask               */
#define USB0_ENDPTCTRL3_RXR_Pos               6                                                       /*!< USB0 ENDPTCTRL3: RXR Position           */
#define USB0_ENDPTCTRL3_RXR_Msk               (0x01UL << USB0_ENDPTCTRL3_RXR_Pos)                     /*!< USB0 ENDPTCTRL3: RXR Mask               */
#define USB0_ENDPTCTRL3_RXE_Pos               7                                                       /*!< USB0 ENDPTCTRL3: RXE Position           */
#define USB0_ENDPTCTRL3_RXE_Msk               (0x01UL << USB0_ENDPTCTRL3_RXE_Pos)                     /*!< USB0 ENDPTCTRL3: RXE Mask               */
#define USB0_ENDPTCTRL3_TXS_Pos               16                                                      /*!< USB0 ENDPTCTRL3: TXS Position           */
#define USB0_ENDPTCTRL3_TXS_Msk               (0x01UL << USB0_ENDPTCTRL3_TXS_Pos)                     /*!< USB0 ENDPTCTRL3: TXS Mask               */
#define USB0_ENDPTCTRL3_TXT1_0_Pos            18                                                      /*!< USB0 ENDPTCTRL3: TXT1_0 Position        */
#define USB0_ENDPTCTRL3_TXT1_0_Msk            (0x03UL << USB0_ENDPTCTRL3_TXT1_0_Pos)                  /*!< USB0 ENDPTCTRL3: TXT1_0 Mask            */
#define USB0_ENDPTCTRL3_TXI_Pos               21                                                      /*!< USB0 ENDPTCTRL3: TXI Position           */
#define USB0_ENDPTCTRL3_TXI_Msk               (0x01UL << USB0_ENDPTCTRL3_TXI_Pos)                     /*!< USB0 ENDPTCTRL3: TXI Mask               */
#define USB0_ENDPTCTRL3_TXR_Pos               22                                                      /*!< USB0 ENDPTCTRL3: TXR Position           */
#define USB0_ENDPTCTRL3_TXR_Msk               (0x01UL << USB0_ENDPTCTRL3_TXR_Pos)                     /*!< USB0 ENDPTCTRL3: TXR Mask               */
#define USB0_ENDPTCTRL3_TXE_Pos               23                                                      /*!< USB0 ENDPTCTRL3: TXE Position           */
#define USB0_ENDPTCTRL3_TXE_Msk               (0x01UL << USB0_ENDPTCTRL3_TXE_Pos)                     /*!< USB0 ENDPTCTRL3: TXE Mask               */

/* -------------------------------  USB0_ENDPTCTRL4  ------------------------------ */
#define USB0_ENDPTCTRL4_RXS_Pos               0                                                       /*!< USB0 ENDPTCTRL4: RXS Position           */
#define USB0_ENDPTCTRL4_RXS_Msk               (0x01UL << USB0_ENDPTCTRL4_RXS_Pos)                     /*!< USB0 ENDPTCTRL4: RXS Mask               */
#define USB0_ENDPTCTRL4_RXT_Pos               2                                                       /*!< USB0 ENDPTCTRL4: RXT Position           */
#define USB0_ENDPTCTRL4_RXT_Msk               (0x03UL << USB0_ENDPTCTRL4_RXT_Pos)                     /*!< USB0 ENDPTCTRL4: RXT Mask               */
#define USB0_ENDPTCTRL4_RXI_Pos               5                                                       /*!< USB0 ENDPTCTRL4: RXI Position           */
#define USB0_ENDPTCTRL4_RXI_Msk               (0x01UL << USB0_ENDPTCTRL4_RXI_Pos)                     /*!< USB0 ENDPTCTRL4: RXI Mask               */
#define USB0_ENDPTCTRL4_RXR_Pos               6                                                       /*!< USB0 ENDPTCTRL4: RXR Position           */
#define USB0_ENDPTCTRL4_RXR_Msk               (0x01UL << USB0_ENDPTCTRL4_RXR_Pos)                     /*!< USB0 ENDPTCTRL4: RXR Mask               */
#define USB0_ENDPTCTRL4_RXE_Pos               7                                                       /*!< USB0 ENDPTCTRL4: RXE Position           */
#define USB0_ENDPTCTRL4_RXE_Msk               (0x01UL << USB0_ENDPTCTRL4_RXE_Pos)                     /*!< USB0 ENDPTCTRL4: RXE Mask               */
#define USB0_ENDPTCTRL4_TXS_Pos               16                                                      /*!< USB0 ENDPTCTRL4: TXS Position           */
#define USB0_ENDPTCTRL4_TXS_Msk               (0x01UL << USB0_ENDPTCTRL4_TXS_Pos)                     /*!< USB0 ENDPTCTRL4: TXS Mask               */
#define USB0_ENDPTCTRL4_TXT1_0_Pos            18                                                      /*!< USB0 ENDPTCTRL4: TXT1_0 Position        */
#define USB0_ENDPTCTRL4_TXT1_0_Msk            (0x03UL << USB0_ENDPTCTRL4_TXT1_0_Pos)                  /*!< USB0 ENDPTCTRL4: TXT1_0 Mask            */
#define USB0_ENDPTCTRL4_TXI_Pos               21                                                      /*!< USB0 ENDPTCTRL4: TXI Position           */
#define USB0_ENDPTCTRL4_TXI_Msk               (0x01UL << USB0_ENDPTCTRL4_TXI_Pos)                     /*!< USB0 ENDPTCTRL4: TXI Mask               */
#define USB0_ENDPTCTRL4_TXR_Pos               22                                                      /*!< USB0 ENDPTCTRL4: TXR Position           */
#define USB0_ENDPTCTRL4_TXR_Msk               (0x01UL << USB0_ENDPTCTRL4_TXR_Pos)                     /*!< USB0 ENDPTCTRL4: TXR Mask               */
#define USB0_ENDPTCTRL4_TXE_Pos               23                                                      /*!< USB0 ENDPTCTRL4: TXE Position           */
#define USB0_ENDPTCTRL4_TXE_Msk               (0x01UL << USB0_ENDPTCTRL4_TXE_Pos)                     /*!< USB0 ENDPTCTRL4: TXE Mask               */

/* -------------------------------  USB0_ENDPTCTRL5  ------------------------------ */
#define USB0_ENDPTCTRL5_RXS_Pos               0                                                       /*!< USB0 ENDPTCTRL5: RXS Position           */
#define USB0_ENDPTCTRL5_RXS_Msk               (0x01UL << USB0_ENDPTCTRL5_RXS_Pos)                     /*!< USB0 ENDPTCTRL5: RXS Mask               */
#define USB0_ENDPTCTRL5_RXT_Pos               2                                                       /*!< USB0 ENDPTCTRL5: RXT Position           */
#define USB0_ENDPTCTRL5_RXT_Msk               (0x03UL << USB0_ENDPTCTRL5_RXT_Pos)                     /*!< USB0 ENDPTCTRL5: RXT Mask               */
#define USB0_ENDPTCTRL5_RXI_Pos               5                                                       /*!< USB0 ENDPTCTRL5: RXI Position           */
#define USB0_ENDPTCTRL5_RXI_Msk               (0x01UL << USB0_ENDPTCTRL5_RXI_Pos)                     /*!< USB0 ENDPTCTRL5: RXI Mask               */
#define USB0_ENDPTCTRL5_RXR_Pos               6                                                       /*!< USB0 ENDPTCTRL5: RXR Position           */
#define USB0_ENDPTCTRL5_RXR_Msk               (0x01UL << USB0_ENDPTCTRL5_RXR_Pos)                     /*!< USB0 ENDPTCTRL5: RXR Mask               */
#define USB0_ENDPTCTRL5_RXE_Pos               7                                                       /*!< USB0 ENDPTCTRL5: RXE Position           */
#define USB0_ENDPTCTRL5_RXE_Msk               (0x01UL << USB0_ENDPTCTRL5_RXE_Pos)                     /*!< USB0 ENDPTCTRL5: RXE Mask               */
#define USB0_ENDPTCTRL5_TXS_Pos               16                                                      /*!< USB0 ENDPTCTRL5: TXS Position           */
#define USB0_ENDPTCTRL5_TXS_Msk               (0x01UL << USB0_ENDPTCTRL5_TXS_Pos)                     /*!< USB0 ENDPTCTRL5: TXS Mask               */
#define USB0_ENDPTCTRL5_TXT1_0_Pos            18                                                      /*!< USB0 ENDPTCTRL5: TXT1_0 Position        */
#define USB0_ENDPTCTRL5_TXT1_0_Msk            (0x03UL << USB0_ENDPTCTRL5_TXT1_0_Pos)                  /*!< USB0 ENDPTCTRL5: TXT1_0 Mask            */
#define USB0_ENDPTCTRL5_TXI_Pos               21                                                      /*!< USB0 ENDPTCTRL5: TXI Position           */
#define USB0_ENDPTCTRL5_TXI_Msk               (0x01UL << USB0_ENDPTCTRL5_TXI_Pos)                     /*!< USB0 ENDPTCTRL5: TXI Mask               */
#define USB0_ENDPTCTRL5_TXR_Pos               22                                                      /*!< USB0 ENDPTCTRL5: TXR Position           */
#define USB0_ENDPTCTRL5_TXR_Msk               (0x01UL << USB0_ENDPTCTRL5_TXR_Pos)                     /*!< USB0 ENDPTCTRL5: TXR Mask               */
#define USB0_ENDPTCTRL5_TXE_Pos               23                                                      /*!< USB0 ENDPTCTRL5: TXE Position           */
#define USB0_ENDPTCTRL5_TXE_Msk               (0x01UL << USB0_ENDPTCTRL5_TXE_Pos)                     /*!< USB0 ENDPTCTRL5: TXE Mask               */


/* ================================================================================ */
/* ================          struct 'USB1' Position & Mask         ================ */
/* ================================================================================ */


