MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* --------------------------------  USB1_USBCMD_H  ------------------------------- */
#define USB1_USBCMD_H_RS_Pos                  0                                                       /*!< USB1 USBCMD_H: RS Position              */
#define USB1_USBCMD_H_RS_Msk                  (0x01UL << USB1_USBCMD_H_RS_Pos)                        /*!< USB1 USBCMD_H: RS Mask                  */
#define USB1_USBCMD_H_RST_Pos                 1                                                       /*!< USB1 USBCMD_H: RST Position             */
#define USB1_USBCMD_H_RST_Msk                 (0x01UL << USB1_USBCMD_H_RST_Pos)                       /*!< USB1 USBCMD_H: RST Mask                 */
#define USB1_USBCMD_H_FS0_Pos                 2                                                       /*!< USB1 USBCMD_H: FS0 Position             */
#define USB1_USBCMD_H_FS0_Msk                 (0x01UL << USB1_USBCMD_H_FS0_Pos)                       /*!< USB1 USBCMD_H: FS0 Mask                 */
#define USB1_USBCMD_H_FS1_Pos                 3                                                       /*!< USB1 USBCMD_H: FS1 Position             */
#define USB1_USBCMD_H_FS1_Msk                 (0x01UL << USB1_USBCMD_H_FS1_Pos)                       /*!< USB1 USBCMD_H: FS1 Mask                 */
#define USB1_USBCMD_H_PSE_Pos                 4                                                       /*!< USB1 USBCMD_H: PSE Position             */
#define USB1_USBCMD_H_PSE_Msk                 (0x01UL << USB1_USBCMD_H_PSE_Pos)                       /*!< USB1 USBCMD_H: PSE Mask                 */
#define USB1_USBCMD_H_ASE_Pos                 5                                                       /*!< USB1 USBCMD_H: ASE Position             */
#define USB1_USBCMD_H_ASE_Msk                 (0x01UL << USB1_USBCMD_H_ASE_Pos)                       /*!< USB1 USBCMD_H: ASE Mask                 */
#define USB1_USBCMD_H_IAA_Pos                 6                                                       /*!< USB1 USBCMD_H: IAA Position             */
#define USB1_USBCMD_H_IAA_Msk                 (0x01UL << USB1_USBCMD_H_IAA_Pos)                       /*!< USB1 USBCMD_H: IAA Mask                 */
#define USB1_USBCMD_H_ASP1_0_Pos              8                                                       /*!< USB1 USBCMD_H: ASP1_0 Position          */
#define USB1_USBCMD_H_ASP1_0_Msk              (0x03UL << USB1_USBCMD_H_ASP1_0_Pos)                    /*!< USB1 USBCMD_H: ASP1_0 Mask              */
#define USB1_USBCMD_H_ASPE_Pos                11                                                      /*!< USB1 USBCMD_H: ASPE Position            */
#define USB1_USBCMD_H_ASPE_Msk                (0x01UL << USB1_USBCMD_H_ASPE_Pos)                      /*!< USB1 USBCMD_H: ASPE Mask                */
#define USB1_USBCMD_H_FS2_Pos                 15                                                      /*!< USB1 USBCMD_H: FS2 Position             */
#define USB1_USBCMD_H_FS2_Msk                 (0x01UL << USB1_USBCMD_H_FS2_Pos)                       /*!< USB1 USBCMD_H: FS2 Mask                 */
#define USB1_USBCMD_H_ITC_Pos                 16                                                      /*!< USB1 USBCMD_H: ITC Position             */
#define USB1_USBCMD_H_ITC_Msk                 (0x000000ffUL << USB1_USBCMD_H_ITC_Pos)                 /*!< USB1 USBCMD_H: ITC Mask                 */

/* --------------------------------  USB1_USBSTS_D  ------------------------------- */
#define USB1_USBSTS_D_UI_Pos                  0                                                       /*!< USB1 USBSTS_D: UI Position              */
#define USB1_USBSTS_D_UI_Msk                  (0x01UL << USB1_USBSTS_D_UI_Pos)                        /*!< USB1 USBSTS_D: UI Mask                  */
#define USB1_USBSTS_D_UEI_Pos                 1                                                       /*!< USB1 USBSTS_D: UEI Position             */
#define USB1_USBSTS_D_UEI_Msk                 (0x01UL << USB1_USBSTS_D_UEI_Pos)                       /*!< USB1 USBSTS_D: UEI Mask                 */
#define USB1_USBSTS_D_PCI_Pos                 2                                                       /*!< USB1 USBSTS_D: PCI Position             */
#define USB1_USBSTS_D_PCI_Msk                 (0x01UL << USB1_USBSTS_D_PCI_Pos)                       /*!< USB1 USBSTS_D: PCI Mask                 */
#define USB1_USBSTS_D_URI_Pos                 6                                                       /*!< USB1 USBSTS_D: URI Position             */
#define USB1_USBSTS_D_URI_Msk                 (0x01UL << USB1_USBSTS_D_URI_Pos)                       /*!< USB1 USBSTS_D: URI Mask                 */
#define USB1_USBSTS_D_SRI_Pos                 7                                                       /*!< USB1 USBSTS_D: SRI Position             */
#define USB1_USBSTS_D_SRI_Msk                 (0x01UL << USB1_USBSTS_D_SRI_Pos)                       /*!< USB1 USBSTS_D: SRI Mask                 */
#define USB1_USBSTS_D_SLI_Pos                 8                                                       /*!< USB1 USBSTS_D: SLI Position             */
#define USB1_USBSTS_D_SLI_Msk                 (0x01UL << USB1_USBSTS_D_SLI_Pos)                       /*!< USB1 USBSTS_D: SLI Mask                 */
#define USB1_USBSTS_D_NAKI_Pos                16                                                      /*!< USB1 USBSTS_D: NAKI Position            */
#define USB1_USBSTS_D_NAKI_Msk                (0x01UL << USB1_USBSTS_D_NAKI_Pos)                      /*!< USB1 USBSTS_D: NAKI Mask                */

/* --------------------------------  USB1_USBSTS_H  ------------------------------- */
#define USB1_USBSTS_H_UI_Pos                  0                                                       /*!< USB1 USBSTS_H: UI Position              */
#define USB1_USBSTS_H_UI_Msk                  (0x01UL << USB1_USBSTS_H_UI_Pos)                        /*!< USB1 USBSTS_H: UI Mask                  */
#define USB1_USBSTS_H_UEI_Pos                 1                                                       /*!< USB1 USBSTS_H: UEI Position             */
#define USB1_USBSTS_H_UEI_Msk                 (0x01UL << USB1_USBSTS_H_UEI_Pos)                       /*!< USB1 USBSTS_H: UEI Mask                 */
#define USB1_USBSTS_H_PCI_Pos                 2                                                       /*!< USB1 USBSTS_H: PCI Position             */
#define USB1_USBSTS_H_PCI_Msk                 (0x01UL << USB1_USBSTS_H_PCI_Pos)                       /*!< USB1 USBSTS_H: PCI Mask                 */
#define USB1_USBSTS_H_FRI_Pos                 3                                                       /*!< USB1 USBSTS_H: FRI Position             */
#define USB1_USBSTS_H_FRI_Msk                 (0x01UL << USB1_USBSTS_H_FRI_Pos)                       /*!< USB1 USBSTS_H: FRI Mask                 */
#define USB1_USBSTS_H_AAI_Pos                 5                                                       /*!< USB1 USBSTS_H: AAI Position             */
#define USB1_USBSTS_H_AAI_Msk                 (0x01UL << USB1_USBSTS_H_AAI_Pos)                       /*!< USB1 USBSTS_H: AAI Mask                 */
#define USB1_USBSTS_H_SRI_Pos                 7                                                       /*!< USB1 USBSTS_H: SRI Position             */
#define USB1_USBSTS_H_SRI_Msk                 (0x01UL << USB1_USBSTS_H_SRI_Pos)                       /*!< USB1 USBSTS_H: SRI Mask                 */
#define USB1_USBSTS_H_SLI_Pos                 8                                                       /*!< USB1 USBSTS_H: SLI Position             */
#define USB1_USBSTS_H_SLI_Msk                 (0x01UL << USB1_USBSTS_H_SLI_Pos)                       /*!< USB1 USBSTS_H: SLI Mask                 */
#define USB1_USBSTS_H_HCH_Pos                 12                                                      /*!< USB1 USBSTS_H: HCH Position             */
#define USB1_USBSTS_H_HCH_Msk                 (0x01UL << USB1_USBSTS_H_HCH_Pos)                       /*!< USB1 USBSTS_H: HCH Mask                 */
#define USB1_USBSTS_H_RCL_Pos                 13                                                      /*!< USB1 USBSTS_H: RCL Position             */
#define USB1_USBSTS_H_RCL_Msk                 (0x01UL << USB1_USBSTS_H_RCL_Pos)                       /*!< USB1 USBSTS_H: RCL Mask                 */
#define USB1_USBSTS_H_PS_Pos                  14                                                      /*!< USB1 USBSTS_H: PS Position              */
#define USB1_USBSTS_H_PS_Msk                  (0x01UL << USB1_USBSTS_H_PS_Pos)                        /*!< USB1 USBSTS_H: PS Mask                  */
#define USB1_USBSTS_H_AS_Pos                  15                                                      /*!< USB1 USBSTS_H: AS Position              */
#define USB1_USBSTS_H_AS_Msk                  (0x01UL << USB1_USBSTS_H_AS_Pos)                        /*!< USB1 USBSTS_H: AS Mask                  */
#define USB1_USBSTS_H_UAI_Pos                 18                                                      /*!< USB1 USBSTS_H: UAI Position             */
#define USB1_USBSTS_H_UAI_Msk                 (0x01UL << USB1_USBSTS_H_UAI_Pos)                       /*!< USB1 USBSTS_H: UAI Mask                 */
#define USB1_USBSTS_H_UPI_Pos                 19                                                      /*!< USB1 USBSTS_H: UPI Position             */
#define USB1_USBSTS_H_UPI_Msk                 (0x01UL << USB1_USBSTS_H_UPI_Pos)                       /*!< USB1 USBSTS_H: UPI Mask                 */

