MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -------------------------------  USB1_USBINTR_D  ------------------------------- */
#define USB1_USBINTR_D_UE_Pos                 0                                                       /*!< USB1 USBINTR_D: UE Position             */
#define USB1_USBINTR_D_UE_Msk                 (0x01UL << USB1_USBINTR_D_UE_Pos)                       /*!< USB1 USBINTR_D: UE Mask                 */
#define USB1_USBINTR_D_UEE_Pos                1                                                       /*!< USB1 USBINTR_D: UEE Position            */
#define USB1_USBINTR_D_UEE_Msk                (0x01UL << USB1_USBINTR_D_UEE_Pos)                      /*!< USB1 USBINTR_D: UEE Mask                */
#define USB1_USBINTR_D_PCE_Pos                2                                                       /*!< USB1 USBINTR_D: PCE Position            */
#define USB1_USBINTR_D_PCE_Msk                (0x01UL << USB1_USBINTR_D_PCE_Pos)                      /*!< USB1 USBINTR_D: PCE Mask                */
#define USB1_USBINTR_D_URE_Pos                6                                                       /*!< USB1 USBINTR_D: URE Position            */
#define USB1_USBINTR_D_URE_Msk                (0x01UL << USB1_USBINTR_D_URE_Pos)                      /*!< USB1 USBINTR_D: URE Mask                */
#define USB1_USBINTR_D_SRE_Pos                7                                                       /*!< USB1 USBINTR_D: SRE Position            */
#define USB1_USBINTR_D_SRE_Msk                (0x01UL << USB1_USBINTR_D_SRE_Pos)                      /*!< USB1 USBINTR_D: SRE Mask                */
#define USB1_USBINTR_D_SLE_Pos                8                                                       /*!< USB1 USBINTR_D: SLE Position            */
#define USB1_USBINTR_D_SLE_Msk                (0x01UL << USB1_USBINTR_D_SLE_Pos)                      /*!< USB1 USBINTR_D: SLE Mask                */
#define USB1_USBINTR_D_NAKE_Pos               16                                                      /*!< USB1 USBINTR_D: NAKE Position           */
#define USB1_USBINTR_D_NAKE_Msk               (0x01UL << USB1_USBINTR_D_NAKE_Pos)                     /*!< USB1 USBINTR_D: NAKE Mask               */
#define USB1_USBINTR_D_UAIE_Pos               18                                                      /*!< USB1 USBINTR_D: UAIE Position           */
#define USB1_USBINTR_D_UAIE_Msk               (0x01UL << USB1_USBINTR_D_UAIE_Pos)                     /*!< USB1 USBINTR_D: UAIE Mask               */
#define USB1_USBINTR_D_UPIA_Pos               19                                                      /*!< USB1 USBINTR_D: UPIA Position           */
#define USB1_USBINTR_D_UPIA_Msk               (0x01UL << USB1_USBINTR_D_UPIA_Pos)                     /*!< USB1 USBINTR_D: UPIA Mask               */

/* -------------------------------  USB1_USBINTR_H  ------------------------------- */
#define USB1_USBINTR_H_UE_Pos                 0                                                       /*!< USB1 USBINTR_H: UE Position             */
#define USB1_USBINTR_H_UE_Msk                 (0x01UL << USB1_USBINTR_H_UE_Pos)                       /*!< USB1 USBINTR_H: UE Mask                 */
#define USB1_USBINTR_H_UEE_Pos                1                                                       /*!< USB1 USBINTR_H: UEE Position            */
#define USB1_USBINTR_H_UEE_Msk                (0x01UL << USB1_USBINTR_H_UEE_Pos)                      /*!< USB1 USBINTR_H: UEE Mask                */
#define USB1_USBINTR_H_PCE_Pos                2                                                       /*!< USB1 USBINTR_H: PCE Position            */
#define USB1_USBINTR_H_PCE_Msk                (0x01UL << USB1_USBINTR_H_PCE_Pos)                      /*!< USB1 USBINTR_H: PCE Mask                */
#define USB1_USBINTR_H_FRE_Pos                3                                                       /*!< USB1 USBINTR_H: FRE Position            */
#define USB1_USBINTR_H_FRE_Msk                (0x01UL << USB1_USBINTR_H_FRE_Pos)                      /*!< USB1 USBINTR_H: FRE Mask                */
#define USB1_USBINTR_H_AAE_Pos                5                                                       /*!< USB1 USBINTR_H: AAE Position            */
#define USB1_USBINTR_H_AAE_Msk                (0x01UL << USB1_USBINTR_H_AAE_Pos)                      /*!< USB1 USBINTR_H: AAE Mask                */
#define USB1_USBINTR_H_SRE_Pos                7                                                       /*!< USB1 USBINTR_H: SRE Position            */
#define USB1_USBINTR_H_SRE_Msk                (0x01UL << USB1_USBINTR_H_SRE_Pos)                      /*!< USB1 USBINTR_H: SRE Mask                */
#define USB1_USBINTR_H_UAIE_Pos               18                                                      /*!< USB1 USBINTR_H: UAIE Position           */
#define USB1_USBINTR_H_UAIE_Msk               (0x01UL << USB1_USBINTR_H_UAIE_Pos)                     /*!< USB1 USBINTR_H: UAIE Mask               */
#define USB1_USBINTR_H_UPIA_Pos               19                                                      /*!< USB1 USBINTR_H: UPIA Position           */
#define USB1_USBINTR_H_UPIA_Msk               (0x01UL << USB1_USBINTR_H_UPIA_Pos)                     /*!< USB1 USBINTR_H: UPIA Mask               */

/* -------------------------------  USB1_FRINDEX_D  ------------------------------- */
#define USB1_FRINDEX_D_FRINDEX2_0_Pos         0                                                       /*!< USB1 FRINDEX_D: FRINDEX2_0 Position     */
#define USB1_FRINDEX_D_FRINDEX2_0_Msk         (0x07UL << USB1_FRINDEX_D_FRINDEX2_0_Pos)               /*!< USB1 FRINDEX_D: FRINDEX2_0 Mask         */
#define USB1_FRINDEX_D_FRINDEX13_3_Pos        3                                                       /*!< USB1 FRINDEX_D: FRINDEX13_3 Position    */
#define USB1_FRINDEX_D_FRINDEX13_3_Msk        (0x000007ffUL << USB1_FRINDEX_D_FRINDEX13_3_Pos)        /*!< USB1 FRINDEX_D: FRINDEX13_3 Mask        */

/* -------------------------------  USB1_FRINDEX_H  ------------------------------- */
#define USB1_FRINDEX_H_FRINDEX2_0_Pos         0                                                       /*!< USB1 FRINDEX_H: FRINDEX2_0 Position     */
#define USB1_FRINDEX_H_FRINDEX2_0_Msk         (0x07UL << USB1_FRINDEX_H_FRINDEX2_0_Pos)               /*!< USB1 FRINDEX_H: FRINDEX2_0 Mask         */
#define USB1_FRINDEX_H_FRINDEX12_3_Pos        3                                                       /*!< USB1 FRINDEX_H: FRINDEX12_3 Position    */
#define USB1_FRINDEX_H_FRINDEX12_3_Msk        (0x000003ffUL << USB1_FRINDEX_H_FRINDEX12_3_Pos)        /*!< USB1 FRINDEX_H: FRINDEX12_3 Mask        */

/* -------------------------------  USB1_DEVICEADDR  ------------------------------ */
#define USB1_DEVICEADDR_USBADRA_Pos           24                                                      /*!< USB1 DEVICEADDR: USBADRA Position       */
#define USB1_DEVICEADDR_USBADRA_Msk           (0x01UL << USB1_DEVICEADDR_USBADRA_Pos)                 /*!< USB1 DEVICEADDR: USBADRA Mask           */
#define USB1_DEVICEADDR_USBADR_Pos            25                                                      /*!< USB1 DEVICEADDR: USBADR Position        */
#define USB1_DEVICEADDR_USBADR_Msk            (0x7fUL << USB1_DEVICEADDR_USBADR_Pos)                  /*!< USB1 DEVICEADDR: USBADR Mask            */

/* ----------------------------  USB1_PERIODICLISTBASE  --------------------------- */
#define USB1_PERIODICLISTBASE_PERBASE31_12_Pos 12                                                     /*!< USB1 PERIODICLISTBASE: PERBASE31_12 Position */
#define USB1_PERIODICLISTBASE_PERBASE31_12_Msk (0x000fffffUL << USB1_PERIODICLISTBASE_PERBASE31_12_Pos)/*!< USB1 PERIODICLISTBASE: PERBASE31_12 Mask */

/* ----------------------------  USB1_ENDPOINTLISTADDR  --------------------------- */
#define USB1_ENDPOINTLISTADDR_EPBASE31_11_Pos 11                                                      /*!< USB1 ENDPOINTLISTADDR: EPBASE31_11 Position */
#define USB1_ENDPOINTLISTADDR_EPBASE31_11_Msk (0x001fffffUL << USB1_ENDPOINTLISTADDR_EPBASE31_11_Pos) /*!< USB1 ENDPOINTLISTADDR: EPBASE31_11 Mask */

/* -----------------------------  USB1_ASYNCLISTADDR  ----------------------------- */
#define USB1_ASYNCLISTADDR_ASYBASE31_5_Pos    5                                                       /*!< USB1 ASYNCLISTADDR: ASYBASE31_5 Position */
#define USB1_ASYNCLISTADDR_ASYBASE31_5_Msk    (0x07ffffffUL << USB1_ASYNCLISTADDR_ASYBASE31_5_Pos)    /*!< USB1 ASYNCLISTADDR: ASYBASE31_5 Mask    */

/* ---------------------------------  USB1_TTCTRL  -------------------------------- */
#define USB1_TTCTRL_TTHA_Pos                  24                                                      /*!< USB1 TTCTRL: TTHA Position              */
#define USB1_TTCTRL_TTHA_Msk                  (0x7fUL << USB1_TTCTRL_TTHA_Pos)                        /*!< USB1 TTCTRL: TTHA Mask                  */

/* -------------------------------  USB1_BURSTSIZE  ------------------------------- */
#define USB1_BURSTSIZE_RXPBURST_Pos           0                                                       /*!< USB1 BURSTSIZE: RXPBURST Position       */
#define USB1_BURSTSIZE_RXPBURST_Msk           (0x000000ffUL << USB1_BURSTSIZE_RXPBURST_Pos)           /*!< USB1 BURSTSIZE: RXPBURST Mask           */
#define USB1_BURSTSIZE_TXPBURST_Pos           8                                                       /*!< USB1 BURSTSIZE: TXPBURST Position       */
#define USB1_BURSTSIZE_TXPBURST_Msk           (0x000000ffUL << USB1_BURSTSIZE_TXPBURST_Pos)           /*!< USB1 BURSTSIZE: TXPBURST Mask           */

/* ------------------------------  USB1_TXFILLTUNING  ----------------------------- */
#define USB1_TXFILLTUNING_TXSCHOH_Pos         0                                                       /*!< USB1 TXFILLTUNING: TXSCHOH Position     */
#define USB1_TXFILLTUNING_TXSCHOH_Msk         (0x000000ffUL << USB1_TXFILLTUNING_TXSCHOH_Pos)         /*!< USB1 TXFILLTUNING: TXSCHOH Mask         */
#define USB1_TXFILLTUNING_TXSCHEATLTH_Pos     8                                                       /*!< USB1 TXFILLTUNING: TXSCHEATLTH Position */
#define USB1_TXFILLTUNING_TXSCHEATLTH_Msk     (0x1fUL << USB1_TXFILLTUNING_TXSCHEATLTH_Pos)           /*!< USB1 TXFILLTUNING: TXSCHEATLTH Mask     */
#define USB1_TXFILLTUNING_TXFIFOTHRES_Pos     16                                                      /*!< USB1 TXFILLTUNING: TXFIFOTHRES Position */
#define USB1_TXFILLTUNING_TXFIFOTHRES_Msk     (0x3fUL << USB1_TXFILLTUNING_TXFIFOTHRES_Pos)           /*!< USB1 TXFILLTUNING: TXFIFOTHRES Mask     */

/* ------------------------------  USB1_ULPIVIEWPORT  ----------------------------- */
#define USB1_ULPIVIEWPORT_ULPIDATWR_Pos       0                                                       /*!< USB1 ULPIVIEWPORT: ULPIDATWR Position   */
#define USB1_ULPIVIEWPORT_ULPIDATWR_Msk       (0x000000ffUL << USB1_ULPIVIEWPORT_ULPIDATWR_Pos)       /*!< USB1 ULPIVIEWPORT: ULPIDATWR Mask       */
#define USB1_ULPIVIEWPORT_ULPIDATRD_Pos       8                                                       /*!< USB1 ULPIVIEWPORT: ULPIDATRD Position   */
#define USB1_ULPIVIEWPORT_ULPIDATRD_Msk       (0x000000ffUL << USB1_ULPIVIEWPORT_ULPIDATRD_Pos)       /*!< USB1 ULPIVIEWPORT: ULPIDATRD Mask       */
#define USB1_ULPIVIEWPORT_ULPIADDR_Pos        16                                                      /*!< USB1 ULPIVIEWPORT: ULPIADDR Position    */
#define USB1_ULPIVIEWPORT_ULPIADDR_Msk        (0x000000ffUL << USB1_ULPIVIEWPORT_ULPIADDR_Pos)        /*!< USB1 ULPIVIEWPORT: ULPIADDR Mask        */
#define USB1_ULPIVIEWPORT_ULPIPORT_Pos        24                                                      /*!< USB1 ULPIVIEWPORT: ULPIPORT Position    */
#define USB1_ULPIVIEWPORT_ULPIPORT_Msk        (0x07UL << USB1_ULPIVIEWPORT_ULPIPORT_Pos)              /*!< USB1 ULPIVIEWPORT: ULPIPORT Mask        */
#define USB1_ULPIVIEWPORT_ULPISS_Pos          27                                                      /*!< USB1 ULPIVIEWPORT: ULPISS Position      */
#define USB1_ULPIVIEWPORT_ULPISS_Msk          (0x01UL << USB1_ULPIVIEWPORT_ULPISS_Pos)                /*!< USB1 ULPIVIEWPORT: ULPISS Mask          */
#define USB1_ULPIVIEWPORT_ULPIRW_Pos          29                                                      /*!< USB1 ULPIVIEWPORT: ULPIRW Position      */
#define USB1_ULPIVIEWPORT_ULPIRW_Msk          (0x01UL << USB1_ULPIVIEWPORT_ULPIRW_Pos)                /*!< USB1 ULPIVIEWPORT: ULPIRW Mask          */
#define USB1_ULPIVIEWPORT_ULPIRUN_Pos         30                                                      /*!< USB1 ULPIVIEWPORT: ULPIRUN Position     */
#define USB1_ULPIVIEWPORT_ULPIRUN_Msk         (0x01UL << USB1_ULPIVIEWPORT_ULPIRUN_Pos)               /*!< USB1 ULPIVIEWPORT: ULPIRUN Mask         */
#define USB1_ULPIVIEWPORT_ULPIWU_Pos          31                                                      /*!< USB1 ULPIVIEWPORT: ULPIWU Position      */
#define USB1_ULPIVIEWPORT_ULPIWU_Msk          (0x01UL << USB1_ULPIVIEWPORT_ULPIWU_Pos)                /*!< USB1 ULPIVIEWPORT: ULPIWU Mask          */

