MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -------------------------------  USB1_BINTERVAL  ------------------------------- */
#define USB1_BINTERVAL_BINT_Pos               0                                                       /*!< USB1 BINTERVAL: BINT Position           */
#define USB1_BINTERVAL_BINT_Msk               (0x0fUL << USB1_BINTERVAL_BINT_Pos)                     /*!< USB1 BINTERVAL: BINT Mask               */

/* --------------------------------  USB1_ENDPTNAK  ------------------------------- */
#define USB1_ENDPTNAK_EPRN0_Pos               0                                                       /*!< USB1 ENDPTNAK: EPRN0 Position           */
#define USB1_ENDPTNAK_EPRN0_Msk               (0x01UL << USB1_ENDPTNAK_EPRN0_Pos)                     /*!< USB1 ENDPTNAK: EPRN0 Mask               */
#define USB1_ENDPTNAK_EPRN1_Pos               1                                                       /*!< USB1 ENDPTNAK: EPRN1 Position           */
#define USB1_ENDPTNAK_EPRN1_Msk               (0x01UL << USB1_ENDPTNAK_EPRN1_Pos)                     /*!< USB1 ENDPTNAK: EPRN1 Mask               */
#define USB1_ENDPTNAK_EPRN2_Pos               2                                                       /*!< USB1 ENDPTNAK: EPRN2 Position           */
#define USB1_ENDPTNAK_EPRN2_Msk               (0x01UL << USB1_ENDPTNAK_EPRN2_Pos)                     /*!< USB1 ENDPTNAK: EPRN2 Mask               */
#define USB1_ENDPTNAK_EPRN3_Pos               3                                                       /*!< USB1 ENDPTNAK: EPRN3 Position           */
#define USB1_ENDPTNAK_EPRN3_Msk               (0x01UL << USB1_ENDPTNAK_EPRN3_Pos)                     /*!< USB1 ENDPTNAK: EPRN3 Mask               */
#define USB1_ENDPTNAK_EPTN16_Pos              16                                                      /*!< USB1 ENDPTNAK: EPTN16 Position          */
#define USB1_ENDPTNAK_EPTN16_Msk              (0x01UL << USB1_ENDPTNAK_EPTN16_Pos)                    /*!< USB1 ENDPTNAK: EPTN16 Mask              */
#define USB1_ENDPTNAK_EPTN17_Pos              17                                                      /*!< USB1 ENDPTNAK: EPTN17 Position          */
#define USB1_ENDPTNAK_EPTN17_Msk              (0x01UL << USB1_ENDPTNAK_EPTN17_Pos)                    /*!< USB1 ENDPTNAK: EPTN17 Mask              */
#define USB1_ENDPTNAK_EPTN18_Pos              18                                                      /*!< USB1 ENDPTNAK: EPTN18 Position          */
#define USB1_ENDPTNAK_EPTN18_Msk              (0x01UL << USB1_ENDPTNAK_EPTN18_Pos)                    /*!< USB1 ENDPTNAK: EPTN18 Mask              */
#define USB1_ENDPTNAK_EPTN19_Pos              19                                                      /*!< USB1 ENDPTNAK: EPTN19 Position          */
#define USB1_ENDPTNAK_EPTN19_Msk              (0x01UL << USB1_ENDPTNAK_EPTN19_Pos)                    /*!< USB1 ENDPTNAK: EPTN19 Mask              */

/* -------------------------------  USB1_ENDPTNAKEN  ------------------------------ */
#define USB1_ENDPTNAKEN_EPRNE0_Pos            0                                                       /*!< USB1 ENDPTNAKEN: EPRNE0 Position        */
#define USB1_ENDPTNAKEN_EPRNE0_Msk            (0x01UL << USB1_ENDPTNAKEN_EPRNE0_Pos)                  /*!< USB1 ENDPTNAKEN: EPRNE0 Mask            */
#define USB1_ENDPTNAKEN_EPRNE1_Pos            1                                                       /*!< USB1 ENDPTNAKEN: EPRNE1 Position        */
#define USB1_ENDPTNAKEN_EPRNE1_Msk            (0x01UL << USB1_ENDPTNAKEN_EPRNE1_Pos)                  /*!< USB1 ENDPTNAKEN: EPRNE1 Mask            */
#define USB1_ENDPTNAKEN_EPRNE2_Pos            2                                                       /*!< USB1 ENDPTNAKEN: EPRNE2 Position        */
#define USB1_ENDPTNAKEN_EPRNE2_Msk            (0x01UL << USB1_ENDPTNAKEN_EPRNE2_Pos)                  /*!< USB1 ENDPTNAKEN: EPRNE2 Mask            */
#define USB1_ENDPTNAKEN_EPRNE3_Pos            3                                                       /*!< USB1 ENDPTNAKEN: EPRNE3 Position        */
#define USB1_ENDPTNAKEN_EPRNE3_Msk            (0x01UL << USB1_ENDPTNAKEN_EPRNE3_Pos)                  /*!< USB1 ENDPTNAKEN: EPRNE3 Mask            */
#define USB1_ENDPTNAKEN_EPTNE16_Pos           16                                                      /*!< USB1 ENDPTNAKEN: EPTNE16 Position       */
#define USB1_ENDPTNAKEN_EPTNE16_Msk           (0x01UL << USB1_ENDPTNAKEN_EPTNE16_Pos)                 /*!< USB1 ENDPTNAKEN: EPTNE16 Mask           */
#define USB1_ENDPTNAKEN_EPTNE17_Pos           17                                                      /*!< USB1 ENDPTNAKEN: EPTNE17 Position       */
#define USB1_ENDPTNAKEN_EPTNE17_Msk           (0x01UL << USB1_ENDPTNAKEN_EPTNE17_Pos)                 /*!< USB1 ENDPTNAKEN: EPTNE17 Mask           */
#define USB1_ENDPTNAKEN_EPTNE18_Pos           18                                                      /*!< USB1 ENDPTNAKEN: EPTNE18 Position       */
#define USB1_ENDPTNAKEN_EPTNE18_Msk           (0x01UL << USB1_ENDPTNAKEN_EPTNE18_Pos)                 /*!< USB1 ENDPTNAKEN: EPTNE18 Mask           */
#define USB1_ENDPTNAKEN_EPTNE19_Pos           19                                                      /*!< USB1 ENDPTNAKEN: EPTNE19 Position       */
#define USB1_ENDPTNAKEN_EPTNE19_Msk           (0x01UL << USB1_ENDPTNAKEN_EPTNE19_Pos)                 /*!< USB1 ENDPTNAKEN: EPTNE19 Mask           */

/* -------------------------------  USB1_PORTSC1_D  ------------------------------- */
#define USB1_PORTSC1_D_CCS_Pos                0                                                       /*!< USB1 PORTSC1_D: CCS Position            */
#define USB1_PORTSC1_D_CCS_Msk                (0x01UL << USB1_PORTSC1_D_CCS_Pos)                      /*!< USB1 PORTSC1_D: CCS Mask                */
#define USB1_PORTSC1_D_CSC_Pos                1                                                       /*!< USB1 PORTSC1_D: CSC Position            */
#define USB1_PORTSC1_D_CSC_Msk                (0x01UL << USB1_PORTSC1_D_CSC_Pos)                      /*!< USB1 PORTSC1_D: CSC Mask                */
#define USB1_PORTSC1_D_PE_Pos                 2                                                       /*!< USB1 PORTSC1_D: PE Position             */
#define USB1_PORTSC1_D_PE_Msk                 (0x01UL << USB1_PORTSC1_D_PE_Pos)                       /*!< USB1 PORTSC1_D: PE Mask                 */
#define USB1_PORTSC1_D_PEC_Pos                3                                                       /*!< USB1 PORTSC1_D: PEC Position            */
#define USB1_PORTSC1_D_PEC_Msk                (0x01UL << USB1_PORTSC1_D_PEC_Pos)                      /*!< USB1 PORTSC1_D: PEC Mask                */
#define USB1_PORTSC1_D_FPR_Pos                6                                                       /*!< USB1 PORTSC1_D: FPR Position            */
#define USB1_PORTSC1_D_FPR_Msk                (0x01UL << USB1_PORTSC1_D_FPR_Pos)                      /*!< USB1 PORTSC1_D: FPR Mask                */
#define USB1_PORTSC1_D_SUSP_Pos               7                                                       /*!< USB1 PORTSC1_D: SUSP Position           */
#define USB1_PORTSC1_D_SUSP_Msk               (0x01UL << USB1_PORTSC1_D_SUSP_Pos)                     /*!< USB1 PORTSC1_D: SUSP Mask               */
#define USB1_PORTSC1_D_PR_Pos                 8                                                       /*!< USB1 PORTSC1_D: PR Position             */
#define USB1_PORTSC1_D_PR_Msk                 (0x01UL << USB1_PORTSC1_D_PR_Pos)                       /*!< USB1 PORTSC1_D: PR Mask                 */
#define USB1_PORTSC1_D_HSP_Pos                9                                                       /*!< USB1 PORTSC1_D: HSP Position            */
#define USB1_PORTSC1_D_HSP_Msk                (0x01UL << USB1_PORTSC1_D_HSP_Pos)                      /*!< USB1 PORTSC1_D: HSP Mask                */
#define USB1_PORTSC1_D_LS_Pos                 10                                                      /*!< USB1 PORTSC1_D: LS Position             */
#define USB1_PORTSC1_D_LS_Msk                 (0x03UL << USB1_PORTSC1_D_LS_Pos)                       /*!< USB1 PORTSC1_D: LS Mask                 */
#define USB1_PORTSC1_D_PP_Pos                 12                                                      /*!< USB1 PORTSC1_D: PP Position             */
#define USB1_PORTSC1_D_PP_Msk                 (0x01UL << USB1_PORTSC1_D_PP_Pos)                       /*!< USB1 PORTSC1_D: PP Mask                 */
#define USB1_PORTSC1_D_PIC1_0_Pos             14                                                      /*!< USB1 PORTSC1_D: PIC1_0 Position         */
#define USB1_PORTSC1_D_PIC1_0_Msk             (0x03UL << USB1_PORTSC1_D_PIC1_0_Pos)                   /*!< USB1 PORTSC1_D: PIC1_0 Mask             */
#define USB1_PORTSC1_D_PTC3_0_Pos             16                                                      /*!< USB1 PORTSC1_D: PTC3_0 Position         */
#define USB1_PORTSC1_D_PTC3_0_Msk             (0x0fUL << USB1_PORTSC1_D_PTC3_0_Pos)                   /*!< USB1 PORTSC1_D: PTC3_0 Mask             */
#define USB1_PORTSC1_D_PHCD_Pos               23                                                      /*!< USB1 PORTSC1_D: PHCD Position           */
#define USB1_PORTSC1_D_PHCD_Msk               (0x01UL << USB1_PORTSC1_D_PHCD_Pos)                     /*!< USB1 PORTSC1_D: PHCD Mask               */
#define USB1_PORTSC1_D_PFSC_Pos               24                                                      /*!< USB1 PORTSC1_D: PFSC Position           */
#define USB1_PORTSC1_D_PFSC_Msk               (0x01UL << USB1_PORTSC1_D_PFSC_Pos)                     /*!< USB1 PORTSC1_D: PFSC Mask               */
#define USB1_PORTSC1_D_PSPD_Pos               26                                                      /*!< USB1 PORTSC1_D: PSPD Position           */
#define USB1_PORTSC1_D_PSPD_Msk               (0x03UL << USB1_PORTSC1_D_PSPD_Pos)                     /*!< USB1 PORTSC1_D: PSPD Mask               */
#define USB1_PORTSC1_D_PTS_Pos                30                                                      /*!< USB1 PORTSC1_D: PTS Position            */
#define USB1_PORTSC1_D_PTS_Msk                (0x03UL << USB1_PORTSC1_D_PTS_Pos)                      /*!< USB1 PORTSC1_D: PTS Mask                */

/* -------------------------------  USB1_PORTSC1_H  ------------------------------- */
#define USB1_PORTSC1_H_CCS_Pos                0                                                       /*!< USB1 PORTSC1_H: CCS Position            */
#define USB1_PORTSC1_H_CCS_Msk                (0x01UL << USB1_PORTSC1_H_CCS_Pos)                      /*!< USB1 PORTSC1_H: CCS Mask                */
#define USB1_PORTSC1_H_CSC_Pos                1                                                       /*!< USB1 PORTSC1_H: CSC Position            */
#define USB1_PORTSC1_H_CSC_Msk                (0x01UL << USB1_PORTSC1_H_CSC_Pos)                      /*!< USB1 PORTSC1_H: CSC Mask                */
#define USB1_PORTSC1_H_PE_Pos                 2                                                       /*!< USB1 PORTSC1_H: PE Position             */
#define USB1_PORTSC1_H_PE_Msk                 (0x01UL << USB1_PORTSC1_H_PE_Pos)                       /*!< USB1 PORTSC1_H: PE Mask                 */
#define USB1_PORTSC1_H_PEC_Pos                3                                                       /*!< USB1 PORTSC1_H: PEC Position            */
#define USB1_PORTSC1_H_PEC_Msk                (0x01UL << USB1_PORTSC1_H_PEC_Pos)                      /*!< USB1 PORTSC1_H: PEC Mask                */
#define USB1_PORTSC1_H_OCA_Pos                4                                                       /*!< USB1 PORTSC1_H: OCA Position            */
#define USB1_PORTSC1_H_OCA_Msk                (0x01UL << USB1_PORTSC1_H_OCA_Pos)                      /*!< USB1 PORTSC1_H: OCA Mask                */
#define USB1_PORTSC1_H_OCC_Pos                5                                                       /*!< USB1 PORTSC1_H: OCC Position            */
#define USB1_PORTSC1_H_OCC_Msk                (0x01UL << USB1_PORTSC1_H_OCC_Pos)                      /*!< USB1 PORTSC1_H: OCC Mask                */
#define USB1_PORTSC1_H_FPR_Pos                6                                                       /*!< USB1 PORTSC1_H: FPR Position            */
#define USB1_PORTSC1_H_FPR_Msk                (0x01UL << USB1_PORTSC1_H_FPR_Pos)                      /*!< USB1 PORTSC1_H: FPR Mask                */
#define USB1_PORTSC1_H_SUSP_Pos               7                                                       /*!< USB1 PORTSC1_H: SUSP Position           */
#define USB1_PORTSC1_H_SUSP_Msk               (0x01UL << USB1_PORTSC1_H_SUSP_Pos)                     /*!< USB1 PORTSC1_H: SUSP Mask               */
#define USB1_PORTSC1_H_PR_Pos                 8                                                       /*!< USB1 PORTSC1_H: PR Position             */
#define USB1_PORTSC1_H_PR_Msk                 (0x01UL << USB1_PORTSC1_H_PR_Pos)                       /*!< USB1 PORTSC1_H: PR Mask                 */
#define USB1_PORTSC1_H_HSP_Pos                9                                                       /*!< USB1 PORTSC1_H: HSP Position            */
#define USB1_PORTSC1_H_HSP_Msk                (0x01UL << USB1_PORTSC1_H_HSP_Pos)                      /*!< USB1 PORTSC1_H: HSP Mask                */
#define USB1_PORTSC1_H_LS_Pos                 10                                                      /*!< USB1 PORTSC1_H: LS Position             */
#define USB1_PORTSC1_H_LS_Msk                 (0x03UL << USB1_PORTSC1_H_LS_Pos)                       /*!< USB1 PORTSC1_H: LS Mask                 */
#define USB1_PORTSC1_H_PP_Pos                 12                                                      /*!< USB1 PORTSC1_H: PP Position             */
#define USB1_PORTSC1_H_PP_Msk                 (0x01UL << USB1_PORTSC1_H_PP_Pos)                       /*!< USB1 PORTSC1_H: PP Mask                 */
#define USB1_PORTSC1_H_PIC1_0_Pos             14                                                      /*!< USB1 PORTSC1_H: PIC1_0 Position         */
#define USB1_PORTSC1_H_PIC1_0_Msk             (0x03UL << USB1_PORTSC1_H_PIC1_0_Pos)                   /*!< USB1 PORTSC1_H: PIC1_0 Mask             */
#define USB1_PORTSC1_H_PTC3_0_Pos             16                                                      /*!< USB1 PORTSC1_H: PTC3_0 Position         */
#define USB1_PORTSC1_H_PTC3_0_Msk             (0x0fUL << USB1_PORTSC1_H_PTC3_0_Pos)                   /*!< USB1 PORTSC1_H: PTC3_0 Mask             */
#define USB1_PORTSC1_H_WKCN_Pos               20                                                      /*!< USB1 PORTSC1_H: WKCN Position           */
#define USB1_PORTSC1_H_WKCN_Msk               (0x01UL << USB1_PORTSC1_H_WKCN_Pos)                     /*!< USB1 PORTSC1_H: WKCN Mask               */
#define USB1_PORTSC1_H_WKDC_Pos               21                                                      /*!< USB1 PORTSC1_H: WKDC Position           */
#define USB1_PORTSC1_H_WKDC_Msk               (0x01UL << USB1_PORTSC1_H_WKDC_Pos)                     /*!< USB1 PORTSC1_H: WKDC Mask               */
#define USB1_PORTSC1_H_WKOC_Pos               22                                                      /*!< USB1 PORTSC1_H: WKOC Position           */
#define USB1_PORTSC1_H_WKOC_Msk               (0x01UL << USB1_PORTSC1_H_WKOC_Pos)                     /*!< USB1 PORTSC1_H: WKOC Mask               */
#define USB1_PORTSC1_H_PHCD_Pos               23                                                      /*!< USB1 PORTSC1_H: PHCD Position           */
#define USB1_PORTSC1_H_PHCD_Msk               (0x01UL << USB1_PORTSC1_H_PHCD_Pos)                     /*!< USB1 PORTSC1_H: PHCD Mask               */
#define USB1_PORTSC1_H_PFSC_Pos               24                                                      /*!< USB1 PORTSC1_H: PFSC Position           */
#define USB1_PORTSC1_H_PFSC_Msk               (0x01UL << USB1_PORTSC1_H_PFSC_Pos)                     /*!< USB1 PORTSC1_H: PFSC Mask               */
#define USB1_PORTSC1_H_PSPD_Pos               26                                                      /*!< USB1 PORTSC1_H: PSPD Position           */
#define USB1_PORTSC1_H_PSPD_Msk               (0x03UL << USB1_PORTSC1_H_PSPD_Pos)                     /*!< USB1 PORTSC1_H: PSPD Mask               */
#define USB1_PORTSC1_H_PTS_Pos                30                                                      /*!< USB1 PORTSC1_H: PTS Position            */
#define USB1_PORTSC1_H_PTS_Msk                (0x03UL << USB1_PORTSC1_H_PTS_Pos)                      /*!< USB1 PORTSC1_H: PTS Mask                */

