MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -----------------------------  USB1_ENDPTCOMPLETE  ----------------------------- */
#define USB1_ENDPTCOMPLETE_ERCE0_Pos          0                                                       /*!< USB1 ENDPTCOMPLETE: ERCE0 Position      */
#define USB1_ENDPTCOMPLETE_ERCE0_Msk          (0x01UL << USB1_ENDPTCOMPLETE_ERCE0_Pos)                /*!< USB1 ENDPTCOMPLETE: ERCE0 Mask          */
#define USB1_ENDPTCOMPLETE_ERCE1_Pos          1                                                       /*!< USB1 ENDPTCOMPLETE: ERCE1 Position      */
#define USB1_ENDPTCOMPLETE_ERCE1_Msk          (0x01UL << USB1_ENDPTCOMPLETE_ERCE1_Pos)                /*!< USB1 ENDPTCOMPLETE: ERCE1 Mask          */
#define USB1_ENDPTCOMPLETE_ERCE2_Pos          2                                                       /*!< USB1 ENDPTCOMPLETE: ERCE2 Position      */
#define USB1_ENDPTCOMPLETE_ERCE2_Msk          (0x01UL << USB1_ENDPTCOMPLETE_ERCE2_Pos)                /*!< USB1 ENDPTCOMPLETE: ERCE2 Mask          */
#define USB1_ENDPTCOMPLETE_ERCE3_Pos          3                                                       /*!< USB1 ENDPTCOMPLETE: ERCE3 Position      */
#define USB1_ENDPTCOMPLETE_ERCE3_Msk          (0x01UL << USB1_ENDPTCOMPLETE_ERCE3_Pos)                /*!< USB1 ENDPTCOMPLETE: ERCE3 Mask          */
#define USB1_ENDPTCOMPLETE_ETCE0_Pos          16                                                      /*!< USB1 ENDPTCOMPLETE: ETCE0 Position      */
#define USB1_ENDPTCOMPLETE_ETCE0_Msk          (0x01UL << USB1_ENDPTCOMPLETE_ETCE0_Pos)                /*!< USB1 ENDPTCOMPLETE: ETCE0 Mask          */
#define USB1_ENDPTCOMPLETE_ETCE1_Pos          17                                                      /*!< USB1 ENDPTCOMPLETE: ETCE1 Position      */
#define USB1_ENDPTCOMPLETE_ETCE1_Msk          (0x01UL << USB1_ENDPTCOMPLETE_ETCE1_Pos)                /*!< USB1 ENDPTCOMPLETE: ETCE1 Mask          */
#define USB1_ENDPTCOMPLETE_ETCE2_Pos          18                                                      /*!< USB1 ENDPTCOMPLETE: ETCE2 Position      */
#define USB1_ENDPTCOMPLETE_ETCE2_Msk          (0x01UL << USB1_ENDPTCOMPLETE_ETCE2_Pos)                /*!< USB1 ENDPTCOMPLETE: ETCE2 Mask          */
#define USB1_ENDPTCOMPLETE_ETCE3_Pos          19                                                      /*!< USB1 ENDPTCOMPLETE: ETCE3 Position      */
#define USB1_ENDPTCOMPLETE_ETCE3_Msk          (0x01UL << USB1_ENDPTCOMPLETE_ETCE3_Pos)                /*!< USB1 ENDPTCOMPLETE: ETCE3 Mask          */

/* -------------------------------  USB1_ENDPTCTRL0  ------------------------------ */
#define USB1_ENDPTCTRL0_RXS_Pos               0                                                       /*!< USB1 ENDPTCTRL0: RXS Position           */
#define USB1_ENDPTCTRL0_RXS_Msk               (0x01UL << USB1_ENDPTCTRL0_RXS_Pos)                     /*!< USB1 ENDPTCTRL0: RXS Mask               */
#define USB1_ENDPTCTRL0_RXT_Pos               2                                                       /*!< USB1 ENDPTCTRL0: RXT Position           */
#define USB1_ENDPTCTRL0_RXT_Msk               (0x03UL << USB1_ENDPTCTRL0_RXT_Pos)                     /*!< USB1 ENDPTCTRL0: RXT Mask               */
#define USB1_ENDPTCTRL0_RXE_Pos               7                                                       /*!< USB1 ENDPTCTRL0: RXE Position           */
#define USB1_ENDPTCTRL0_RXE_Msk               (0x01UL << USB1_ENDPTCTRL0_RXE_Pos)                     /*!< USB1 ENDPTCTRL0: RXE Mask               */
#define USB1_ENDPTCTRL0_TXS_Pos               16                                                      /*!< USB1 ENDPTCTRL0: TXS Position           */
#define USB1_ENDPTCTRL0_TXS_Msk               (0x01UL << USB1_ENDPTCTRL0_TXS_Pos)                     /*!< USB1 ENDPTCTRL0: TXS Mask               */
#define USB1_ENDPTCTRL0_TXT_Pos               18                                                      /*!< USB1 ENDPTCTRL0: TXT Position           */
#define USB1_ENDPTCTRL0_TXT_Msk               (0x03UL << USB1_ENDPTCTRL0_TXT_Pos)                     /*!< USB1 ENDPTCTRL0: TXT Mask               */
#define USB1_ENDPTCTRL0_TXE_Pos               23                                                      /*!< USB1 ENDPTCTRL0: TXE Position           */
#define USB1_ENDPTCTRL0_TXE_Msk               (0x01UL << USB1_ENDPTCTRL0_TXE_Pos)                     /*!< USB1 ENDPTCTRL0: TXE Mask               */

/* -------------------------------  USB1_ENDPTCTRL1  ------------------------------ */
#define USB1_ENDPTCTRL1_RXS_Pos               0                                                       /*!< USB1 ENDPTCTRL1: RXS Position           */
#define USB1_ENDPTCTRL1_RXS_Msk               (0x01UL << USB1_ENDPTCTRL1_RXS_Pos)                     /*!< USB1 ENDPTCTRL1: RXS Mask               */
#define USB1_ENDPTCTRL1_RXT_Pos               2                                                       /*!< USB1 ENDPTCTRL1: RXT Position           */
#define USB1_ENDPTCTRL1_RXT_Msk               (0x03UL << USB1_ENDPTCTRL1_RXT_Pos)                     /*!< USB1 ENDPTCTRL1: RXT Mask               */
#define USB1_ENDPTCTRL1_RXI_Pos               5                                                       /*!< USB1 ENDPTCTRL1: RXI Position           */
#define USB1_ENDPTCTRL1_RXI_Msk               (0x01UL << USB1_ENDPTCTRL1_RXI_Pos)                     /*!< USB1 ENDPTCTRL1: RXI Mask               */
#define USB1_ENDPTCTRL1_RXR_Pos               6                                                       /*!< USB1 ENDPTCTRL1: RXR Position           */
#define USB1_ENDPTCTRL1_RXR_Msk               (0x01UL << USB1_ENDPTCTRL1_RXR_Pos)                     /*!< USB1 ENDPTCTRL1: RXR Mask               */
#define USB1_ENDPTCTRL1_RXE_Pos               7                                                       /*!< USB1 ENDPTCTRL1: RXE Position           */
#define USB1_ENDPTCTRL1_RXE_Msk               (0x01UL << USB1_ENDPTCTRL1_RXE_Pos)                     /*!< USB1 ENDPTCTRL1: RXE Mask               */
#define USB1_ENDPTCTRL1_TXS_Pos               16                                                      /*!< USB1 ENDPTCTRL1: TXS Position           */
#define USB1_ENDPTCTRL1_TXS_Msk               (0x01UL << USB1_ENDPTCTRL1_TXS_Pos)                     /*!< USB1 ENDPTCTRL1: TXS Mask               */
#define USB1_ENDPTCTRL1_TXT_Pos               18                                                      /*!< USB1 ENDPTCTRL1: TXT Position           */
#define USB1_ENDPTCTRL1_TXT_Msk               (0x03UL << USB1_ENDPTCTRL1_TXT_Pos)                     /*!< USB1 ENDPTCTRL1: TXT Mask               */
#define USB1_ENDPTCTRL1_TXI_Pos               21                                                      /*!< USB1 ENDPTCTRL1: TXI Position           */
#define USB1_ENDPTCTRL1_TXI_Msk               (0x01UL << USB1_ENDPTCTRL1_TXI_Pos)                     /*!< USB1 ENDPTCTRL1: TXI Mask               */
#define USB1_ENDPTCTRL1_TXR_Pos               22                                                      /*!< USB1 ENDPTCTRL1: TXR Position           */
#define USB1_ENDPTCTRL1_TXR_Msk               (0x01UL << USB1_ENDPTCTRL1_TXR_Pos)                     /*!< USB1 ENDPTCTRL1: TXR Mask               */
#define USB1_ENDPTCTRL1_TXE_Pos               23                                                      /*!< USB1 ENDPTCTRL1: TXE Position           */
#define USB1_ENDPTCTRL1_TXE_Msk               (0x01UL << USB1_ENDPTCTRL1_TXE_Pos)                     /*!< USB1 ENDPTCTRL1: TXE Mask               */

/* -------------------------------  USB1_ENDPTCTRL2  ------------------------------ */
#define USB1_ENDPTCTRL2_RXS_Pos               0                                                       /*!< USB1 ENDPTCTRL2: RXS Position           */
#define USB1_ENDPTCTRL2_RXS_Msk               (0x01UL << USB1_ENDPTCTRL2_RXS_Pos)                     /*!< USB1 ENDPTCTRL2: RXS Mask               */
#define USB1_ENDPTCTRL2_RXT_Pos               2                                                       /*!< USB1 ENDPTCTRL2: RXT Position           */
#define USB1_ENDPTCTRL2_RXT_Msk               (0x03UL << USB1_ENDPTCTRL2_RXT_Pos)                     /*!< USB1 ENDPTCTRL2: RXT Mask               */
#define USB1_ENDPTCTRL2_RXI_Pos               5                                                       /*!< USB1 ENDPTCTRL2: RXI Position           */
#define USB1_ENDPTCTRL2_RXI_Msk               (0x01UL << USB1_ENDPTCTRL2_RXI_Pos)                     /*!< USB1 ENDPTCTRL2: RXI Mask               */
#define USB1_ENDPTCTRL2_RXR_Pos               6                                                       /*!< USB1 ENDPTCTRL2: RXR Position           */
#define USB1_ENDPTCTRL2_RXR_Msk               (0x01UL << USB1_ENDPTCTRL2_RXR_Pos)                     /*!< USB1 ENDPTCTRL2: RXR Mask               */
#define USB1_ENDPTCTRL2_RXE_Pos               7                                                       /*!< USB1 ENDPTCTRL2: RXE Position           */
#define USB1_ENDPTCTRL2_RXE_Msk               (0x01UL << USB1_ENDPTCTRL2_RXE_Pos)                     /*!< USB1 ENDPTCTRL2: RXE Mask               */
#define USB1_ENDPTCTRL2_TXS_Pos               16                                                      /*!< USB1 ENDPTCTRL2: TXS Position           */
#define USB1_ENDPTCTRL2_TXS_Msk               (0x01UL << USB1_ENDPTCTRL2_TXS_Pos)                     /*!< USB1 ENDPTCTRL2: TXS Mask               */
#define USB1_ENDPTCTRL2_TXT_Pos               18                                                      /*!< USB1 ENDPTCTRL2: TXT Position           */
#define USB1_ENDPTCTRL2_TXT_Msk               (0x03UL << USB1_ENDPTCTRL2_TXT_Pos)                     /*!< USB1 ENDPTCTRL2: TXT Mask               */
#define USB1_ENDPTCTRL2_TXI_Pos               21                                                      /*!< USB1 ENDPTCTRL2: TXI Position           */
#define USB1_ENDPTCTRL2_TXI_Msk               (0x01UL << USB1_ENDPTCTRL2_TXI_Pos)                     /*!< USB1 ENDPTCTRL2: TXI Mask               */
#define USB1_ENDPTCTRL2_TXR_Pos               22                                                      /*!< USB1 ENDPTCTRL2: TXR Position           */
#define USB1_ENDPTCTRL2_TXR_Msk               (0x01UL << USB1_ENDPTCTRL2_TXR_Pos)                     /*!< USB1 ENDPTCTRL2: TXR Mask               */
#define USB1_ENDPTCTRL2_TXE_Pos               23                                                      /*!< USB1 ENDPTCTRL2: TXE Position           */
#define USB1_ENDPTCTRL2_TXE_Msk               (0x01UL << USB1_ENDPTCTRL2_TXE_Pos)                     /*!< USB1 ENDPTCTRL2: TXE Mask               */

/* -------------------------------  USB1_ENDPTCTRL3  ------------------------------ */
#define USB1_ENDPTCTRL3_RXS_Pos               0                                                       /*!< USB1 ENDPTCTRL3: RXS Position           */
#define USB1_ENDPTCTRL3_RXS_Msk               (0x01UL << USB1_ENDPTCTRL3_RXS_Pos)                     /*!< USB1 ENDPTCTRL3: RXS Mask               */
#define USB1_ENDPTCTRL3_RXT_Pos               2                                                       /*!< USB1 ENDPTCTRL3: RXT Position           */
#define USB1_ENDPTCTRL3_RXT_Msk               (0x03UL << USB1_ENDPTCTRL3_RXT_Pos)                     /*!< USB1 ENDPTCTRL3: RXT Mask               */
#define USB1_ENDPTCTRL3_RXI_Pos               5                                                       /*!< USB1 ENDPTCTRL3: RXI Position           */
#define USB1_ENDPTCTRL3_RXI_Msk               (0x01UL << USB1_ENDPTCTRL3_RXI_Pos)                     /*!< USB1 ENDPTCTRL3: RXI Mask               */
#define USB1_ENDPTCTRL3_RXR_Pos               6                                                       /*!< USB1 ENDPTCTRL3: RXR Position           */
#define USB1_ENDPTCTRL3_RXR_Msk               (0x01UL << USB1_ENDPTCTRL3_RXR_Pos)                     /*!< USB1 ENDPTCTRL3: RXR Mask               */
#define USB1_ENDPTCTRL3_RXE_Pos               7                                                       /*!< USB1 ENDPTCTRL3: RXE Position           */
#define USB1_ENDPTCTRL3_RXE_Msk               (0x01UL << USB1_ENDPTCTRL3_RXE_Pos)                     /*!< USB1 ENDPTCTRL3: RXE Mask               */
#define USB1_ENDPTCTRL3_TXS_Pos               16                                                      /*!< USB1 ENDPTCTRL3: TXS Position           */
#define USB1_ENDPTCTRL3_TXS_Msk               (0x01UL << USB1_ENDPTCTRL3_TXS_Pos)                     /*!< USB1 ENDPTCTRL3: TXS Mask               */
#define USB1_ENDPTCTRL3_TXT_Pos               18                                                      /*!< USB1 ENDPTCTRL3: TXT Position           */
#define USB1_ENDPTCTRL3_TXT_Msk               (0x03UL << USB1_ENDPTCTRL3_TXT_Pos)                     /*!< USB1 ENDPTCTRL3: TXT Mask               */
#define USB1_ENDPTCTRL3_TXI_Pos               21                                                      /*!< USB1 ENDPTCTRL3: TXI Position           */
#define USB1_ENDPTCTRL3_TXI_Msk               (0x01UL << USB1_ENDPTCTRL3_TXI_Pos)                     /*!< USB1 ENDPTCTRL3: TXI Mask               */
#define USB1_ENDPTCTRL3_TXR_Pos               22                                                      /*!< USB1 ENDPTCTRL3: TXR Position           */
#define USB1_ENDPTCTRL3_TXR_Msk               (0x01UL << USB1_ENDPTCTRL3_TXR_Pos)                     /*!< USB1 ENDPTCTRL3: TXR Mask               */
#define USB1_ENDPTCTRL3_TXE_Pos               23                                                      /*!< USB1 ENDPTCTRL3: TXE Position           */
#define USB1_ENDPTCTRL3_TXE_Msk               (0x01UL << USB1_ENDPTCTRL3_TXE_Pos)                     /*!< USB1 ENDPTCTRL3: TXE Mask               */


/* ================================================================================ */
/* ================          struct 'LCD' Position & Mask          ================ */
/* ================================================================================ */


/* ----------------------------------  LCD_TIMH  ---------------------------------- */
#define LCD_TIMH_PPL_Pos                      2                                                       /*!< LCD TIMH: PPL Position                  */
#define LCD_TIMH_PPL_Msk                      (0x3fUL << LCD_TIMH_PPL_Pos)                            /*!< LCD TIMH: PPL Mask                      */
#define LCD_TIMH_HSW_Pos                      8                                                       /*!< LCD TIMH: HSW Position                  */
#define LCD_TIMH_HSW_Msk                      (0x000000ffUL << LCD_TIMH_HSW_Pos)                      /*!< LCD TIMH: HSW Mask                      */
#define LCD_TIMH_HFP_Pos                      16                                                      /*!< LCD TIMH: HFP Position                  */
#define LCD_TIMH_HFP_Msk                      (0x000000ffUL << LCD_TIMH_HFP_Pos)                      /*!< LCD TIMH: HFP Mask                      */
#define LCD_TIMH_HBP_Pos                      24                                                      /*!< LCD TIMH: HBP Position                  */
#define LCD_TIMH_HBP_Msk                      (0x000000ffUL << LCD_TIMH_HBP_Pos)                      /*!< LCD TIMH: HBP Mask                      */

