MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ----------------------------------  LCD_TIMV  ---------------------------------- */
#define LCD_TIMV_LPP_Pos                      0                                                       /*!< LCD TIMV: LPP Position                  */
#define LCD_TIMV_LPP_Msk                      (0x000003ffUL << LCD_TIMV_LPP_Pos)                      /*!< LCD TIMV: LPP Mask                      */
#define LCD_TIMV_VSW_Pos                      10                                                      /*!< LCD TIMV: VSW Position                  */
#define LCD_TIMV_VSW_Msk                      (0x3fUL << LCD_TIMV_VSW_Pos)                            /*!< LCD TIMV: VSW Mask                      */
#define LCD_TIMV_VFP_Pos                      16                                                      /*!< LCD TIMV: VFP Position                  */
#define LCD_TIMV_VFP_Msk                      (0x000000ffUL << LCD_TIMV_VFP_Pos)                      /*!< LCD TIMV: VFP Mask                      */
#define LCD_TIMV_VBP_Pos                      24                                                      /*!< LCD TIMV: VBP Position                  */
#define LCD_TIMV_VBP_Msk                      (0x000000ffUL << LCD_TIMV_VBP_Pos)                      /*!< LCD TIMV: VBP Mask                      */

/* -----------------------------------  LCD_POL  ---------------------------------- */
#define LCD_POL_PCD_LO_Pos                    0                                                       /*!< LCD POL: PCD_LO Position                */
#define LCD_POL_PCD_LO_Msk                    (0x1fUL << LCD_POL_PCD_LO_Pos)                          /*!< LCD POL: PCD_LO Mask                    */
#define LCD_POL_CLKSEL_Pos                    5                                                       /*!< LCD POL: CLKSEL Position                */
#define LCD_POL_CLKSEL_Msk                    (0x01UL << LCD_POL_CLKSEL_Pos)                          /*!< LCD POL: CLKSEL Mask                    */
#define LCD_POL_ACB_Pos                       6                                                       /*!< LCD POL: ACB Position                   */
#define LCD_POL_ACB_Msk                       (0x1fUL << LCD_POL_ACB_Pos)                             /*!< LCD POL: ACB Mask                       */
#define LCD_POL_IVS_Pos                       11                                                      /*!< LCD POL: IVS Position                   */
#define LCD_POL_IVS_Msk                       (0x01UL << LCD_POL_IVS_Pos)                             /*!< LCD POL: IVS Mask                       */
#define LCD_POL_IHS_Pos                       12                                                      /*!< LCD POL: IHS Position                   */
#define LCD_POL_IHS_Msk                       (0x01UL << LCD_POL_IHS_Pos)                             /*!< LCD POL: IHS Mask                       */
#define LCD_POL_IPC_Pos                       13                                                      /*!< LCD POL: IPC Position                   */
#define LCD_POL_IPC_Msk                       (0x01UL << LCD_POL_IPC_Pos)                             /*!< LCD POL: IPC Mask                       */
#define LCD_POL_IOE_Pos                       14                                                      /*!< LCD POL: IOE Position                   */
#define LCD_POL_IOE_Msk                       (0x01UL << LCD_POL_IOE_Pos)                             /*!< LCD POL: IOE Mask                       */
#define LCD_POL_CPL_Pos                       16                                                      /*!< LCD POL: CPL Position                   */
#define LCD_POL_CPL_Msk                       (0x000003ffUL << LCD_POL_CPL_Pos)                       /*!< LCD POL: CPL Mask                       */
#define LCD_POL_BCD_Pos                       26                                                      /*!< LCD POL: BCD Position                   */
#define LCD_POL_BCD_Msk                       (0x01UL << LCD_POL_BCD_Pos)                             /*!< LCD POL: BCD Mask                       */
#define LCD_POL_PCD_HI_Pos                    27                                                      /*!< LCD POL: PCD_HI Position                */
#define LCD_POL_PCD_HI_Msk                    (0x1fUL << LCD_POL_PCD_HI_Pos)                          /*!< LCD POL: PCD_HI Mask                    */

/* -----------------------------------  LCD_LE  ----------------------------------- */
#define LCD_LE_LED_Pos                        0                                                       /*!< LCD LE: LED Position                    */
#define LCD_LE_LED_Msk                        (0x7fUL << LCD_LE_LED_Pos)                              /*!< LCD LE: LED Mask                        */
#define LCD_LE_LEE_Pos                        16                                                      /*!< LCD LE: LEE Position                    */
#define LCD_LE_LEE_Msk                        (0x01UL << LCD_LE_LEE_Pos)                              /*!< LCD LE: LEE Mask                        */

/* ---------------------------------  LCD_UPBASE  --------------------------------- */
#define LCD_UPBASE_LCDUPBASE_Pos              3                                                       /*!< LCD UPBASE: LCDUPBASE Position          */
#define LCD_UPBASE_LCDUPBASE_Msk              (0x1fffffffUL << LCD_UPBASE_LCDUPBASE_Pos)              /*!< LCD UPBASE: LCDUPBASE Mask              */

/* ---------------------------------  LCD_LPBASE  --------------------------------- */
#define LCD_LPBASE_LCDLPBASE_Pos              3                                                       /*!< LCD LPBASE: LCDLPBASE Position          */
#define LCD_LPBASE_LCDLPBASE_Msk              (0x1fffffffUL << LCD_LPBASE_LCDLPBASE_Pos)              /*!< LCD LPBASE: LCDLPBASE Mask              */

/* ----------------------------------  LCD_CTRL  ---------------------------------- */
#define LCD_CTRL_LCDEN_Pos                    0                                                       /*!< LCD CTRL: LCDEN Position                */
#define LCD_CTRL_LCDEN_Msk                    (0x01UL << LCD_CTRL_LCDEN_Pos)                          /*!< LCD CTRL: LCDEN Mask                    */
#define LCD_CTRL_LCDBPP_Pos                   1                                                       /*!< LCD CTRL: LCDBPP Position               */
#define LCD_CTRL_LCDBPP_Msk                   (0x07UL << LCD_CTRL_LCDBPP_Pos)                         /*!< LCD CTRL: LCDBPP Mask                   */
#define LCD_CTRL_LCDBW_Pos                    4                                                       /*!< LCD CTRL: LCDBW Position                */
#define LCD_CTRL_LCDBW_Msk                    (0x01UL << LCD_CTRL_LCDBW_Pos)                          /*!< LCD CTRL: LCDBW Mask                    */
#define LCD_CTRL_LCDTFT_Pos                   5                                                       /*!< LCD CTRL: LCDTFT Position               */
#define LCD_CTRL_LCDTFT_Msk                   (0x01UL << LCD_CTRL_LCDTFT_Pos)                         /*!< LCD CTRL: LCDTFT Mask                   */
#define LCD_CTRL_LCDMONO8_Pos                 6                                                       /*!< LCD CTRL: LCDMONO8 Position             */
#define LCD_CTRL_LCDMONO8_Msk                 (0x01UL << LCD_CTRL_LCDMONO8_Pos)                       /*!< LCD CTRL: LCDMONO8 Mask                 */
#define LCD_CTRL_LCDDUAL_Pos                  7                                                       /*!< LCD CTRL: LCDDUAL Position              */
#define LCD_CTRL_LCDDUAL_Msk                  (0x01UL << LCD_CTRL_LCDDUAL_Pos)                        /*!< LCD CTRL: LCDDUAL Mask                  */
#define LCD_CTRL_BGR_Pos                      8                                                       /*!< LCD CTRL: BGR Position                  */
#define LCD_CTRL_BGR_Msk                      (0x01UL << LCD_CTRL_BGR_Pos)                            /*!< LCD CTRL: BGR Mask                      */
#define LCD_CTRL_BEBO_Pos                     9                                                       /*!< LCD CTRL: BEBO Position                 */
#define LCD_CTRL_BEBO_Msk                     (0x01UL << LCD_CTRL_BEBO_Pos)                           /*!< LCD CTRL: BEBO Mask                     */
#define LCD_CTRL_BEPO_Pos                     10                                                      /*!< LCD CTRL: BEPO Position                 */
#define LCD_CTRL_BEPO_Msk                     (0x01UL << LCD_CTRL_BEPO_Pos)                           /*!< LCD CTRL: BEPO Mask                     */
#define LCD_CTRL_LCDPWR_Pos                   11                                                      /*!< LCD CTRL: LCDPWR Position               */
#define LCD_CTRL_LCDPWR_Msk                   (0x01UL << LCD_CTRL_LCDPWR_Pos)                         /*!< LCD CTRL: LCDPWR Mask                   */
#define LCD_CTRL_LCDVCOMP_Pos                 12                                                      /*!< LCD CTRL: LCDVCOMP Position             */
#define LCD_CTRL_LCDVCOMP_Msk                 (0x03UL << LCD_CTRL_LCDVCOMP_Pos)                       /*!< LCD CTRL: LCDVCOMP Mask                 */
#define LCD_CTRL_WATERMARK_Pos                16                                                      /*!< LCD CTRL: WATERMARK Position            */
#define LCD_CTRL_WATERMARK_Msk                (0x01UL << LCD_CTRL_WATERMARK_Pos)                      /*!< LCD CTRL: WATERMARK Mask                */

/* ---------------------------------  LCD_INTMSK  --------------------------------- */
#define LCD_INTMSK_FUFIM_Pos                  1                                                       /*!< LCD INTMSK: FUFIM Position              */
#define LCD_INTMSK_FUFIM_Msk                  (0x01UL << LCD_INTMSK_FUFIM_Pos)                        /*!< LCD INTMSK: FUFIM Mask                  */
#define LCD_INTMSK_LNBUIM_Pos                 2                                                       /*!< LCD INTMSK: LNBUIM Position             */
#define LCD_INTMSK_LNBUIM_Msk                 (0x01UL << LCD_INTMSK_LNBUIM_Pos)                       /*!< LCD INTMSK: LNBUIM Mask                 */
#define LCD_INTMSK_VCOMPIM_Pos                3                                                       /*!< LCD INTMSK: VCOMPIM Position            */
#define LCD_INTMSK_VCOMPIM_Msk                (0x01UL << LCD_INTMSK_VCOMPIM_Pos)                      /*!< LCD INTMSK: VCOMPIM Mask                */
#define LCD_INTMSK_BERIM_Pos                  4                                                       /*!< LCD INTMSK: BERIM Position              */
#define LCD_INTMSK_BERIM_Msk                  (0x01UL << LCD_INTMSK_BERIM_Pos)                        /*!< LCD INTMSK: BERIM Mask                  */

/* ---------------------------------  LCD_INTRAW  --------------------------------- */
#define LCD_INTRAW_FUFRIS_Pos                 1                                                       /*!< LCD INTRAW: FUFRIS Position             */
#define LCD_INTRAW_FUFRIS_Msk                 (0x01UL << LCD_INTRAW_FUFRIS_Pos)                       /*!< LCD INTRAW: FUFRIS Mask                 */
#define LCD_INTRAW_LNBURIS_Pos                2                                                       /*!< LCD INTRAW: LNBURIS Position            */
#define LCD_INTRAW_LNBURIS_Msk                (0x01UL << LCD_INTRAW_LNBURIS_Pos)                      /*!< LCD INTRAW: LNBURIS Mask                */
#define LCD_INTRAW_VCOMPRIS_Pos               3                                                       /*!< LCD INTRAW: VCOMPRIS Position           */
#define LCD_INTRAW_VCOMPRIS_Msk               (0x01UL << LCD_INTRAW_VCOMPRIS_Pos)                     /*!< LCD INTRAW: VCOMPRIS Mask               */
#define LCD_INTRAW_BERRAW_Pos                 4                                                       /*!< LCD INTRAW: BERRAW Position             */
#define LCD_INTRAW_BERRAW_Msk                 (0x01UL << LCD_INTRAW_BERRAW_Pos)                       /*!< LCD INTRAW: BERRAW Mask                 */

/* ---------------------------------  LCD_INTSTAT  -------------------------------- */
#define LCD_INTSTAT_FUFMIS_Pos                1                                                       /*!< LCD INTSTAT: FUFMIS Position            */
#define LCD_INTSTAT_FUFMIS_Msk                (0x01UL << LCD_INTSTAT_FUFMIS_Pos)                      /*!< LCD INTSTAT: FUFMIS Mask                */
#define LCD_INTSTAT_LNBUMIS_Pos               2                                                       /*!< LCD INTSTAT: LNBUMIS Position           */
#define LCD_INTSTAT_LNBUMIS_Msk               (0x01UL << LCD_INTSTAT_LNBUMIS_Pos)                     /*!< LCD INTSTAT: LNBUMIS Mask               */
#define LCD_INTSTAT_VCOMPMIS_Pos              3                                                       /*!< LCD INTSTAT: VCOMPMIS Position          */
#define LCD_INTSTAT_VCOMPMIS_Msk              (0x01UL << LCD_INTSTAT_VCOMPMIS_Pos)                    /*!< LCD INTSTAT: VCOMPMIS Mask              */
#define LCD_INTSTAT_BERMIS_Pos                4                                                       /*!< LCD INTSTAT: BERMIS Position            */
#define LCD_INTSTAT_BERMIS_Msk                (0x01UL << LCD_INTSTAT_BERMIS_Pos)                      /*!< LCD INTSTAT: BERMIS Mask                */

/* ---------------------------------  LCD_INTCLR  --------------------------------- */
#define LCD_INTCLR_FUFIC_Pos                  1                                                       /*!< LCD INTCLR: FUFIC Position              */
#define LCD_INTCLR_FUFIC_Msk                  (0x01UL << LCD_INTCLR_FUFIC_Pos)                        /*!< LCD INTCLR: FUFIC Mask                  */
#define LCD_INTCLR_LNBUIC_Pos                 2                                                       /*!< LCD INTCLR: LNBUIC Position             */
#define LCD_INTCLR_LNBUIC_Msk                 (0x01UL << LCD_INTCLR_LNBUIC_Pos)                       /*!< LCD INTCLR: LNBUIC Mask                 */
#define LCD_INTCLR_VCOMPIC_Pos                3                                                       /*!< LCD INTCLR: VCOMPIC Position            */
#define LCD_INTCLR_VCOMPIC_Msk                (0x01UL << LCD_INTCLR_VCOMPIC_Pos)                      /*!< LCD INTCLR: VCOMPIC Mask                */
#define LCD_INTCLR_BERIC_Pos                  4                                                       /*!< LCD INTCLR: BERIC Position              */
#define LCD_INTCLR_BERIC_Msk                  (0x01UL << LCD_INTCLR_BERIC_Pos)                        /*!< LCD INTCLR: BERIC Mask                  */

/* ---------------------------------  LCD_UPCURR  --------------------------------- */
#define LCD_UPCURR_LCDUPCURR_Pos              0                                                       /*!< LCD UPCURR: LCDUPCURR Position          */
#define LCD_UPCURR_LCDUPCURR_Msk              (0xffffffffUL << LCD_UPCURR_LCDUPCURR_Pos)              /*!< LCD UPCURR: LCDUPCURR Mask              */

/* ---------------------------------  LCD_LPCURR  --------------------------------- */
#define LCD_LPCURR_LCDLPCURR_Pos              0                                                       /*!< LCD LPCURR: LCDLPCURR Position          */
#define LCD_LPCURR_LCDLPCURR_Msk              (0xffffffffUL << LCD_LPCURR_LCDLPCURR_Pos)              /*!< LCD LPCURR: LCDLPCURR Mask              */

/* -----------------------------------  LCD_PAL  ---------------------------------- */
#define LCD_PAL_R04_0_Pos                     0                                                       /*!< LCD PAL: R04_0 Position                 */
#define LCD_PAL_R04_0_Msk                     (0x1fUL << LCD_PAL_R04_0_Pos)                           /*!< LCD PAL: R04_0 Mask                     */
#define LCD_PAL_G04_0_Pos                     5                                                       /*!< LCD PAL: G04_0 Position                 */
#define LCD_PAL_G04_0_Msk                     (0x1fUL << LCD_PAL_G04_0_Pos)                           /*!< LCD PAL: G04_0 Mask                     */
#define LCD_PAL_B04_0_Pos                     10                                                      /*!< LCD PAL: B04_0 Position                 */
#define LCD_PAL_B04_0_Msk                     (0x1fUL << LCD_PAL_B04_0_Pos)                           /*!< LCD PAL: B04_0 Mask                     */
#define LCD_PAL_I0_Pos                        15                                                      /*!< LCD PAL: I0 Position                    */
#define LCD_PAL_I0_Msk                        (0x01UL << LCD_PAL_I0_Pos)                              /*!< LCD PAL: I0 Mask                        */
#define LCD_PAL_R14_0_Pos                     16                                                      /*!< LCD PAL: R14_0 Position                 */
#define LCD_PAL_R14_0_Msk                     (0x1fUL << LCD_PAL_R14_0_Pos)                           /*!< LCD PAL: R14_0 Mask                     */
#define LCD_PAL_G14_0_Pos                     21                                                      /*!< LCD PAL: G14_0 Position                 */
#define LCD_PAL_G14_0_Msk                     (0x1fUL << LCD_PAL_G14_0_Pos)                           /*!< LCD PAL: G14_0 Mask                     */
#define LCD_PAL_B14_0_Pos                     26                                                      /*!< LCD PAL: B14_0 Position                 */
#define LCD_PAL_B14_0_Msk                     (0x1fUL << LCD_PAL_B14_0_Pos)                           /*!< LCD PAL: B14_0 Mask                     */
#define LCD_PAL_I1_Pos                        31                                                      /*!< LCD PAL: I1 Position                    */
#define LCD_PAL_I1_Msk                        (0x01UL << LCD_PAL_I1_Pos)                              /*!< LCD PAL: I1 Mask                        */

/* --------------------------------  LCD_CRSR_IMG  -------------------------------- */
#define LCD_CRSR_IMG_CRSR_IMG_Pos             0                                                       /*!< LCD CRSR_IMG: CRSR_IMG Position         */
#define LCD_CRSR_IMG_CRSR_IMG_Msk             (0xffffffffUL << LCD_CRSR_IMG_CRSR_IMG_Pos)             /*!< LCD CRSR_IMG: CRSR_IMG Mask             */

/* --------------------------------  LCD_CRSR_CTRL  ------------------------------- */
#define LCD_CRSR_CTRL_CrsrOn_Pos              0                                                       /*!< LCD CRSR_CTRL: CrsrOn Position          */
#define LCD_CRSR_CTRL_CrsrOn_Msk              (0x01UL << LCD_CRSR_CTRL_CrsrOn_Pos)                    /*!< LCD CRSR_CTRL: CrsrOn Mask              */
#define LCD_CRSR_CTRL_CRSRNUM1_0_Pos          4                                                       /*!< LCD CRSR_CTRL: CRSRNUM1_0 Position      */
#define LCD_CRSR_CTRL_CRSRNUM1_0_Msk          (0x03UL << LCD_CRSR_CTRL_CRSRNUM1_0_Pos)                /*!< LCD CRSR_CTRL: CRSRNUM1_0 Mask          */

/* --------------------------------  LCD_CRSR_CFG  -------------------------------- */
#define LCD_CRSR_CFG_CrsrSize_Pos             0                                                       /*!< LCD CRSR_CFG: CrsrSize Position         */
#define LCD_CRSR_CFG_CrsrSize_Msk             (0x01UL << LCD_CRSR_CFG_CrsrSize_Pos)                   /*!< LCD CRSR_CFG: CrsrSize Mask             */
#define LCD_CRSR_CFG_FRAMESYNC_Pos            1                                                       /*!< LCD CRSR_CFG: FRAMESYNC Position        */
#define LCD_CRSR_CFG_FRAMESYNC_Msk            (0x01UL << LCD_CRSR_CFG_FRAMESYNC_Pos)                  /*!< LCD CRSR_CFG: FRAMESYNC Mask            */

/* --------------------------------  LCD_CRSR_PAL0  ------------------------------- */
#define LCD_CRSR_PAL0_RED_Pos                 0                                                       /*!< LCD CRSR_PAL0: RED Position             */
#define LCD_CRSR_PAL0_RED_Msk                 (0x000000ffUL << LCD_CRSR_PAL0_RED_Pos)                 /*!< LCD CRSR_PAL0: RED Mask                 */
#define LCD_CRSR_PAL0_GREEN_Pos               8                                                       /*!< LCD CRSR_PAL0: GREEN Position           */
#define LCD_CRSR_PAL0_GREEN_Msk               (0x000000ffUL << LCD_CRSR_PAL0_GREEN_Pos)               /*!< LCD CRSR_PAL0: GREEN Mask               */
#define LCD_CRSR_PAL0_BLUE_Pos                16                                                      /*!< LCD CRSR_PAL0: BLUE Position            */
#define LCD_CRSR_PAL0_BLUE_Msk                (0x000000ffUL << LCD_CRSR_PAL0_BLUE_Pos)                /*!< LCD CRSR_PAL0: BLUE Mask                */

/* --------------------------------  LCD_CRSR_PAL1  ------------------------------- */
#define LCD_CRSR_PAL1_RED_Pos                 0                                                       /*!< LCD CRSR_PAL1: RED Position             */
#define LCD_CRSR_PAL1_RED_Msk                 (0x000000ffUL << LCD_CRSR_PAL1_RED_Pos)                 /*!< LCD CRSR_PAL1: RED Mask                 */
#define LCD_CRSR_PAL1_GREEN_Pos               8                                                       /*!< LCD CRSR_PAL1: GREEN Position           */
#define LCD_CRSR_PAL1_GREEN_Msk               (0x000000ffUL << LCD_CRSR_PAL1_GREEN_Pos)               /*!< LCD CRSR_PAL1: GREEN Mask               */
#define LCD_CRSR_PAL1_BLUE_Pos                16                                                      /*!< LCD CRSR_PAL1: BLUE Position            */
#define LCD_CRSR_PAL1_BLUE_Msk                (0x000000ffUL << LCD_CRSR_PAL1_BLUE_Pos)                /*!< LCD CRSR_PAL1: BLUE Mask                */

/* ---------------------------------  LCD_CRSR_XY  -------------------------------- */
#define LCD_CRSR_XY_CRSRX_Pos                 0                                                       /*!< LCD CRSR_XY: CRSRX Position             */
#define LCD_CRSR_XY_CRSRX_Msk                 (0x000003ffUL << LCD_CRSR_XY_CRSRX_Pos)                 /*!< LCD CRSR_XY: CRSRX Mask                 */
#define LCD_CRSR_XY_CRSRY_Pos                 16                                                      /*!< LCD CRSR_XY: CRSRY Position             */
#define LCD_CRSR_XY_CRSRY_Msk                 (0x000003ffUL << LCD_CRSR_XY_CRSRY_Pos)                 /*!< LCD CRSR_XY: CRSRY Mask                 */

/* --------------------------------  LCD_CRSR_CLIP  ------------------------------- */
#define LCD_CRSR_CLIP_CRSRCLIPX_Pos           0                                                       /*!< LCD CRSR_CLIP: CRSRCLIPX Position       */
#define LCD_CRSR_CLIP_CRSRCLIPX_Msk           (0x3fUL << LCD_CRSR_CLIP_CRSRCLIPX_Pos)                 /*!< LCD CRSR_CLIP: CRSRCLIPX Mask           */
#define LCD_CRSR_CLIP_CRSRCLIPY_Pos           8                                                       /*!< LCD CRSR_CLIP: CRSRCLIPY Position       */
#define LCD_CRSR_CLIP_CRSRCLIPY_Msk           (0x3fUL << LCD_CRSR_CLIP_CRSRCLIPY_Pos)                 /*!< LCD CRSR_CLIP: CRSRCLIPY Mask           */

