MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ----------------------------  ETHERNET_MAC_MII_ADDR  --------------------------- */
#define ETHERNET_MAC_MII_ADDR_GB_Pos          0                                                       /*!< ETHERNET MAC_MII_ADDR: GB Position      */
#define ETHERNET_MAC_MII_ADDR_GB_Msk          (0x01UL << ETHERNET_MAC_MII_ADDR_GB_Pos)                /*!< ETHERNET MAC_MII_ADDR: GB Mask          */
#define ETHERNET_MAC_MII_ADDR_W_Pos           1                                                       /*!< ETHERNET MAC_MII_ADDR: W Position       */
#define ETHERNET_MAC_MII_ADDR_W_Msk           (0x01UL << ETHERNET_MAC_MII_ADDR_W_Pos)                 /*!< ETHERNET MAC_MII_ADDR: W Mask           */
#define ETHERNET_MAC_MII_ADDR_CR_Pos          2                                                       /*!< ETHERNET MAC_MII_ADDR: CR Position      */
#define ETHERNET_MAC_MII_ADDR_CR_Msk          (0x0fUL << ETHERNET_MAC_MII_ADDR_CR_Pos)                /*!< ETHERNET MAC_MII_ADDR: CR Mask          */
#define ETHERNET_MAC_MII_ADDR_GR_Pos          6                                                       /*!< ETHERNET MAC_MII_ADDR: GR Position      */
#define ETHERNET_MAC_MII_ADDR_GR_Msk          (0x1fUL << ETHERNET_MAC_MII_ADDR_GR_Pos)                /*!< ETHERNET MAC_MII_ADDR: GR Mask          */
#define ETHERNET_MAC_MII_ADDR_PA_Pos          11                                                      /*!< ETHERNET MAC_MII_ADDR: PA Position      */
#define ETHERNET_MAC_MII_ADDR_PA_Msk          (0x1fUL << ETHERNET_MAC_MII_ADDR_PA_Pos)                /*!< ETHERNET MAC_MII_ADDR: PA Mask          */

/* ----------------------------  ETHERNET_MAC_MII_DATA  --------------------------- */
#define ETHERNET_MAC_MII_DATA_GD_Pos          0                                                       /*!< ETHERNET MAC_MII_DATA: GD Position      */
#define ETHERNET_MAC_MII_DATA_GD_Msk          (0x0000ffffUL << ETHERNET_MAC_MII_DATA_GD_Pos)          /*!< ETHERNET MAC_MII_DATA: GD Mask          */

/* ---------------------------  ETHERNET_MAC_FLOW_CTRL  --------------------------- */
#define ETHERNET_MAC_FLOW_CTRL_FCB_Pos        0                                                       /*!< ETHERNET MAC_FLOW_CTRL: FCB Position    */
#define ETHERNET_MAC_FLOW_CTRL_FCB_Msk        (0x01UL << ETHERNET_MAC_FLOW_CTRL_FCB_Pos)              /*!< ETHERNET MAC_FLOW_CTRL: FCB Mask        */
#define ETHERNET_MAC_FLOW_CTRL_TFE_Pos        1                                                       /*!< ETHERNET MAC_FLOW_CTRL: TFE Position    */
#define ETHERNET_MAC_FLOW_CTRL_TFE_Msk        (0x01UL << ETHERNET_MAC_FLOW_CTRL_TFE_Pos)              /*!< ETHERNET MAC_FLOW_CTRL: TFE Mask        */
#define ETHERNET_MAC_FLOW_CTRL_RFE_Pos        2                                                       /*!< ETHERNET MAC_FLOW_CTRL: RFE Position    */
#define ETHERNET_MAC_FLOW_CTRL_RFE_Msk        (0x01UL << ETHERNET_MAC_FLOW_CTRL_RFE_Pos)              /*!< ETHERNET MAC_FLOW_CTRL: RFE Mask        */
#define ETHERNET_MAC_FLOW_CTRL_UP_Pos         3                                                       /*!< ETHERNET MAC_FLOW_CTRL: UP Position     */
#define ETHERNET_MAC_FLOW_CTRL_UP_Msk         (0x01UL << ETHERNET_MAC_FLOW_CTRL_UP_Pos)               /*!< ETHERNET MAC_FLOW_CTRL: UP Mask         */
#define ETHERNET_MAC_FLOW_CTRL_PLT_Pos        4                                                       /*!< ETHERNET MAC_FLOW_CTRL: PLT Position    */
#define ETHERNET_MAC_FLOW_CTRL_PLT_Msk        (0x03UL << ETHERNET_MAC_FLOW_CTRL_PLT_Pos)              /*!< ETHERNET MAC_FLOW_CTRL: PLT Mask        */
#define ETHERNET_MAC_FLOW_CTRL_DZPQ_Pos       7                                                       /*!< ETHERNET MAC_FLOW_CTRL: DZPQ Position   */
#define ETHERNET_MAC_FLOW_CTRL_DZPQ_Msk       (0x01UL << ETHERNET_MAC_FLOW_CTRL_DZPQ_Pos)             /*!< ETHERNET MAC_FLOW_CTRL: DZPQ Mask       */
#define ETHERNET_MAC_FLOW_CTRL_PT_Pos         16                                                      /*!< ETHERNET MAC_FLOW_CTRL: PT Position     */
#define ETHERNET_MAC_FLOW_CTRL_PT_Msk         (0x0000ffffUL << ETHERNET_MAC_FLOW_CTRL_PT_Pos)         /*!< ETHERNET MAC_FLOW_CTRL: PT Mask         */

/* ----------------------------  ETHERNET_MAC_VLAN_TAG  --------------------------- */
#define ETHERNET_MAC_VLAN_TAG_VL_Pos          0                                                       /*!< ETHERNET MAC_VLAN_TAG: VL Position      */
#define ETHERNET_MAC_VLAN_TAG_VL_Msk          (0x0000ffffUL << ETHERNET_MAC_VLAN_TAG_VL_Pos)          /*!< ETHERNET MAC_VLAN_TAG: VL Mask          */
#define ETHERNET_MAC_VLAN_TAG_ETV_Pos         16                                                      /*!< ETHERNET MAC_VLAN_TAG: ETV Position     */
#define ETHERNET_MAC_VLAN_TAG_ETV_Msk         (0x01UL << ETHERNET_MAC_VLAN_TAG_ETV_Pos)               /*!< ETHERNET MAC_VLAN_TAG: ETV Mask         */

/* -----------------------------  ETHERNET_MAC_DEBUG  ----------------------------- */
#define ETHERNET_MAC_DEBUG_RXIDLESTAT_Pos     0                                                       /*!< ETHERNET MAC_DEBUG: RXIDLESTAT Position */
#define ETHERNET_MAC_DEBUG_RXIDLESTAT_Msk     (0x01UL << ETHERNET_MAC_DEBUG_RXIDLESTAT_Pos)           /*!< ETHERNET MAC_DEBUG: RXIDLESTAT Mask     */
#define ETHERNET_MAC_DEBUG_FIFOSTAT0_Pos      1                                                       /*!< ETHERNET MAC_DEBUG: FIFOSTAT0 Position  */
#define ETHERNET_MAC_DEBUG_FIFOSTAT0_Msk      (0x03UL << ETHERNET_MAC_DEBUG_FIFOSTAT0_Pos)            /*!< ETHERNET MAC_DEBUG: FIFOSTAT0 Mask      */
#define ETHERNET_MAC_DEBUG_RXFIFOSTAT1_Pos    4                                                       /*!< ETHERNET MAC_DEBUG: RXFIFOSTAT1 Position */
#define ETHERNET_MAC_DEBUG_RXFIFOSTAT1_Msk    (0x01UL << ETHERNET_MAC_DEBUG_RXFIFOSTAT1_Pos)          /*!< ETHERNET MAC_DEBUG: RXFIFOSTAT1 Mask    */
#define ETHERNET_MAC_DEBUG_RXFIFOSTAT_Pos     5                                                       /*!< ETHERNET MAC_DEBUG: RXFIFOSTAT Position */
#define ETHERNET_MAC_DEBUG_RXFIFOSTAT_Msk     (0x03UL << ETHERNET_MAC_DEBUG_RXFIFOSTAT_Pos)           /*!< ETHERNET MAC_DEBUG: RXFIFOSTAT Mask     */
#define ETHERNET_MAC_DEBUG_RXFIFOLVL_Pos      8                                                       /*!< ETHERNET MAC_DEBUG: RXFIFOLVL Position  */
#define ETHERNET_MAC_DEBUG_RXFIFOLVL_Msk      (0x03UL << ETHERNET_MAC_DEBUG_RXFIFOLVL_Pos)            /*!< ETHERNET MAC_DEBUG: RXFIFOLVL Mask      */
#define ETHERNET_MAC_DEBUG_TXIDLESTAT_Pos     16                                                      /*!< ETHERNET MAC_DEBUG: TXIDLESTAT Position */
#define ETHERNET_MAC_DEBUG_TXIDLESTAT_Msk     (0x01UL << ETHERNET_MAC_DEBUG_TXIDLESTAT_Pos)           /*!< ETHERNET MAC_DEBUG: TXIDLESTAT Mask     */
#define ETHERNET_MAC_DEBUG_TXSTAT_Pos         17                                                      /*!< ETHERNET MAC_DEBUG: TXSTAT Position     */
#define ETHERNET_MAC_DEBUG_TXSTAT_Msk         (0x03UL << ETHERNET_MAC_DEBUG_TXSTAT_Pos)               /*!< ETHERNET MAC_DEBUG: TXSTAT Mask         */
#define ETHERNET_MAC_DEBUG_PAUSE_Pos          19                                                      /*!< ETHERNET MAC_DEBUG: PAUSE Position      */
#define ETHERNET_MAC_DEBUG_PAUSE_Msk          (0x01UL << ETHERNET_MAC_DEBUG_PAUSE_Pos)                /*!< ETHERNET MAC_DEBUG: PAUSE Mask          */
#define ETHERNET_MAC_DEBUG_TXFIFOSTAT_Pos     20                                                      /*!< ETHERNET MAC_DEBUG: TXFIFOSTAT Position */
#define ETHERNET_MAC_DEBUG_TXFIFOSTAT_Msk     (0x03UL << ETHERNET_MAC_DEBUG_TXFIFOSTAT_Pos)           /*!< ETHERNET MAC_DEBUG: TXFIFOSTAT Mask     */
#define ETHERNET_MAC_DEBUG_TXFIFOSTAT1_Pos    22                                                      /*!< ETHERNET MAC_DEBUG: TXFIFOSTAT1 Position */
#define ETHERNET_MAC_DEBUG_TXFIFOSTAT1_Msk    (0x01UL << ETHERNET_MAC_DEBUG_TXFIFOSTAT1_Pos)          /*!< ETHERNET MAC_DEBUG: TXFIFOSTAT1 Mask    */
#define ETHERNET_MAC_DEBUG_TXFIFOLVL_Pos      24                                                      /*!< ETHERNET MAC_DEBUG: TXFIFOLVL Position  */
#define ETHERNET_MAC_DEBUG_TXFIFOLVL_Msk      (0x01UL << ETHERNET_MAC_DEBUG_TXFIFOLVL_Pos)            /*!< ETHERNET MAC_DEBUG: TXFIFOLVL Mask      */
#define ETHERNET_MAC_DEBUG_TXFIFOFULL_Pos     25                                                      /*!< ETHERNET MAC_DEBUG: TXFIFOFULL Position */
#define ETHERNET_MAC_DEBUG_TXFIFOFULL_Msk     (0x01UL << ETHERNET_MAC_DEBUG_TXFIFOFULL_Pos)           /*!< ETHERNET MAC_DEBUG: TXFIFOFULL Mask     */

/* --------------------------  ETHERNET_MAC_RWAKE_FRFLT  -------------------------- */
#define ETHERNET_MAC_RWAKE_FRFLT_ADDR_Pos     0                                                       /*!< ETHERNET MAC_RWAKE_FRFLT: ADDR Position */
#define ETHERNET_MAC_RWAKE_FRFLT_ADDR_Msk     (0xffffffffUL << ETHERNET_MAC_RWAKE_FRFLT_ADDR_Pos)     /*!< ETHERNET MAC_RWAKE_FRFLT: ADDR Mask     */

/* -------------------------  ETHERNET_MAC_PMT_CTRL_STAT  ------------------------- */
#define ETHERNET_MAC_PMT_CTRL_STAT_PD_Pos     0                                                       /*!< ETHERNET MAC_PMT_CTRL_STAT: PD Position */
#define ETHERNET_MAC_PMT_CTRL_STAT_PD_Msk     (0x01UL << ETHERNET_MAC_PMT_CTRL_STAT_PD_Pos)           /*!< ETHERNET MAC_PMT_CTRL_STAT: PD Mask     */
#define ETHERNET_MAC_PMT_CTRL_STAT_MPE_Pos    1                                                       /*!< ETHERNET MAC_PMT_CTRL_STAT: MPE Position */
#define ETHERNET_MAC_PMT_CTRL_STAT_MPE_Msk    (0x01UL << ETHERNET_MAC_PMT_CTRL_STAT_MPE_Pos)          /*!< ETHERNET MAC_PMT_CTRL_STAT: MPE Mask    */
#define ETHERNET_MAC_PMT_CTRL_STAT_WFE_Pos    2                                                       /*!< ETHERNET MAC_PMT_CTRL_STAT: WFE Position */
#define ETHERNET_MAC_PMT_CTRL_STAT_WFE_Msk    (0x01UL << ETHERNET_MAC_PMT_CTRL_STAT_WFE_Pos)          /*!< ETHERNET MAC_PMT_CTRL_STAT: WFE Mask    */
#define ETHERNET_MAC_PMT_CTRL_STAT_MPR_Pos    5                                                       /*!< ETHERNET MAC_PMT_CTRL_STAT: MPR Position */
#define ETHERNET_MAC_PMT_CTRL_STAT_MPR_Msk    (0x01UL << ETHERNET_MAC_PMT_CTRL_STAT_MPR_Pos)          /*!< ETHERNET MAC_PMT_CTRL_STAT: MPR Mask    */
#define ETHERNET_MAC_PMT_CTRL_STAT_WFR_Pos    6                                                       /*!< ETHERNET MAC_PMT_CTRL_STAT: WFR Position */
#define ETHERNET_MAC_PMT_CTRL_STAT_WFR_Msk    (0x01UL << ETHERNET_MAC_PMT_CTRL_STAT_WFR_Pos)          /*!< ETHERNET MAC_PMT_CTRL_STAT: WFR Mask    */
#define ETHERNET_MAC_PMT_CTRL_STAT_GU_Pos     9                                                       /*!< ETHERNET MAC_PMT_CTRL_STAT: GU Position */
#define ETHERNET_MAC_PMT_CTRL_STAT_GU_Msk     (0x01UL << ETHERNET_MAC_PMT_CTRL_STAT_GU_Pos)           /*!< ETHERNET MAC_PMT_CTRL_STAT: GU Mask     */
#define ETHERNET_MAC_PMT_CTRL_STAT_WFFRPR_Pos 31                                                      /*!< ETHERNET MAC_PMT_CTRL_STAT: WFFRPR Position */
#define ETHERNET_MAC_PMT_CTRL_STAT_WFFRPR_Msk (0x01UL << ETHERNET_MAC_PMT_CTRL_STAT_WFFRPR_Pos)       /*!< ETHERNET MAC_PMT_CTRL_STAT: WFFRPR Mask */

/* ------------------------------  ETHERNET_MAC_INTR  ----------------------------- */
#define ETHERNET_MAC_INTR_PMT_Pos             3                                                       /*!< ETHERNET MAC_INTR: PMT Position         */
#define ETHERNET_MAC_INTR_PMT_Msk             (0x01UL << ETHERNET_MAC_INTR_PMT_Pos)                   /*!< ETHERNET MAC_INTR: PMT Mask             */
#define ETHERNET_MAC_INTR_TS_Pos              9                                                       /*!< ETHERNET MAC_INTR: TS Position          */
#define ETHERNET_MAC_INTR_TS_Msk              (0x01UL << ETHERNET_MAC_INTR_TS_Pos)                    /*!< ETHERNET MAC_INTR: TS Mask              */

