MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ----------------------------  ETHERNET_DMA_OP_MODE  ---------------------------- */
#define ETHERNET_DMA_OP_MODE_SR_Pos           1                                                       /*!< ETHERNET DMA_OP_MODE: SR Position       */
#define ETHERNET_DMA_OP_MODE_SR_Msk           (0x01UL << ETHERNET_DMA_OP_MODE_SR_Pos)                 /*!< ETHERNET DMA_OP_MODE: SR Mask           */
#define ETHERNET_DMA_OP_MODE_OSF_Pos          2                                                       /*!< ETHERNET DMA_OP_MODE: OSF Position      */
#define ETHERNET_DMA_OP_MODE_OSF_Msk          (0x01UL << ETHERNET_DMA_OP_MODE_OSF_Pos)                /*!< ETHERNET DMA_OP_MODE: OSF Mask          */
#define ETHERNET_DMA_OP_MODE_RTC_Pos          3                                                       /*!< ETHERNET DMA_OP_MODE: RTC Position      */
#define ETHERNET_DMA_OP_MODE_RTC_Msk          (0x03UL << ETHERNET_DMA_OP_MODE_RTC_Pos)                /*!< ETHERNET DMA_OP_MODE: RTC Mask          */
#define ETHERNET_DMA_OP_MODE_FUF_Pos          6                                                       /*!< ETHERNET DMA_OP_MODE: FUF Position      */
#define ETHERNET_DMA_OP_MODE_FUF_Msk          (0x01UL << ETHERNET_DMA_OP_MODE_FUF_Pos)                /*!< ETHERNET DMA_OP_MODE: FUF Mask          */
#define ETHERNET_DMA_OP_MODE_FEF_Pos          7                                                       /*!< ETHERNET DMA_OP_MODE: FEF Position      */
#define ETHERNET_DMA_OP_MODE_FEF_Msk          (0x01UL << ETHERNET_DMA_OP_MODE_FEF_Pos)                /*!< ETHERNET DMA_OP_MODE: FEF Mask          */
#define ETHERNET_DMA_OP_MODE_ST_Pos           13                                                      /*!< ETHERNET DMA_OP_MODE: ST Position       */
#define ETHERNET_DMA_OP_MODE_ST_Msk           (0x01UL << ETHERNET_DMA_OP_MODE_ST_Pos)                 /*!< ETHERNET DMA_OP_MODE: ST Mask           */
#define ETHERNET_DMA_OP_MODE_TTC_Pos          14                                                      /*!< ETHERNET DMA_OP_MODE: TTC Position      */
#define ETHERNET_DMA_OP_MODE_TTC_Msk          (0x07UL << ETHERNET_DMA_OP_MODE_TTC_Pos)                /*!< ETHERNET DMA_OP_MODE: TTC Mask          */
#define ETHERNET_DMA_OP_MODE_FTF_Pos          20                                                      /*!< ETHERNET DMA_OP_MODE: FTF Position      */
#define ETHERNET_DMA_OP_MODE_FTF_Msk          (0x01UL << ETHERNET_DMA_OP_MODE_FTF_Pos)                /*!< ETHERNET DMA_OP_MODE: FTF Mask          */
#define ETHERNET_DMA_OP_MODE_DFF_Pos          24                                                      /*!< ETHERNET DMA_OP_MODE: DFF Position      */
#define ETHERNET_DMA_OP_MODE_DFF_Msk          (0x01UL << ETHERNET_DMA_OP_MODE_DFF_Pos)                /*!< ETHERNET DMA_OP_MODE: DFF Mask          */

/* -----------------------------  ETHERNET_DMA_INT_EN  ---------------------------- */
#define ETHERNET_DMA_INT_EN_TIE_Pos           0                                                       /*!< ETHERNET DMA_INT_EN: TIE Position       */
#define ETHERNET_DMA_INT_EN_TIE_Msk           (0x01UL << ETHERNET_DMA_INT_EN_TIE_Pos)                 /*!< ETHERNET DMA_INT_EN: TIE Mask           */
#define ETHERNET_DMA_INT_EN_TSE_Pos           1                                                       /*!< ETHERNET DMA_INT_EN: TSE Position       */
#define ETHERNET_DMA_INT_EN_TSE_Msk           (0x01UL << ETHERNET_DMA_INT_EN_TSE_Pos)                 /*!< ETHERNET DMA_INT_EN: TSE Mask           */
#define ETHERNET_DMA_INT_EN_TUE_Pos           2                                                       /*!< ETHERNET DMA_INT_EN: TUE Position       */
#define ETHERNET_DMA_INT_EN_TUE_Msk           (0x01UL << ETHERNET_DMA_INT_EN_TUE_Pos)                 /*!< ETHERNET DMA_INT_EN: TUE Mask           */
#define ETHERNET_DMA_INT_EN_TJE_Pos           3                                                       /*!< ETHERNET DMA_INT_EN: TJE Position       */
#define ETHERNET_DMA_INT_EN_TJE_Msk           (0x01UL << ETHERNET_DMA_INT_EN_TJE_Pos)                 /*!< ETHERNET DMA_INT_EN: TJE Mask           */
#define ETHERNET_DMA_INT_EN_OVE_Pos           4                                                       /*!< ETHERNET DMA_INT_EN: OVE Position       */
#define ETHERNET_DMA_INT_EN_OVE_Msk           (0x01UL << ETHERNET_DMA_INT_EN_OVE_Pos)                 /*!< ETHERNET DMA_INT_EN: OVE Mask           */
#define ETHERNET_DMA_INT_EN_UNE_Pos           5                                                       /*!< ETHERNET DMA_INT_EN: UNE Position       */
#define ETHERNET_DMA_INT_EN_UNE_Msk           (0x01UL << ETHERNET_DMA_INT_EN_UNE_Pos)                 /*!< ETHERNET DMA_INT_EN: UNE Mask           */
#define ETHERNET_DMA_INT_EN_RIE_Pos           6                                                       /*!< ETHERNET DMA_INT_EN: RIE Position       */
#define ETHERNET_DMA_INT_EN_RIE_Msk           (0x01UL << ETHERNET_DMA_INT_EN_RIE_Pos)                 /*!< ETHERNET DMA_INT_EN: RIE Mask           */
#define ETHERNET_DMA_INT_EN_RUE_Pos           7                                                       /*!< ETHERNET DMA_INT_EN: RUE Position       */
#define ETHERNET_DMA_INT_EN_RUE_Msk           (0x01UL << ETHERNET_DMA_INT_EN_RUE_Pos)                 /*!< ETHERNET DMA_INT_EN: RUE Mask           */
#define ETHERNET_DMA_INT_EN_RSE_Pos           8                                                       /*!< ETHERNET DMA_INT_EN: RSE Position       */
#define ETHERNET_DMA_INT_EN_RSE_Msk           (0x01UL << ETHERNET_DMA_INT_EN_RSE_Pos)                 /*!< ETHERNET DMA_INT_EN: RSE Mask           */
#define ETHERNET_DMA_INT_EN_RWE_Pos           9                                                       /*!< ETHERNET DMA_INT_EN: RWE Position       */
#define ETHERNET_DMA_INT_EN_RWE_Msk           (0x01UL << ETHERNET_DMA_INT_EN_RWE_Pos)                 /*!< ETHERNET DMA_INT_EN: RWE Mask           */
#define ETHERNET_DMA_INT_EN_ETE_Pos           10                                                      /*!< ETHERNET DMA_INT_EN: ETE Position       */
#define ETHERNET_DMA_INT_EN_ETE_Msk           (0x01UL << ETHERNET_DMA_INT_EN_ETE_Pos)                 /*!< ETHERNET DMA_INT_EN: ETE Mask           */
#define ETHERNET_DMA_INT_EN_FBE_Pos           13                                                      /*!< ETHERNET DMA_INT_EN: FBE Position       */
#define ETHERNET_DMA_INT_EN_FBE_Msk           (0x01UL << ETHERNET_DMA_INT_EN_FBE_Pos)                 /*!< ETHERNET DMA_INT_EN: FBE Mask           */
#define ETHERNET_DMA_INT_EN_ERE_Pos           14                                                      /*!< ETHERNET DMA_INT_EN: ERE Position       */
#define ETHERNET_DMA_INT_EN_ERE_Msk           (0x01UL << ETHERNET_DMA_INT_EN_ERE_Pos)                 /*!< ETHERNET DMA_INT_EN: ERE Mask           */
#define ETHERNET_DMA_INT_EN_AIE_Pos           15                                                      /*!< ETHERNET DMA_INT_EN: AIE Position       */
#define ETHERNET_DMA_INT_EN_AIE_Msk           (0x01UL << ETHERNET_DMA_INT_EN_AIE_Pos)                 /*!< ETHERNET DMA_INT_EN: AIE Mask           */
#define ETHERNET_DMA_INT_EN_NIE_Pos           16                                                      /*!< ETHERNET DMA_INT_EN: NIE Position       */
#define ETHERNET_DMA_INT_EN_NIE_Msk           (0x01UL << ETHERNET_DMA_INT_EN_NIE_Pos)                 /*!< ETHERNET DMA_INT_EN: NIE Mask           */

/* ---------------------------  ETHERNET_DMA_MFRM_BUFOF  -------------------------- */
#define ETHERNET_DMA_MFRM_BUFOF_FMC_Pos       0                                                       /*!< ETHERNET DMA_MFRM_BUFOF: FMC Position   */
#define ETHERNET_DMA_MFRM_BUFOF_FMC_Msk       (0x0000ffffUL << ETHERNET_DMA_MFRM_BUFOF_FMC_Pos)       /*!< ETHERNET DMA_MFRM_BUFOF: FMC Mask       */
#define ETHERNET_DMA_MFRM_BUFOF_OC_Pos        16                                                      /*!< ETHERNET DMA_MFRM_BUFOF: OC Position    */
#define ETHERNET_DMA_MFRM_BUFOF_OC_Msk        (0x01UL << ETHERNET_DMA_MFRM_BUFOF_OC_Pos)              /*!< ETHERNET DMA_MFRM_BUFOF: OC Mask        */
#define ETHERNET_DMA_MFRM_BUFOF_FMA_Pos       17                                                      /*!< ETHERNET DMA_MFRM_BUFOF: FMA Position   */
#define ETHERNET_DMA_MFRM_BUFOF_FMA_Msk       (0x000007ffUL << ETHERNET_DMA_MFRM_BUFOF_FMA_Pos)       /*!< ETHERNET DMA_MFRM_BUFOF: FMA Mask       */
#define ETHERNET_DMA_MFRM_BUFOF_OF_Pos        28                                                      /*!< ETHERNET DMA_MFRM_BUFOF: OF Position    */
#define ETHERNET_DMA_MFRM_BUFOF_OF_Msk        (0x01UL << ETHERNET_DMA_MFRM_BUFOF_OF_Pos)              /*!< ETHERNET DMA_MFRM_BUFOF: OF Mask        */

