MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* --------------------------  ETHERNET_DMA_REC_INT_WDT  -------------------------- */
#define ETHERNET_DMA_REC_INT_WDT_RIWT_Pos     0                                                       /*!< ETHERNET DMA_REC_INT_WDT: RIWT Position */
#define ETHERNET_DMA_REC_INT_WDT_RIWT_Msk     (0x000000ffUL << ETHERNET_DMA_REC_INT_WDT_RIWT_Pos)     /*!< ETHERNET DMA_REC_INT_WDT: RIWT Mask     */

/* -----------------------  ETHERNET_DMA_CURHOST_TRANS_DES  ----------------------- */
#define ETHERNET_DMA_CURHOST_TRANS_DES_HTD_Pos 0                                                      /*!< ETHERNET DMA_CURHOST_TRANS_DES: HTD Position */
#define ETHERNET_DMA_CURHOST_TRANS_DES_HTD_Msk (0xffffffffUL << ETHERNET_DMA_CURHOST_TRANS_DES_HTD_Pos)/*!< ETHERNET DMA_CURHOST_TRANS_DES: HTD Mask */

/* ------------------------  ETHERNET_DMA_CURHOST_REC_DES  ------------------------ */
#define ETHERNET_DMA_CURHOST_REC_DES_HRD_Pos  0                                                       /*!< ETHERNET DMA_CURHOST_REC_DES: HRD Position */
#define ETHERNET_DMA_CURHOST_REC_DES_HRD_Msk  (0xffffffffUL << ETHERNET_DMA_CURHOST_REC_DES_HRD_Pos)  /*!< ETHERNET DMA_CURHOST_REC_DES: HRD Mask  */

/* -----------------------  ETHERNET_DMA_CURHOST_TRANS_BUF  ----------------------- */
#define ETHERNET_DMA_CURHOST_TRANS_BUF_HTB_Pos 0                                                      /*!< ETHERNET DMA_CURHOST_TRANS_BUF: HTB Position */
#define ETHERNET_DMA_CURHOST_TRANS_BUF_HTB_Msk (0xffffffffUL << ETHERNET_DMA_CURHOST_TRANS_BUF_HTB_Pos)/*!< ETHERNET DMA_CURHOST_TRANS_BUF: HTB Mask */

/* ------------------------  ETHERNET_DMA_CURHOST_REC_BUF  ------------------------ */
#define ETHERNET_DMA_CURHOST_REC_BUF_HRB_Pos  0                                                       /*!< ETHERNET DMA_CURHOST_REC_BUF: HRB Position */
#define ETHERNET_DMA_CURHOST_REC_BUF_HRB_Msk  (0xffffffffUL << ETHERNET_DMA_CURHOST_REC_BUF_HRB_Pos)  /*!< ETHERNET DMA_CURHOST_REC_BUF: HRB Mask  */


/* ================================================================================ */
/* ================         struct 'ATIMER' Position & Mask        ================ */
/* ================================================================================ */


/* -----------------------------  ATIMER_DOWNCOUNTER  ----------------------------- */
#define ATIMER_DOWNCOUNTER_CVAL_Pos           0                                                       /*!< ATIMER DOWNCOUNTER: CVAL Position       */
#define ATIMER_DOWNCOUNTER_CVAL_Msk           (0x0000ffffUL << ATIMER_DOWNCOUNTER_CVAL_Pos)           /*!< ATIMER DOWNCOUNTER: CVAL Mask           */

/* --------------------------------  ATIMER_PRESET  ------------------------------- */
#define ATIMER_PRESET_PRESETVAL_Pos           0                                                       /*!< ATIMER PRESET: PRESETVAL Position       */
#define ATIMER_PRESET_PRESETVAL_Msk           (0x0000ffffUL << ATIMER_PRESET_PRESETVAL_Pos)           /*!< ATIMER PRESET: PRESETVAL Mask           */

/* --------------------------------  ATIMER_CLR_EN  ------------------------------- */
#define ATIMER_CLR_EN_CLR_EN_Pos              0                                                       /*!< ATIMER CLR_EN: CLR_EN Position          */
#define ATIMER_CLR_EN_CLR_EN_Msk              (0x01UL << ATIMER_CLR_EN_CLR_EN_Pos)                    /*!< ATIMER CLR_EN: CLR_EN Mask              */

/* --------------------------------  ATIMER_SET_EN  ------------------------------- */
#define ATIMER_SET_EN_SET_EN_Pos              0                                                       /*!< ATIMER SET_EN: SET_EN Position          */
#define ATIMER_SET_EN_SET_EN_Msk              (0x01UL << ATIMER_SET_EN_SET_EN_Pos)                    /*!< ATIMER SET_EN: SET_EN Mask              */

/* --------------------------------  ATIMER_STATUS  ------------------------------- */
#define ATIMER_STATUS_STAT_Pos                0                                                       /*!< ATIMER STATUS: STAT Position            */
#define ATIMER_STATUS_STAT_Msk                (0x01UL << ATIMER_STATUS_STAT_Pos)                      /*!< ATIMER STATUS: STAT Mask                */

/* --------------------------------  ATIMER_ENABLE  ------------------------------- */
#define ATIMER_ENABLE_EN_Pos                  0                                                       /*!< ATIMER ENABLE: EN Position              */
#define ATIMER_ENABLE_EN_Msk                  (0x01UL << ATIMER_ENABLE_EN_Pos)                        /*!< ATIMER ENABLE: EN Mask                  */

/* -------------------------------  ATIMER_CLR_STAT  ------------------------------ */
#define ATIMER_CLR_STAT_CSTAT_Pos             0                                                       /*!< ATIMER CLR_STAT: CSTAT Position         */
#define ATIMER_CLR_STAT_CSTAT_Msk             (0x01UL << ATIMER_CLR_STAT_CSTAT_Pos)                   /*!< ATIMER CLR_STAT: CSTAT Mask             */

/* -------------------------------  ATIMER_SET_STAT  ------------------------------ */
#define ATIMER_SET_STAT_SSTAT_Pos             0                                                       /*!< ATIMER SET_STAT: SSTAT Position         */
#define ATIMER_SET_STAT_SSTAT_Msk             (0x01UL << ATIMER_SET_STAT_SSTAT_Pos)                   /*!< ATIMER SET_STAT: SSTAT Mask             */


/* ================================================================================ */
/* ================        struct 'REGFILE' Position & Mask        ================ */
/* ================================================================================ */


/* -------------------------------  REGFILE_REGFILE  ------------------------------ */
#define REGFILE_REGFILE_REGVAL_Pos            0                                                       /*!< REGFILE REGFILE: REGVAL Position        */
#define REGFILE_REGFILE_REGVAL_Msk            (0xffffffffUL << REGFILE_REGFILE_REGVAL_Pos)            /*!< REGFILE REGFILE: REGVAL Mask            */


/* ================================================================================ */
/* ================          struct 'PMC' Position & Mask          ================ */
/* ================================================================================ */


/* ----------------------------  PMC_PD0_SLEEP0_HW_ENA  --------------------------- */
#define PMC_PD0_SLEEP0_HW_ENA_ENA_EVENT0_Pos  0                                                       /*!< PMC PD0_SLEEP0_HW_ENA: ENA_EVENT0 Position */
#define PMC_PD0_SLEEP0_HW_ENA_ENA_EVENT0_Msk  (0x01UL << PMC_PD0_SLEEP0_HW_ENA_ENA_EVENT0_Pos)        /*!< PMC PD0_SLEEP0_HW_ENA: ENA_EVENT0 Mask  */

