MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -----------------------------  PMC_PD0_SLEEP0_MODE  ---------------------------- */
#define PMC_PD0_SLEEP0_MODE_PWR_STATE_Pos     0                                                       /*!< PMC PD0_SLEEP0_MODE: PWR_STATE Position */
#define PMC_PD0_SLEEP0_MODE_PWR_STATE_Msk     (0xffffffffUL << PMC_PD0_SLEEP0_MODE_PWR_STATE_Pos)     /*!< PMC PD0_SLEEP0_MODE: PWR_STATE Mask     */


/* ================================================================================ */
/* ================          struct 'CREG' Position & Mask         ================ */
/* ================================================================================ */


/* ---------------------------------  CREG_CREG0  --------------------------------- */
#define CREG_CREG0_EN1KHZ_Pos                 0                                                       /*!< CREG CREG0: EN1KHZ Position             */
#define CREG_CREG0_EN1KHZ_Msk                 (0x01UL << CREG_CREG0_EN1KHZ_Pos)                       /*!< CREG CREG0: EN1KHZ Mask                 */
#define CREG_CREG0_EN32KHZ_Pos                1                                                       /*!< CREG CREG0: EN32KHZ Position            */
#define CREG_CREG0_EN32KHZ_Msk                (0x01UL << CREG_CREG0_EN32KHZ_Pos)                      /*!< CREG CREG0: EN32KHZ Mask                */
#define CREG_CREG0_RESET32KHZ_Pos             2                                                       /*!< CREG CREG0: RESET32KHZ Position         */
#define CREG_CREG0_RESET32KHZ_Msk             (0x01UL << CREG_CREG0_RESET32KHZ_Pos)                   /*!< CREG CREG0: RESET32KHZ Mask             */
#define CREG_CREG0_PD32KHZ_Pos                3                                                       /*!< CREG CREG0: PD32KHZ Position            */
#define CREG_CREG0_PD32KHZ_Msk                (0x01UL << CREG_CREG0_PD32KHZ_Pos)                      /*!< CREG CREG0: PD32KHZ Mask                */
#define CREG_CREG0_USB0PHY_Pos                5                                                       /*!< CREG CREG0: USB0PHY Position            */
#define CREG_CREG0_USB0PHY_Msk                (0x01UL << CREG_CREG0_USB0PHY_Pos)                      /*!< CREG CREG0: USB0PHY Mask                */
#define CREG_CREG0_ALARMCTRL_Pos              6                                                       /*!< CREG CREG0: ALARMCTRL Position          */
#define CREG_CREG0_ALARMCTRL_Msk              (0x03UL << CREG_CREG0_ALARMCTRL_Pos)                    /*!< CREG CREG0: ALARMCTRL Mask              */
#define CREG_CREG0_BODLVL1_Pos                8                                                       /*!< CREG CREG0: BODLVL1 Position            */
#define CREG_CREG0_BODLVL1_Msk                (0x03UL << CREG_CREG0_BODLVL1_Pos)                      /*!< CREG CREG0: BODLVL1 Mask                */
#define CREG_CREG0_BODLVL2_Pos                10                                                      /*!< CREG CREG0: BODLVL2 Position            */
#define CREG_CREG0_BODLVL2_Msk                (0x03UL << CREG_CREG0_BODLVL2_Pos)                      /*!< CREG CREG0: BODLVL2 Mask                */
#define CREG_CREG0_SAMPLECTRL_Pos             12                                                      /*!< CREG CREG0: SAMPLECTRL Position         */
#define CREG_CREG0_SAMPLECTRL_Msk             (0x03UL << CREG_CREG0_SAMPLECTRL_Pos)                   /*!< CREG CREG0: SAMPLECTRL Mask             */
#define CREG_CREG0_WAKEUP0CTRL_Pos            14                                                      /*!< CREG CREG0: WAKEUP0CTRL Position        */
#define CREG_CREG0_WAKEUP0CTRL_Msk            (0x03UL << CREG_CREG0_WAKEUP0CTRL_Pos)                  /*!< CREG CREG0: WAKEUP0CTRL Mask            */
#define CREG_CREG0_WAKEUP1CTRL_Pos            16                                                      /*!< CREG CREG0: WAKEUP1CTRL Position        */
#define CREG_CREG0_WAKEUP1CTRL_Msk            (0x03UL << CREG_CREG0_WAKEUP1CTRL_Pos)                  /*!< CREG CREG0: WAKEUP1CTRL Mask            */

/* --------------------------------  CREG_M4MEMMAP  ------------------------------- */
#define CREG_M4MEMMAP_M4MAP_Pos               12                                                      /*!< CREG M4MEMMAP: M4MAP Position           */
#define CREG_M4MEMMAP_M4MAP_Msk               (0x000fffffUL << CREG_M4MEMMAP_M4MAP_Pos)               /*!< CREG M4MEMMAP: M4MAP Mask               */

/* ---------------------------------  CREG_CREG5  --------------------------------- */
#define CREG_CREG5_M0SUBTAPSEL_Pos            10                                                      /*!< CREG CREG5: M0SUBTAPSEL Position        */
#define CREG_CREG5_M0SUBTAPSEL_Msk            (0x01UL << CREG_CREG5_M0SUBTAPSEL_Pos)                  /*!< CREG CREG5: M0SUBTAPSEL Mask            */
#define CREG_CREG5_M4TAPSEL_Pos               11                                                      /*!< CREG CREG5: M4TAPSEL Position           */
#define CREG_CREG5_M4TAPSEL_Msk               (0x01UL << CREG_CREG5_M4TAPSEL_Pos)                     /*!< CREG CREG5: M4TAPSEL Mask               */
#define CREG_CREG5_M0APPTAPSEL_Pos            12                                                      /*!< CREG CREG5: M0APPTAPSEL Position        */
#define CREG_CREG5_M0APPTAPSEL_Msk            (0x01UL << CREG_CREG5_M0APPTAPSEL_Pos)                  /*!< CREG CREG5: M0APPTAPSEL Mask            */

/* ---------------------------------  CREG_DMAMUX  -------------------------------- */
#define CREG_DMAMUX_DMAMUXPER0_Pos            0                                                       /*!< CREG DMAMUX: DMAMUXPER0 Position        */
#define CREG_DMAMUX_DMAMUXPER0_Msk            (0x03UL << CREG_DMAMUX_DMAMUXPER0_Pos)                  /*!< CREG DMAMUX: DMAMUXPER0 Mask            */
#define CREG_DMAMUX_DMAMUXPER1_Pos            2                                                       /*!< CREG DMAMUX: DMAMUXPER1 Position        */
#define CREG_DMAMUX_DMAMUXPER1_Msk            (0x03UL << CREG_DMAMUX_DMAMUXPER1_Pos)                  /*!< CREG DMAMUX: DMAMUXPER1 Mask            */
#define CREG_DMAMUX_DMAMUXPER2_Pos            4                                                       /*!< CREG DMAMUX: DMAMUXPER2 Position        */
#define CREG_DMAMUX_DMAMUXPER2_Msk            (0x03UL << CREG_DMAMUX_DMAMUXPER2_Pos)                  /*!< CREG DMAMUX: DMAMUXPER2 Mask            */
#define CREG_DMAMUX_DMAMUXPER3_Pos            6                                                       /*!< CREG DMAMUX: DMAMUXPER3 Position        */
#define CREG_DMAMUX_DMAMUXPER3_Msk            (0x03UL << CREG_DMAMUX_DMAMUXPER3_Pos)                  /*!< CREG DMAMUX: DMAMUXPER3 Mask            */
#define CREG_DMAMUX_DMAMUXPER4_Pos            8                                                       /*!< CREG DMAMUX: DMAMUXPER4 Position        */
#define CREG_DMAMUX_DMAMUXPER4_Msk            (0x03UL << CREG_DMAMUX_DMAMUXPER4_Pos)                  /*!< CREG DMAMUX: DMAMUXPER4 Mask            */
#define CREG_DMAMUX_DMAMUXPER5_Pos            10                                                      /*!< CREG DMAMUX: DMAMUXPER5 Position        */
#define CREG_DMAMUX_DMAMUXPER5_Msk            (0x03UL << CREG_DMAMUX_DMAMUXPER5_Pos)                  /*!< CREG DMAMUX: DMAMUXPER5 Mask            */
#define CREG_DMAMUX_DMAMUXPER6_Pos            12                                                      /*!< CREG DMAMUX: DMAMUXPER6 Position        */
#define CREG_DMAMUX_DMAMUXPER6_Msk            (0x03UL << CREG_DMAMUX_DMAMUXPER6_Pos)                  /*!< CREG DMAMUX: DMAMUXPER6 Mask            */
#define CREG_DMAMUX_DMAMUXPER7_Pos            14                                                      /*!< CREG DMAMUX: DMAMUXPER7 Position        */
#define CREG_DMAMUX_DMAMUXPER7_Msk            (0x03UL << CREG_DMAMUX_DMAMUXPER7_Pos)                  /*!< CREG DMAMUX: DMAMUXPER7 Mask            */
#define CREG_DMAMUX_DMAMUXPER8_Pos            16                                                      /*!< CREG DMAMUX: DMAMUXPER8 Position        */
#define CREG_DMAMUX_DMAMUXPER8_Msk            (0x03UL << CREG_DMAMUX_DMAMUXPER8_Pos)                  /*!< CREG DMAMUX: DMAMUXPER8 Mask            */
#define CREG_DMAMUX_DMAMUXPER9_Pos            18                                                      /*!< CREG DMAMUX: DMAMUXPER9 Position        */
#define CREG_DMAMUX_DMAMUXPER9_Msk            (0x03UL << CREG_DMAMUX_DMAMUXPER9_Pos)                  /*!< CREG DMAMUX: DMAMUXPER9 Mask            */
#define CREG_DMAMUX_DMAMUXPER10_Pos           20                                                      /*!< CREG DMAMUX: DMAMUXPER10 Position       */
#define CREG_DMAMUX_DMAMUXPER10_Msk           (0x03UL << CREG_DMAMUX_DMAMUXPER10_Pos)                 /*!< CREG DMAMUX: DMAMUXPER10 Mask           */
#define CREG_DMAMUX_DMAMUXPER11_Pos           22                                                      /*!< CREG DMAMUX: DMAMUXPER11 Position       */
#define CREG_DMAMUX_DMAMUXPER11_Msk           (0x03UL << CREG_DMAMUX_DMAMUXPER11_Pos)                 /*!< CREG DMAMUX: DMAMUXPER11 Mask           */
#define CREG_DMAMUX_DMAMUXPER12_Pos           24                                                      /*!< CREG DMAMUX: DMAMUXPER12 Position       */
#define CREG_DMAMUX_DMAMUXPER12_Msk           (0x03UL << CREG_DMAMUX_DMAMUXPER12_Pos)                 /*!< CREG DMAMUX: DMAMUXPER12 Mask           */
#define CREG_DMAMUX_DMAMUXPER13_Pos           26                                                      /*!< CREG DMAMUX: DMAMUXPER13 Position       */
#define CREG_DMAMUX_DMAMUXPER13_Msk           (0x03UL << CREG_DMAMUX_DMAMUXPER13_Pos)                 /*!< CREG DMAMUX: DMAMUXPER13 Mask           */
#define CREG_DMAMUX_DMAMUXPER14_Pos           28                                                      /*!< CREG DMAMUX: DMAMUXPER14 Position       */
#define CREG_DMAMUX_DMAMUXPER14_Msk           (0x03UL << CREG_DMAMUX_DMAMUXPER14_Pos)                 /*!< CREG DMAMUX: DMAMUXPER14 Mask           */
#define CREG_DMAMUX_DMAMUXPER15_Pos           30                                                      /*!< CREG DMAMUX: DMAMUXPER15 Position       */
#define CREG_DMAMUX_DMAMUXPER15_Msk           (0x03UL << CREG_DMAMUX_DMAMUXPER15_Pos)                 /*!< CREG DMAMUX: DMAMUXPER15 Mask           */

