MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ------------------------------  EVENTROUTER_HILO  ------------------------------ */
#define EVENTROUTER_HILO_WAKEUP0_L_Pos        0                                                       /*!< EVENTROUTER HILO: WAKEUP0_L Position    */
#define EVENTROUTER_HILO_WAKEUP0_L_Msk        (0x01UL << EVENTROUTER_HILO_WAKEUP0_L_Pos)              /*!< EVENTROUTER HILO: WAKEUP0_L Mask        */
#define EVENTROUTER_HILO_WAKEUP1_L_Pos        1                                                       /*!< EVENTROUTER HILO: WAKEUP1_L Position    */
#define EVENTROUTER_HILO_WAKEUP1_L_Msk        (0x01UL << EVENTROUTER_HILO_WAKEUP1_L_Pos)              /*!< EVENTROUTER HILO: WAKEUP1_L Mask        */
#define EVENTROUTER_HILO_WAKEUP2_L_Pos        2                                                       /*!< EVENTROUTER HILO: WAKEUP2_L Position    */
#define EVENTROUTER_HILO_WAKEUP2_L_Msk        (0x01UL << EVENTROUTER_HILO_WAKEUP2_L_Pos)              /*!< EVENTROUTER HILO: WAKEUP2_L Mask        */
#define EVENTROUTER_HILO_WAKEUP3_L_Pos        3                                                       /*!< EVENTROUTER HILO: WAKEUP3_L Position    */
#define EVENTROUTER_HILO_WAKEUP3_L_Msk        (0x01UL << EVENTROUTER_HILO_WAKEUP3_L_Pos)              /*!< EVENTROUTER HILO: WAKEUP3_L Mask        */
#define EVENTROUTER_HILO_ATIMER_L_Pos         4                                                       /*!< EVENTROUTER HILO: ATIMER_L Position     */
#define EVENTROUTER_HILO_ATIMER_L_Msk         (0x01UL << EVENTROUTER_HILO_ATIMER_L_Pos)               /*!< EVENTROUTER HILO: ATIMER_L Mask         */
#define EVENTROUTER_HILO_RTC_L_Pos            5                                                       /*!< EVENTROUTER HILO: RTC_L Position        */
#define EVENTROUTER_HILO_RTC_L_Msk            (0x01UL << EVENTROUTER_HILO_RTC_L_Pos)                  /*!< EVENTROUTER HILO: RTC_L Mask            */
#define EVENTROUTER_HILO_BOD_L_Pos            6                                                       /*!< EVENTROUTER HILO: BOD_L Position        */
#define EVENTROUTER_HILO_BOD_L_Msk            (0x01UL << EVENTROUTER_HILO_BOD_L_Pos)                  /*!< EVENTROUTER HILO: BOD_L Mask            */
#define EVENTROUTER_HILO_WWDT_L_Pos           7                                                       /*!< EVENTROUTER HILO: WWDT_L Position       */
#define EVENTROUTER_HILO_WWDT_L_Msk           (0x01UL << EVENTROUTER_HILO_WWDT_L_Pos)                 /*!< EVENTROUTER HILO: WWDT_L Mask           */
#define EVENTROUTER_HILO_ETH_L_Pos            8                                                       /*!< EVENTROUTER HILO: ETH_L Position        */
#define EVENTROUTER_HILO_ETH_L_Msk            (0x01UL << EVENTROUTER_HILO_ETH_L_Pos)                  /*!< EVENTROUTER HILO: ETH_L Mask            */
#define EVENTROUTER_HILO_USB0_L_Pos           9                                                       /*!< EVENTROUTER HILO: USB0_L Position       */
#define EVENTROUTER_HILO_USB0_L_Msk           (0x01UL << EVENTROUTER_HILO_USB0_L_Pos)                 /*!< EVENTROUTER HILO: USB0_L Mask           */
#define EVENTROUTER_HILO_USB1_L_Pos           10                                                      /*!< EVENTROUTER HILO: USB1_L Position       */
#define EVENTROUTER_HILO_USB1_L_Msk           (0x01UL << EVENTROUTER_HILO_USB1_L_Pos)                 /*!< EVENTROUTER HILO: USB1_L Mask           */
#define EVENTROUTER_HILO_SDMMC_L_Pos          11                                                      /*!< EVENTROUTER HILO: SDMMC_L Position      */
#define EVENTROUTER_HILO_SDMMC_L_Msk          (0x01UL << EVENTROUTER_HILO_SDMMC_L_Pos)                /*!< EVENTROUTER HILO: SDMMC_L Mask          */
#define EVENTROUTER_HILO_CAN_L_Pos            12                                                      /*!< EVENTROUTER HILO: CAN_L Position        */
#define EVENTROUTER_HILO_CAN_L_Msk            (0x01UL << EVENTROUTER_HILO_CAN_L_Pos)                  /*!< EVENTROUTER HILO: CAN_L Mask            */
#define EVENTROUTER_HILO_TIM2_L_Pos           13                                                      /*!< EVENTROUTER HILO: TIM2_L Position       */
#define EVENTROUTER_HILO_TIM2_L_Msk           (0x01UL << EVENTROUTER_HILO_TIM2_L_Pos)                 /*!< EVENTROUTER HILO: TIM2_L Mask           */
#define EVENTROUTER_HILO_TIM6_L_Pos           14                                                      /*!< EVENTROUTER HILO: TIM6_L Position       */
#define EVENTROUTER_HILO_TIM6_L_Msk           (0x01UL << EVENTROUTER_HILO_TIM6_L_Pos)                 /*!< EVENTROUTER HILO: TIM6_L Mask           */
#define EVENTROUTER_HILO_QEI_L_Pos            15                                                      /*!< EVENTROUTER HILO: QEI_L Position        */
#define EVENTROUTER_HILO_QEI_L_Msk            (0x01UL << EVENTROUTER_HILO_QEI_L_Pos)                  /*!< EVENTROUTER HILO: QEI_L Mask            */
#define EVENTROUTER_HILO_TIM14_L_Pos          16                                                      /*!< EVENTROUTER HILO: TIM14_L Position      */
#define EVENTROUTER_HILO_TIM14_L_Msk          (0x01UL << EVENTROUTER_HILO_TIM14_L_Pos)                /*!< EVENTROUTER HILO: TIM14_L Mask          */
#define EVENTROUTER_HILO_RESET_L_Pos          19                                                      /*!< EVENTROUTER HILO: RESET_L Position      */
#define EVENTROUTER_HILO_RESET_L_Msk          (0x01UL << EVENTROUTER_HILO_RESET_L_Pos)                /*!< EVENTROUTER HILO: RESET_L Mask          */
#define EVENTROUTER_HILO_BODRESET_L_Pos       20                                                      /*!< EVENTROUTER HILO: BODRESET_L Position   */
#define EVENTROUTER_HILO_BODRESET_L_Msk       (0x01UL << EVENTROUTER_HILO_BODRESET_L_Pos)             /*!< EVENTROUTER HILO: BODRESET_L Mask       */
#define EVENTROUTER_HILO_DPDRESET_L_Pos       21                                                      /*!< EVENTROUTER HILO: DPDRESET_L Position   */
#define EVENTROUTER_HILO_DPDRESET_L_Msk       (0x01UL << EVENTROUTER_HILO_DPDRESET_L_Pos)             /*!< EVENTROUTER HILO: DPDRESET_L Mask       */

/* ------------------------------  EVENTROUTER_EDGE  ------------------------------ */
#define EVENTROUTER_EDGE_WAKEUP0_E_Pos        0                                                       /*!< EVENTROUTER EDGE: WAKEUP0_E Position    */
#define EVENTROUTER_EDGE_WAKEUP0_E_Msk        (0x01UL << EVENTROUTER_EDGE_WAKEUP0_E_Pos)              /*!< EVENTROUTER EDGE: WAKEUP0_E Mask        */
#define EVENTROUTER_EDGE_WAKEUP1_E_Pos        1                                                       /*!< EVENTROUTER EDGE: WAKEUP1_E Position    */
#define EVENTROUTER_EDGE_WAKEUP1_E_Msk        (0x01UL << EVENTROUTER_EDGE_WAKEUP1_E_Pos)              /*!< EVENTROUTER EDGE: WAKEUP1_E Mask        */
#define EVENTROUTER_EDGE_WAKEUP2_E_Pos        2                                                       /*!< EVENTROUTER EDGE: WAKEUP2_E Position    */
#define EVENTROUTER_EDGE_WAKEUP2_E_Msk        (0x01UL << EVENTROUTER_EDGE_WAKEUP2_E_Pos)              /*!< EVENTROUTER EDGE: WAKEUP2_E Mask        */
#define EVENTROUTER_EDGE_WAKEUP3_E_Pos        3                                                       /*!< EVENTROUTER EDGE: WAKEUP3_E Position    */
#define EVENTROUTER_EDGE_WAKEUP3_E_Msk        (0x01UL << EVENTROUTER_EDGE_WAKEUP3_E_Pos)              /*!< EVENTROUTER EDGE: WAKEUP3_E Mask        */
#define EVENTROUTER_EDGE_ATIMER_E_Pos         4                                                       /*!< EVENTROUTER EDGE: ATIMER_E Position     */
#define EVENTROUTER_EDGE_ATIMER_E_Msk         (0x01UL << EVENTROUTER_EDGE_ATIMER_E_Pos)               /*!< EVENTROUTER EDGE: ATIMER_E Mask         */
#define EVENTROUTER_EDGE_RTC_E_Pos            5                                                       /*!< EVENTROUTER EDGE: RTC_E Position        */
#define EVENTROUTER_EDGE_RTC_E_Msk            (0x01UL << EVENTROUTER_EDGE_RTC_E_Pos)                  /*!< EVENTROUTER EDGE: RTC_E Mask            */
#define EVENTROUTER_EDGE_BOD_E_Pos            6                                                       /*!< EVENTROUTER EDGE: BOD_E Position        */
#define EVENTROUTER_EDGE_BOD_E_Msk            (0x01UL << EVENTROUTER_EDGE_BOD_E_Pos)                  /*!< EVENTROUTER EDGE: BOD_E Mask            */
#define EVENTROUTER_EDGE_WWDT_E_Pos           7                                                       /*!< EVENTROUTER EDGE: WWDT_E Position       */
#define EVENTROUTER_EDGE_WWDT_E_Msk           (0x01UL << EVENTROUTER_EDGE_WWDT_E_Pos)                 /*!< EVENTROUTER EDGE: WWDT_E Mask           */
#define EVENTROUTER_EDGE_ETH_E_Pos            8                                                       /*!< EVENTROUTER EDGE: ETH_E Position        */
#define EVENTROUTER_EDGE_ETH_E_Msk            (0x01UL << EVENTROUTER_EDGE_ETH_E_Pos)                  /*!< EVENTROUTER EDGE: ETH_E Mask            */
#define EVENTROUTER_EDGE_USB0_E_Pos           9                                                       /*!< EVENTROUTER EDGE: USB0_E Position       */
#define EVENTROUTER_EDGE_USB0_E_Msk           (0x01UL << EVENTROUTER_EDGE_USB0_E_Pos)                 /*!< EVENTROUTER EDGE: USB0_E Mask           */
#define EVENTROUTER_EDGE_USB1_E_Pos           10                                                      /*!< EVENTROUTER EDGE: USB1_E Position       */
#define EVENTROUTER_EDGE_USB1_E_Msk           (0x01UL << EVENTROUTER_EDGE_USB1_E_Pos)                 /*!< EVENTROUTER EDGE: USB1_E Mask           */
#define EVENTROUTER_EDGE_SDMMC_E_Pos          11                                                      /*!< EVENTROUTER EDGE: SDMMC_E Position      */
#define EVENTROUTER_EDGE_SDMMC_E_Msk          (0x01UL << EVENTROUTER_EDGE_SDMMC_E_Pos)                /*!< EVENTROUTER EDGE: SDMMC_E Mask          */
#define EVENTROUTER_EDGE_CAN_E_Pos            12                                                      /*!< EVENTROUTER EDGE: CAN_E Position        */
#define EVENTROUTER_EDGE_CAN_E_Msk            (0x01UL << EVENTROUTER_EDGE_CAN_E_Pos)                  /*!< EVENTROUTER EDGE: CAN_E Mask            */
#define EVENTROUTER_EDGE_TIM2_E_Pos           13                                                      /*!< EVENTROUTER EDGE: TIM2_E Position       */
#define EVENTROUTER_EDGE_TIM2_E_Msk           (0x01UL << EVENTROUTER_EDGE_TIM2_E_Pos)                 /*!< EVENTROUTER EDGE: TIM2_E Mask           */
#define EVENTROUTER_EDGE_TIM6_E_Pos           14                                                      /*!< EVENTROUTER EDGE: TIM6_E Position       */
#define EVENTROUTER_EDGE_TIM6_E_Msk           (0x01UL << EVENTROUTER_EDGE_TIM6_E_Pos)                 /*!< EVENTROUTER EDGE: TIM6_E Mask           */
#define EVENTROUTER_EDGE_QEI_E_Pos            15                                                      /*!< EVENTROUTER EDGE: QEI_E Position        */
#define EVENTROUTER_EDGE_QEI_E_Msk            (0x01UL << EVENTROUTER_EDGE_QEI_E_Pos)                  /*!< EVENTROUTER EDGE: QEI_E Mask            */
#define EVENTROUTER_EDGE_TIM14_E_Pos          16                                                      /*!< EVENTROUTER EDGE: TIM14_E Position      */
#define EVENTROUTER_EDGE_TIM14_E_Msk          (0x01UL << EVENTROUTER_EDGE_TIM14_E_Pos)                /*!< EVENTROUTER EDGE: TIM14_E Mask          */
#define EVENTROUTER_EDGE_RESET_E_Pos          19                                                      /*!< EVENTROUTER EDGE: RESET_E Position      */
#define EVENTROUTER_EDGE_RESET_E_Msk          (0x01UL << EVENTROUTER_EDGE_RESET_E_Pos)                /*!< EVENTROUTER EDGE: RESET_E Mask          */
#define EVENTROUTER_EDGE_BODRESET_E_Pos       20                                                      /*!< EVENTROUTER EDGE: BODRESET_E Position   */
#define EVENTROUTER_EDGE_BODRESET_E_Msk       (0x01UL << EVENTROUTER_EDGE_BODRESET_E_Pos)             /*!< EVENTROUTER EDGE: BODRESET_E Mask       */
#define EVENTROUTER_EDGE_DPDRESET_E_Pos       21                                                      /*!< EVENTROUTER EDGE: DPDRESET_E Position   */
#define EVENTROUTER_EDGE_DPDRESET_E_Msk       (0x01UL << EVENTROUTER_EDGE_DPDRESET_E_Pos)             /*!< EVENTROUTER EDGE: DPDRESET_E Mask       */

