MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -----------------------------  EVENTROUTER_ENABLE  ----------------------------- */
#define EVENTROUTER_ENABLE_WAKEUP0_EN_Pos     0                                                       /*!< EVENTROUTER ENABLE: WAKEUP0_EN Position */
#define EVENTROUTER_ENABLE_WAKEUP0_EN_Msk     (0x01UL << EVENTROUTER_ENABLE_WAKEUP0_EN_Pos)           /*!< EVENTROUTER ENABLE: WAKEUP0_EN Mask     */
#define EVENTROUTER_ENABLE_WAKEUP1_EN_Pos     1                                                       /*!< EVENTROUTER ENABLE: WAKEUP1_EN Position */
#define EVENTROUTER_ENABLE_WAKEUP1_EN_Msk     (0x01UL << EVENTROUTER_ENABLE_WAKEUP1_EN_Pos)           /*!< EVENTROUTER ENABLE: WAKEUP1_EN Mask     */
#define EVENTROUTER_ENABLE_WAKEUP2_EN_Pos     2                                                       /*!< EVENTROUTER ENABLE: WAKEUP2_EN Position */
#define EVENTROUTER_ENABLE_WAKEUP2_EN_Msk     (0x01UL << EVENTROUTER_ENABLE_WAKEUP2_EN_Pos)           /*!< EVENTROUTER ENABLE: WAKEUP2_EN Mask     */
#define EVENTROUTER_ENABLE_WAKEUP3_EN_Pos     3                                                       /*!< EVENTROUTER ENABLE: WAKEUP3_EN Position */
#define EVENTROUTER_ENABLE_WAKEUP3_EN_Msk     (0x01UL << EVENTROUTER_ENABLE_WAKEUP3_EN_Pos)           /*!< EVENTROUTER ENABLE: WAKEUP3_EN Mask     */
#define EVENTROUTER_ENABLE_ATIMER_EN_Pos      4                                                       /*!< EVENTROUTER ENABLE: ATIMER_EN Position  */
#define EVENTROUTER_ENABLE_ATIMER_EN_Msk      (0x01UL << EVENTROUTER_ENABLE_ATIMER_EN_Pos)            /*!< EVENTROUTER ENABLE: ATIMER_EN Mask      */
#define EVENTROUTER_ENABLE_RTC_EN_Pos         5                                                       /*!< EVENTROUTER ENABLE: RTC_EN Position     */
#define EVENTROUTER_ENABLE_RTC_EN_Msk         (0x01UL << EVENTROUTER_ENABLE_RTC_EN_Pos)               /*!< EVENTROUTER ENABLE: RTC_EN Mask         */
#define EVENTROUTER_ENABLE_BOD_EN_Pos         6                                                       /*!< EVENTROUTER ENABLE: BOD_EN Position     */
#define EVENTROUTER_ENABLE_BOD_EN_Msk         (0x01UL << EVENTROUTER_ENABLE_BOD_EN_Pos)               /*!< EVENTROUTER ENABLE: BOD_EN Mask         */
#define EVENTROUTER_ENABLE_WWDT_EN_Pos        7                                                       /*!< EVENTROUTER ENABLE: WWDT_EN Position    */
#define EVENTROUTER_ENABLE_WWDT_EN_Msk        (0x01UL << EVENTROUTER_ENABLE_WWDT_EN_Pos)              /*!< EVENTROUTER ENABLE: WWDT_EN Mask        */
#define EVENTROUTER_ENABLE_ETH_EN_Pos         8                                                       /*!< EVENTROUTER ENABLE: ETH_EN Position     */
#define EVENTROUTER_ENABLE_ETH_EN_Msk         (0x01UL << EVENTROUTER_ENABLE_ETH_EN_Pos)               /*!< EVENTROUTER ENABLE: ETH_EN Mask         */
#define EVENTROUTER_ENABLE_USB0_EN_Pos        9                                                       /*!< EVENTROUTER ENABLE: USB0_EN Position    */
#define EVENTROUTER_ENABLE_USB0_EN_Msk        (0x01UL << EVENTROUTER_ENABLE_USB0_EN_Pos)              /*!< EVENTROUTER ENABLE: USB0_EN Mask        */
#define EVENTROUTER_ENABLE_USB1_EN_Pos        10                                                      /*!< EVENTROUTER ENABLE: USB1_EN Position    */
#define EVENTROUTER_ENABLE_USB1_EN_Msk        (0x01UL << EVENTROUTER_ENABLE_USB1_EN_Pos)              /*!< EVENTROUTER ENABLE: USB1_EN Mask        */
#define EVENTROUTER_ENABLE_SDMMC_EN_Pos       11                                                      /*!< EVENTROUTER ENABLE: SDMMC_EN Position   */
#define EVENTROUTER_ENABLE_SDMMC_EN_Msk       (0x01UL << EVENTROUTER_ENABLE_SDMMC_EN_Pos)             /*!< EVENTROUTER ENABLE: SDMMC_EN Mask       */
#define EVENTROUTER_ENABLE_CAN_EN_Pos         12                                                      /*!< EVENTROUTER ENABLE: CAN_EN Position     */
#define EVENTROUTER_ENABLE_CAN_EN_Msk         (0x01UL << EVENTROUTER_ENABLE_CAN_EN_Pos)               /*!< EVENTROUTER ENABLE: CAN_EN Mask         */
#define EVENTROUTER_ENABLE_TIM2_EN_Pos        13                                                      /*!< EVENTROUTER ENABLE: TIM2_EN Position    */
#define EVENTROUTER_ENABLE_TIM2_EN_Msk        (0x01UL << EVENTROUTER_ENABLE_TIM2_EN_Pos)              /*!< EVENTROUTER ENABLE: TIM2_EN Mask        */
#define EVENTROUTER_ENABLE_TIM6_EN_Pos        14                                                      /*!< EVENTROUTER ENABLE: TIM6_EN Position    */
#define EVENTROUTER_ENABLE_TIM6_EN_Msk        (0x01UL << EVENTROUTER_ENABLE_TIM6_EN_Pos)              /*!< EVENTROUTER ENABLE: TIM6_EN Mask        */
#define EVENTROUTER_ENABLE_QEI_EN_Pos         15                                                      /*!< EVENTROUTER ENABLE: QEI_EN Position     */
#define EVENTROUTER_ENABLE_QEI_EN_Msk         (0x01UL << EVENTROUTER_ENABLE_QEI_EN_Pos)               /*!< EVENTROUTER ENABLE: QEI_EN Mask         */
#define EVENTROUTER_ENABLE_TIM14_EN_Pos       16                                                      /*!< EVENTROUTER ENABLE: TIM14_EN Position   */
#define EVENTROUTER_ENABLE_TIM14_EN_Msk       (0x01UL << EVENTROUTER_ENABLE_TIM14_EN_Pos)             /*!< EVENTROUTER ENABLE: TIM14_EN Mask       */
#define EVENTROUTER_ENABLE_RESET_EN_Pos       19                                                      /*!< EVENTROUTER ENABLE: RESET_EN Position   */
#define EVENTROUTER_ENABLE_RESET_EN_Msk       (0x01UL << EVENTROUTER_ENABLE_RESET_EN_Pos)             /*!< EVENTROUTER ENABLE: RESET_EN Mask       */
#define EVENTROUTER_ENABLE_BODRESET_EN_Pos    20                                                      /*!< EVENTROUTER ENABLE: BODRESET_EN Position */
#define EVENTROUTER_ENABLE_BODRESET_EN_Msk    (0x01UL << EVENTROUTER_ENABLE_BODRESET_EN_Pos)          /*!< EVENTROUTER ENABLE: BODRESET_EN Mask    */
#define EVENTROUTER_ENABLE_DPDRESET_EN_Pos    21                                                      /*!< EVENTROUTER ENABLE: DPDRESET_EN Position */
#define EVENTROUTER_ENABLE_DPDRESET_EN_Msk    (0x01UL << EVENTROUTER_ENABLE_DPDRESET_EN_Pos)          /*!< EVENTROUTER ENABLE: DPDRESET_EN Mask    */

