MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ----------------------------  EVENTROUTER_CLR_STAT  ---------------------------- */
#define EVENTROUTER_CLR_STAT_WAKEUP0_CLRST_Pos 0                                                      /*!< EVENTROUTER CLR_STAT: WAKEUP0_CLRST Position */
#define EVENTROUTER_CLR_STAT_WAKEUP0_CLRST_Msk (0x01UL << EVENTROUTER_CLR_STAT_WAKEUP0_CLRST_Pos)     /*!< EVENTROUTER CLR_STAT: WAKEUP0_CLRST Mask */
#define EVENTROUTER_CLR_STAT_WAKEUP1_CLRST_Pos 1                                                      /*!< EVENTROUTER CLR_STAT: WAKEUP1_CLRST Position */
#define EVENTROUTER_CLR_STAT_WAKEUP1_CLRST_Msk (0x01UL << EVENTROUTER_CLR_STAT_WAKEUP1_CLRST_Pos)     /*!< EVENTROUTER CLR_STAT: WAKEUP1_CLRST Mask */
#define EVENTROUTER_CLR_STAT_WAKEUP2_CLRST_Pos 2                                                      /*!< EVENTROUTER CLR_STAT: WAKEUP2_CLRST Position */
#define EVENTROUTER_CLR_STAT_WAKEUP2_CLRST_Msk (0x01UL << EVENTROUTER_CLR_STAT_WAKEUP2_CLRST_Pos)     /*!< EVENTROUTER CLR_STAT: WAKEUP2_CLRST Mask */
#define EVENTROUTER_CLR_STAT_WAKEUP3_CLRST_Pos 3                                                      /*!< EVENTROUTER CLR_STAT: WAKEUP3_CLRST Position */
#define EVENTROUTER_CLR_STAT_WAKEUP3_CLRST_Msk (0x01UL << EVENTROUTER_CLR_STAT_WAKEUP3_CLRST_Pos)     /*!< EVENTROUTER CLR_STAT: WAKEUP3_CLRST Mask */
#define EVENTROUTER_CLR_STAT_ATIMER_CLRST_Pos 4                                                       /*!< EVENTROUTER CLR_STAT: ATIMER_CLRST Position */
#define EVENTROUTER_CLR_STAT_ATIMER_CLRST_Msk (0x01UL << EVENTROUTER_CLR_STAT_ATIMER_CLRST_Pos)       /*!< EVENTROUTER CLR_STAT: ATIMER_CLRST Mask */
#define EVENTROUTER_CLR_STAT_RTC_CLRST_Pos    5                                                       /*!< EVENTROUTER CLR_STAT: RTC_CLRST Position */
#define EVENTROUTER_CLR_STAT_RTC_CLRST_Msk    (0x01UL << EVENTROUTER_CLR_STAT_RTC_CLRST_Pos)          /*!< EVENTROUTER CLR_STAT: RTC_CLRST Mask    */
#define EVENTROUTER_CLR_STAT_BOD_CLRST_Pos    6                                                       /*!< EVENTROUTER CLR_STAT: BOD_CLRST Position */
#define EVENTROUTER_CLR_STAT_BOD_CLRST_Msk    (0x01UL << EVENTROUTER_CLR_STAT_BOD_CLRST_Pos)          /*!< EVENTROUTER CLR_STAT: BOD_CLRST Mask    */
#define EVENTROUTER_CLR_STAT_WWDT_CLRST_Pos   7                                                       /*!< EVENTROUTER CLR_STAT: WWDT_CLRST Position */
#define EVENTROUTER_CLR_STAT_WWDT_CLRST_Msk   (0x01UL << EVENTROUTER_CLR_STAT_WWDT_CLRST_Pos)         /*!< EVENTROUTER CLR_STAT: WWDT_CLRST Mask   */
#define EVENTROUTER_CLR_STAT_ETH_CLRST_Pos    8                                                       /*!< EVENTROUTER CLR_STAT: ETH_CLRST Position */
#define EVENTROUTER_CLR_STAT_ETH_CLRST_Msk    (0x01UL << EVENTROUTER_CLR_STAT_ETH_CLRST_Pos)          /*!< EVENTROUTER CLR_STAT: ETH_CLRST Mask    */
#define EVENTROUTER_CLR_STAT_USB0_CLRST_Pos   9                                                       /*!< EVENTROUTER CLR_STAT: USB0_CLRST Position */
#define EVENTROUTER_CLR_STAT_USB0_CLRST_Msk   (0x01UL << EVENTROUTER_CLR_STAT_USB0_CLRST_Pos)         /*!< EVENTROUTER CLR_STAT: USB0_CLRST Mask   */
#define EVENTROUTER_CLR_STAT_USB1_CLRST_Pos   10                                                      /*!< EVENTROUTER CLR_STAT: USB1_CLRST Position */
#define EVENTROUTER_CLR_STAT_USB1_CLRST_Msk   (0x01UL << EVENTROUTER_CLR_STAT_USB1_CLRST_Pos)         /*!< EVENTROUTER CLR_STAT: USB1_CLRST Mask   */
#define EVENTROUTER_CLR_STAT_SDMMC_CLRST_Pos  11                                                      /*!< EVENTROUTER CLR_STAT: SDMMC_CLRST Position */
#define EVENTROUTER_CLR_STAT_SDMMC_CLRST_Msk  (0x01UL << EVENTROUTER_CLR_STAT_SDMMC_CLRST_Pos)        /*!< EVENTROUTER CLR_STAT: SDMMC_CLRST Mask  */
#define EVENTROUTER_CLR_STAT_CAN_CLRST_Pos    12                                                      /*!< EVENTROUTER CLR_STAT: CAN_CLRST Position */
#define EVENTROUTER_CLR_STAT_CAN_CLRST_Msk    (0x01UL << EVENTROUTER_CLR_STAT_CAN_CLRST_Pos)          /*!< EVENTROUTER CLR_STAT: CAN_CLRST Mask    */
#define EVENTROUTER_CLR_STAT_TIM2_CLRST_Pos   13                                                      /*!< EVENTROUTER CLR_STAT: TIM2_CLRST Position */
#define EVENTROUTER_CLR_STAT_TIM2_CLRST_Msk   (0x01UL << EVENTROUTER_CLR_STAT_TIM2_CLRST_Pos)         /*!< EVENTROUTER CLR_STAT: TIM2_CLRST Mask   */
#define EVENTROUTER_CLR_STAT_TIM6_CLRST_Pos   14                                                      /*!< EVENTROUTER CLR_STAT: TIM6_CLRST Position */
#define EVENTROUTER_CLR_STAT_TIM6_CLRST_Msk   (0x01UL << EVENTROUTER_CLR_STAT_TIM6_CLRST_Pos)         /*!< EVENTROUTER CLR_STAT: TIM6_CLRST Mask   */
#define EVENTROUTER_CLR_STAT_QEI_CLRST_Pos    15                                                      /*!< EVENTROUTER CLR_STAT: QEI_CLRST Position */
#define EVENTROUTER_CLR_STAT_QEI_CLRST_Msk    (0x01UL << EVENTROUTER_CLR_STAT_QEI_CLRST_Pos)          /*!< EVENTROUTER CLR_STAT: QEI_CLRST Mask    */
#define EVENTROUTER_CLR_STAT_TIM14_CLRST_Pos  16                                                      /*!< EVENTROUTER CLR_STAT: TIM14_CLRST Position */
#define EVENTROUTER_CLR_STAT_TIM14_CLRST_Msk  (0x01UL << EVENTROUTER_CLR_STAT_TIM14_CLRST_Pos)        /*!< EVENTROUTER CLR_STAT: TIM14_CLRST Mask  */
#define EVENTROUTER_CLR_STAT_RESET_CLRST_Pos  19                                                      /*!< EVENTROUTER CLR_STAT: RESET_CLRST Position */
#define EVENTROUTER_CLR_STAT_RESET_CLRST_Msk  (0x01UL << EVENTROUTER_CLR_STAT_RESET_CLRST_Pos)        /*!< EVENTROUTER CLR_STAT: RESET_CLRST Mask  */
#define EVENTROUTER_CLR_STAT_BODRESET_CLRST_Pos 20                                                    /*!< EVENTROUTER CLR_STAT: BODRESET_CLRST Position */
#define EVENTROUTER_CLR_STAT_BODRESET_CLRST_Msk (0x01UL << EVENTROUTER_CLR_STAT_BODRESET_CLRST_Pos)   /*!< EVENTROUTER CLR_STAT: BODRESET_CLRST Mask */
#define EVENTROUTER_CLR_STAT_DPDRESET_CLRST_Pos 21                                                    /*!< EVENTROUTER CLR_STAT: DPDRESET_CLRST Position */
#define EVENTROUTER_CLR_STAT_DPDRESET_CLRST_Msk (0x01UL << EVENTROUTER_CLR_STAT_DPDRESET_CLRST_Pos)   /*!< EVENTROUTER CLR_STAT: DPDRESET_CLRST Mask */

/* ----------------------------  EVENTROUTER_SET_STAT  ---------------------------- */
#define EVENTROUTER_SET_STAT_WAKEUP0_SETST_Pos 0                                                      /*!< EVENTROUTER SET_STAT: WAKEUP0_SETST Position */
#define EVENTROUTER_SET_STAT_WAKEUP0_SETST_Msk (0x01UL << EVENTROUTER_SET_STAT_WAKEUP0_SETST_Pos)     /*!< EVENTROUTER SET_STAT: WAKEUP0_SETST Mask */
#define EVENTROUTER_SET_STAT_WAKEUP1_SETST_Pos 1                                                      /*!< EVENTROUTER SET_STAT: WAKEUP1_SETST Position */
#define EVENTROUTER_SET_STAT_WAKEUP1_SETST_Msk (0x01UL << EVENTROUTER_SET_STAT_WAKEUP1_SETST_Pos)     /*!< EVENTROUTER SET_STAT: WAKEUP1_SETST Mask */
#define EVENTROUTER_SET_STAT_WAKEUP2_SETST_Pos 2                                                      /*!< EVENTROUTER SET_STAT: WAKEUP2_SETST Position */
#define EVENTROUTER_SET_STAT_WAKEUP2_SETST_Msk (0x01UL << EVENTROUTER_SET_STAT_WAKEUP2_SETST_Pos)     /*!< EVENTROUTER SET_STAT: WAKEUP2_SETST Mask */
#define EVENTROUTER_SET_STAT_WAKEUP3_SETST_Pos 3                                                      /*!< EVENTROUTER SET_STAT: WAKEUP3_SETST Position */
#define EVENTROUTER_SET_STAT_WAKEUP3_SETST_Msk (0x01UL << EVENTROUTER_SET_STAT_WAKEUP3_SETST_Pos)     /*!< EVENTROUTER SET_STAT: WAKEUP3_SETST Mask */
#define EVENTROUTER_SET_STAT_ATIMER_SETST_Pos 4                                                       /*!< EVENTROUTER SET_STAT: ATIMER_SETST Position */
#define EVENTROUTER_SET_STAT_ATIMER_SETST_Msk (0x01UL << EVENTROUTER_SET_STAT_ATIMER_SETST_Pos)       /*!< EVENTROUTER SET_STAT: ATIMER_SETST Mask */
#define EVENTROUTER_SET_STAT_RTC_SETST_Pos    5                                                       /*!< EVENTROUTER SET_STAT: RTC_SETST Position */
#define EVENTROUTER_SET_STAT_RTC_SETST_Msk    (0x01UL << EVENTROUTER_SET_STAT_RTC_SETST_Pos)          /*!< EVENTROUTER SET_STAT: RTC_SETST Mask    */
#define EVENTROUTER_SET_STAT_BOD_SETST_Pos    6                                                       /*!< EVENTROUTER SET_STAT: BOD_SETST Position */
#define EVENTROUTER_SET_STAT_BOD_SETST_Msk    (0x01UL << EVENTROUTER_SET_STAT_BOD_SETST_Pos)          /*!< EVENTROUTER SET_STAT: BOD_SETST Mask    */
#define EVENTROUTER_SET_STAT_WWDT_SETST_Pos   7                                                       /*!< EVENTROUTER SET_STAT: WWDT_SETST Position */
#define EVENTROUTER_SET_STAT_WWDT_SETST_Msk   (0x01UL << EVENTROUTER_SET_STAT_WWDT_SETST_Pos)         /*!< EVENTROUTER SET_STAT: WWDT_SETST Mask   */
#define EVENTROUTER_SET_STAT_ETH_SETST_Pos    8                                                       /*!< EVENTROUTER SET_STAT: ETH_SETST Position */
#define EVENTROUTER_SET_STAT_ETH_SETST_Msk    (0x01UL << EVENTROUTER_SET_STAT_ETH_SETST_Pos)          /*!< EVENTROUTER SET_STAT: ETH_SETST Mask    */
#define EVENTROUTER_SET_STAT_USB0_SETST_Pos   9                                                       /*!< EVENTROUTER SET_STAT: USB0_SETST Position */
#define EVENTROUTER_SET_STAT_USB0_SETST_Msk   (0x01UL << EVENTROUTER_SET_STAT_USB0_SETST_Pos)         /*!< EVENTROUTER SET_STAT: USB0_SETST Mask   */
#define EVENTROUTER_SET_STAT_USB1_SETST_Pos   10                                                      /*!< EVENTROUTER SET_STAT: USB1_SETST Position */
#define EVENTROUTER_SET_STAT_USB1_SETST_Msk   (0x01UL << EVENTROUTER_SET_STAT_USB1_SETST_Pos)         /*!< EVENTROUTER SET_STAT: USB1_SETST Mask   */
#define EVENTROUTER_SET_STAT_SDMMC_SETST_Pos  11                                                      /*!< EVENTROUTER SET_STAT: SDMMC_SETST Position */
#define EVENTROUTER_SET_STAT_SDMMC_SETST_Msk  (0x01UL << EVENTROUTER_SET_STAT_SDMMC_SETST_Pos)        /*!< EVENTROUTER SET_STAT: SDMMC_SETST Mask  */
#define EVENTROUTER_SET_STAT_CAN_SETST_Pos    12                                                      /*!< EVENTROUTER SET_STAT: CAN_SETST Position */
#define EVENTROUTER_SET_STAT_CAN_SETST_Msk    (0x01UL << EVENTROUTER_SET_STAT_CAN_SETST_Pos)          /*!< EVENTROUTER SET_STAT: CAN_SETST Mask    */
#define EVENTROUTER_SET_STAT_TIM2_SETST_Pos   13                                                      /*!< EVENTROUTER SET_STAT: TIM2_SETST Position */
#define EVENTROUTER_SET_STAT_TIM2_SETST_Msk   (0x01UL << EVENTROUTER_SET_STAT_TIM2_SETST_Pos)         /*!< EVENTROUTER SET_STAT: TIM2_SETST Mask   */
#define EVENTROUTER_SET_STAT_TIM6_SETST_Pos   14                                                      /*!< EVENTROUTER SET_STAT: TIM6_SETST Position */
#define EVENTROUTER_SET_STAT_TIM6_SETST_Msk   (0x01UL << EVENTROUTER_SET_STAT_TIM6_SETST_Pos)         /*!< EVENTROUTER SET_STAT: TIM6_SETST Mask   */
#define EVENTROUTER_SET_STAT_QEI_SETST_Pos    15                                                      /*!< EVENTROUTER SET_STAT: QEI_SETST Position */
#define EVENTROUTER_SET_STAT_QEI_SETST_Msk    (0x01UL << EVENTROUTER_SET_STAT_QEI_SETST_Pos)          /*!< EVENTROUTER SET_STAT: QEI_SETST Mask    */
#define EVENTROUTER_SET_STAT_TIM14_SETST_Pos  16                                                      /*!< EVENTROUTER SET_STAT: TIM14_SETST Position */
#define EVENTROUTER_SET_STAT_TIM14_SETST_Msk  (0x01UL << EVENTROUTER_SET_STAT_TIM14_SETST_Pos)        /*!< EVENTROUTER SET_STAT: TIM14_SETST Mask  */
#define EVENTROUTER_SET_STAT_RESET_SETST_Pos  19                                                      /*!< EVENTROUTER SET_STAT: RESET_SETST Position */
#define EVENTROUTER_SET_STAT_RESET_SETST_Msk  (0x01UL << EVENTROUTER_SET_STAT_RESET_SETST_Pos)        /*!< EVENTROUTER SET_STAT: RESET_SETST Mask  */
#define EVENTROUTER_SET_STAT_BODRESET_SETST_Pos 20                                                    /*!< EVENTROUTER SET_STAT: BODRESET_SETST Position */
#define EVENTROUTER_SET_STAT_BODRESET_SETST_Msk (0x01UL << EVENTROUTER_SET_STAT_BODRESET_SETST_Pos)   /*!< EVENTROUTER SET_STAT: BODRESET_SETST Mask */
#define EVENTROUTER_SET_STAT_DPDRESET_SETST_Pos 21                                                    /*!< EVENTROUTER SET_STAT: DPDRESET_SETST Position */
#define EVENTROUTER_SET_STAT_DPDRESET_SETST_Msk (0x01UL << EVENTROUTER_SET_STAT_DPDRESET_SETST_Pos)   /*!< EVENTROUTER SET_STAT: DPDRESET_SETST Mask */


/* ================================================================================ */
/* ================          struct 'RTC' Position & Mask          ================ */
/* ================================================================================ */


