MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ----------------------------------  RTC_ASEC  ---------------------------------- */
#define RTC_ASEC_SECONDS_Pos                  0                                                       /*!< RTC ASEC: SECONDS Position              */
#define RTC_ASEC_SECONDS_Msk                  (0x3fUL << RTC_ASEC_SECONDS_Pos)                        /*!< RTC ASEC: SECONDS Mask                  */

/* ----------------------------------  RTC_AMIN  ---------------------------------- */
#define RTC_AMIN_MINUTES_Pos                  0                                                       /*!< RTC AMIN: MINUTES Position              */
#define RTC_AMIN_MINUTES_Msk                  (0x3fUL << RTC_AMIN_MINUTES_Pos)                        /*!< RTC AMIN: MINUTES Mask                  */

/* ----------------------------------  RTC_AHRS  ---------------------------------- */
#define RTC_AHRS_HOURS_Pos                    0                                                       /*!< RTC AHRS: HOURS Position                */
#define RTC_AHRS_HOURS_Msk                    (0x1fUL << RTC_AHRS_HOURS_Pos)                          /*!< RTC AHRS: HOURS Mask                    */

/* ----------------------------------  RTC_ADOM  ---------------------------------- */
#define RTC_ADOM_DOM_Pos                      0                                                       /*!< RTC ADOM: DOM Position                  */
#define RTC_ADOM_DOM_Msk                      (0x1fUL << RTC_ADOM_DOM_Pos)                            /*!< RTC ADOM: DOM Mask                      */

/* ----------------------------------  RTC_ADOW  ---------------------------------- */
#define RTC_ADOW_DOW_Pos                      0                                                       /*!< RTC ADOW: DOW Position                  */
#define RTC_ADOW_DOW_Msk                      (0x07UL << RTC_ADOW_DOW_Pos)                            /*!< RTC ADOW: DOW Mask                      */

/* ----------------------------------  RTC_ADOY  ---------------------------------- */
#define RTC_ADOY_DOY_Pos                      0                                                       /*!< RTC ADOY: DOY Position                  */
#define RTC_ADOY_DOY_Msk                      (0x000001ffUL << RTC_ADOY_DOY_Pos)                      /*!< RTC ADOY: DOY Mask                      */

/* ----------------------------------  RTC_AMON  ---------------------------------- */
#define RTC_AMON_MONTH_Pos                    0                                                       /*!< RTC AMON: MONTH Position                */
#define RTC_AMON_MONTH_Msk                    (0x0fUL << RTC_AMON_MONTH_Pos)                          /*!< RTC AMON: MONTH Mask                    */

/* ----------------------------------  RTC_AYRS  ---------------------------------- */
#define RTC_AYRS_YEAR_Pos                     0                                                       /*!< RTC AYRS: YEAR Position                 */
#define RTC_AYRS_YEAR_Msk                     (0x00000fffUL << RTC_AYRS_YEAR_Pos)                     /*!< RTC AYRS: YEAR Mask                     */

/* --------------------------------  RTC_ERSTATUS  -------------------------------- */
#define RTC_ERSTATUS_EV0_Pos                  0                                                       /*!< RTC ERSTATUS: EV0 Position              */
#define RTC_ERSTATUS_EV0_Msk                  (0x01UL << RTC_ERSTATUS_EV0_Pos)                        /*!< RTC ERSTATUS: EV0 Mask                  */
#define RTC_ERSTATUS_EV1_Pos                  1                                                       /*!< RTC ERSTATUS: EV1 Position              */
#define RTC_ERSTATUS_EV1_Msk                  (0x01UL << RTC_ERSTATUS_EV1_Pos)                        /*!< RTC ERSTATUS: EV1 Mask                  */
#define RTC_ERSTATUS_EV2_Pos                  2                                                       /*!< RTC ERSTATUS: EV2 Position              */
#define RTC_ERSTATUS_EV2_Msk                  (0x01UL << RTC_ERSTATUS_EV2_Pos)                        /*!< RTC ERSTATUS: EV2 Mask                  */
#define RTC_ERSTATUS_GP_CLEARED_Pos           3                                                       /*!< RTC ERSTATUS: GP_CLEARED Position       */
#define RTC_ERSTATUS_GP_CLEARED_Msk           (0x01UL << RTC_ERSTATUS_GP_CLEARED_Pos)                 /*!< RTC ERSTATUS: GP_CLEARED Mask           */
#define RTC_ERSTATUS_WAKEUP_Pos               31                                                      /*!< RTC ERSTATUS: WAKEUP Position           */
#define RTC_ERSTATUS_WAKEUP_Msk               (0x01UL << RTC_ERSTATUS_WAKEUP_Pos)                     /*!< RTC ERSTATUS: WAKEUP Mask               */

/* --------------------------------  RTC_ERCONTRO  -------------------------------- */
#define RTC_ERCONTRO_INTWAKE_EN0_Pos          0                                                       /*!< RTC ERCONTRO: INTWAKE_EN0 Position      */
#define RTC_ERCONTRO_INTWAKE_EN0_Msk          (0x01UL << RTC_ERCONTRO_INTWAKE_EN0_Pos)                /*!< RTC ERCONTRO: INTWAKE_EN0 Mask          */
#define RTC_ERCONTRO_GPCLEAR_EN0_Pos          1                                                       /*!< RTC ERCONTRO: GPCLEAR_EN0 Position      */
#define RTC_ERCONTRO_GPCLEAR_EN0_Msk          (0x01UL << RTC_ERCONTRO_GPCLEAR_EN0_Pos)                /*!< RTC ERCONTRO: GPCLEAR_EN0 Mask          */
#define RTC_ERCONTRO_POL0_Pos                 2                                                       /*!< RTC ERCONTRO: POL0 Position             */
#define RTC_ERCONTRO_POL0_Msk                 (0x01UL << RTC_ERCONTRO_POL0_Pos)                       /*!< RTC ERCONTRO: POL0 Mask                 */
#define RTC_ERCONTRO_EV0_INPUT_EN_Pos         3                                                       /*!< RTC ERCONTRO: EV0_INPUT_EN Position     */
#define RTC_ERCONTRO_EV0_INPUT_EN_Msk         (0x01UL << RTC_ERCONTRO_EV0_INPUT_EN_Pos)               /*!< RTC ERCONTRO: EV0_INPUT_EN Mask         */
#define RTC_ERCONTRO_INTWAKE_EN1_Pos          10                                                      /*!< RTC ERCONTRO: INTWAKE_EN1 Position      */
#define RTC_ERCONTRO_INTWAKE_EN1_Msk          (0x01UL << RTC_ERCONTRO_INTWAKE_EN1_Pos)                /*!< RTC ERCONTRO: INTWAKE_EN1 Mask          */
#define RTC_ERCONTRO_GPCLEAR_EN1_Pos          11                                                      /*!< RTC ERCONTRO: GPCLEAR_EN1 Position      */
#define RTC_ERCONTRO_GPCLEAR_EN1_Msk          (0x01UL << RTC_ERCONTRO_GPCLEAR_EN1_Pos)                /*!< RTC ERCONTRO: GPCLEAR_EN1 Mask          */
#define RTC_ERCONTRO_POL1_Pos                 12                                                      /*!< RTC ERCONTRO: POL1 Position             */
#define RTC_ERCONTRO_POL1_Msk                 (0x01UL << RTC_ERCONTRO_POL1_Pos)                       /*!< RTC ERCONTRO: POL1 Mask                 */
#define RTC_ERCONTRO_EV1_INPUT_EN_Pos         13                                                      /*!< RTC ERCONTRO: EV1_INPUT_EN Position     */
#define RTC_ERCONTRO_EV1_INPUT_EN_Msk         (0x01UL << RTC_ERCONTRO_EV1_INPUT_EN_Pos)               /*!< RTC ERCONTRO: EV1_INPUT_EN Mask         */
#define RTC_ERCONTRO_INTWAKE_EN2_Pos          20                                                      /*!< RTC ERCONTRO: INTWAKE_EN2 Position      */
#define RTC_ERCONTRO_INTWAKE_EN2_Msk          (0x01UL << RTC_ERCONTRO_INTWAKE_EN2_Pos)                /*!< RTC ERCONTRO: INTWAKE_EN2 Mask          */
#define RTC_ERCONTRO_GPCLEAR_EN2_Pos          21                                                      /*!< RTC ERCONTRO: GPCLEAR_EN2 Position      */
#define RTC_ERCONTRO_GPCLEAR_EN2_Msk          (0x01UL << RTC_ERCONTRO_GPCLEAR_EN2_Pos)                /*!< RTC ERCONTRO: GPCLEAR_EN2 Mask          */
#define RTC_ERCONTRO_POL2_Pos                 22                                                      /*!< RTC ERCONTRO: POL2 Position             */
#define RTC_ERCONTRO_POL2_Msk                 (0x01UL << RTC_ERCONTRO_POL2_Pos)                       /*!< RTC ERCONTRO: POL2 Mask                 */
#define RTC_ERCONTRO_EV2_INPUT_EN_Pos         23                                                      /*!< RTC ERCONTRO: EV2_INPUT_EN Position     */
#define RTC_ERCONTRO_EV2_INPUT_EN_Msk         (0x01UL << RTC_ERCONTRO_EV2_INPUT_EN_Pos)               /*!< RTC ERCONTRO: EV2_INPUT_EN Mask         */
#define RTC_ERCONTRO_ERMODE_Pos               30                                                      /*!< RTC ERCONTRO: ERMODE Position           */
#define RTC_ERCONTRO_ERMODE_Msk               (0x03UL << RTC_ERCONTRO_ERMODE_Pos)                     /*!< RTC ERCONTRO: ERMODE Mask               */

/* -------------------------------  RTC_ERCOUNTERS  ------------------------------- */
#define RTC_ERCOUNTERS_COUNTER0_Pos           0                                                       /*!< RTC ERCOUNTERS: COUNTER0 Position       */
#define RTC_ERCOUNTERS_COUNTER0_Msk           (0x07UL << RTC_ERCOUNTERS_COUNTER0_Pos)                 /*!< RTC ERCOUNTERS: COUNTER0 Mask           */
#define RTC_ERCOUNTERS_COUNTER1_Pos           8                                                       /*!< RTC ERCOUNTERS: COUNTER1 Position       */
#define RTC_ERCOUNTERS_COUNTER1_Msk           (0x07UL << RTC_ERCOUNTERS_COUNTER1_Pos)                 /*!< RTC ERCOUNTERS: COUNTER1 Mask           */
#define RTC_ERCOUNTERS_COUNTER2_Pos           16                                                      /*!< RTC ERCOUNTERS: COUNTER2 Position       */
#define RTC_ERCOUNTERS_COUNTER2_Msk           (0x07UL << RTC_ERCOUNTERS_COUNTER2_Pos)                 /*!< RTC ERCOUNTERS: COUNTER2 Mask           */

