MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ------------------------------  RTC_ERFIRSTSTAMP0  ----------------------------- */
#define RTC_ERFIRSTSTAMP0_SEC_Pos             0                                                       /*!< RTC ERFIRSTSTAMP0: SEC Position         */
#define RTC_ERFIRSTSTAMP0_SEC_Msk             (0x3fUL << RTC_ERFIRSTSTAMP0_SEC_Pos)                   /*!< RTC ERFIRSTSTAMP0: SEC Mask             */
#define RTC_ERFIRSTSTAMP0_MIN_Pos             6                                                       /*!< RTC ERFIRSTSTAMP0: MIN Position         */
#define RTC_ERFIRSTSTAMP0_MIN_Msk             (0x3fUL << RTC_ERFIRSTSTAMP0_MIN_Pos)                   /*!< RTC ERFIRSTSTAMP0: MIN Mask             */
#define RTC_ERFIRSTSTAMP0_HOUR_Pos            12                                                      /*!< RTC ERFIRSTSTAMP0: HOUR Position        */
#define RTC_ERFIRSTSTAMP0_HOUR_Msk            (0x1fUL << RTC_ERFIRSTSTAMP0_HOUR_Pos)                  /*!< RTC ERFIRSTSTAMP0: HOUR Mask            */
#define RTC_ERFIRSTSTAMP0_DOY_Pos             17                                                      /*!< RTC ERFIRSTSTAMP0: DOY Position         */
#define RTC_ERFIRSTSTAMP0_DOY_Msk             (0x000001ffUL << RTC_ERFIRSTSTAMP0_DOY_Pos)             /*!< RTC ERFIRSTSTAMP0: DOY Mask             */

/* ------------------------------  RTC_ERFIRSTSTAMP1  ----------------------------- */
#define RTC_ERFIRSTSTAMP1_SEC_Pos             0                                                       /*!< RTC ERFIRSTSTAMP1: SEC Position         */
#define RTC_ERFIRSTSTAMP1_SEC_Msk             (0x3fUL << RTC_ERFIRSTSTAMP1_SEC_Pos)                   /*!< RTC ERFIRSTSTAMP1: SEC Mask             */
#define RTC_ERFIRSTSTAMP1_MIN_Pos             6                                                       /*!< RTC ERFIRSTSTAMP1: MIN Position         */
#define RTC_ERFIRSTSTAMP1_MIN_Msk             (0x3fUL << RTC_ERFIRSTSTAMP1_MIN_Pos)                   /*!< RTC ERFIRSTSTAMP1: MIN Mask             */
#define RTC_ERFIRSTSTAMP1_HOUR_Pos            12                                                      /*!< RTC ERFIRSTSTAMP1: HOUR Position        */
#define RTC_ERFIRSTSTAMP1_HOUR_Msk            (0x1fUL << RTC_ERFIRSTSTAMP1_HOUR_Pos)                  /*!< RTC ERFIRSTSTAMP1: HOUR Mask            */
#define RTC_ERFIRSTSTAMP1_DOY_Pos             17                                                      /*!< RTC ERFIRSTSTAMP1: DOY Position         */
#define RTC_ERFIRSTSTAMP1_DOY_Msk             (0x000001ffUL << RTC_ERFIRSTSTAMP1_DOY_Pos)             /*!< RTC ERFIRSTSTAMP1: DOY Mask             */

/* ------------------------------  RTC_ERFIRSTSTAMP2  ----------------------------- */
#define RTC_ERFIRSTSTAMP2_SEC_Pos             0                                                       /*!< RTC ERFIRSTSTAMP2: SEC Position         */
#define RTC_ERFIRSTSTAMP2_SEC_Msk             (0x3fUL << RTC_ERFIRSTSTAMP2_SEC_Pos)                   /*!< RTC ERFIRSTSTAMP2: SEC Mask             */
#define RTC_ERFIRSTSTAMP2_MIN_Pos             6                                                       /*!< RTC ERFIRSTSTAMP2: MIN Position         */
#define RTC_ERFIRSTSTAMP2_MIN_Msk             (0x3fUL << RTC_ERFIRSTSTAMP2_MIN_Pos)                   /*!< RTC ERFIRSTSTAMP2: MIN Mask             */
#define RTC_ERFIRSTSTAMP2_HOUR_Pos            12                                                      /*!< RTC ERFIRSTSTAMP2: HOUR Position        */
#define RTC_ERFIRSTSTAMP2_HOUR_Msk            (0x1fUL << RTC_ERFIRSTSTAMP2_HOUR_Pos)                  /*!< RTC ERFIRSTSTAMP2: HOUR Mask            */
#define RTC_ERFIRSTSTAMP2_DOY_Pos             17                                                      /*!< RTC ERFIRSTSTAMP2: DOY Position         */
#define RTC_ERFIRSTSTAMP2_DOY_Msk             (0x000001ffUL << RTC_ERFIRSTSTAMP2_DOY_Pos)             /*!< RTC ERFIRSTSTAMP2: DOY Mask             */

/* ------------------------------  RTC_ERLASTSTAMP0  ------------------------------ */
#define RTC_ERLASTSTAMP0_SEC_Pos              0                                                       /*!< RTC ERLASTSTAMP0: SEC Position          */
#define RTC_ERLASTSTAMP0_SEC_Msk              (0x3fUL << RTC_ERLASTSTAMP0_SEC_Pos)                    /*!< RTC ERLASTSTAMP0: SEC Mask              */
#define RTC_ERLASTSTAMP0_MIN_Pos              6                                                       /*!< RTC ERLASTSTAMP0: MIN Position          */
#define RTC_ERLASTSTAMP0_MIN_Msk              (0x3fUL << RTC_ERLASTSTAMP0_MIN_Pos)                    /*!< RTC ERLASTSTAMP0: MIN Mask              */
#define RTC_ERLASTSTAMP0_HOUR_Pos             12                                                      /*!< RTC ERLASTSTAMP0: HOUR Position         */
#define RTC_ERLASTSTAMP0_HOUR_Msk             (0x1fUL << RTC_ERLASTSTAMP0_HOUR_Pos)                   /*!< RTC ERLASTSTAMP0: HOUR Mask             */
#define RTC_ERLASTSTAMP0_DOY_Pos              17                                                      /*!< RTC ERLASTSTAMP0: DOY Position          */
#define RTC_ERLASTSTAMP0_DOY_Msk              (0x000001ffUL << RTC_ERLASTSTAMP0_DOY_Pos)              /*!< RTC ERLASTSTAMP0: DOY Mask              */

/* ------------------------------  RTC_ERLASTSTAMP1  ------------------------------ */
#define RTC_ERLASTSTAMP1_SEC_Pos              0                                                       /*!< RTC ERLASTSTAMP1: SEC Position          */
#define RTC_ERLASTSTAMP1_SEC_Msk              (0x3fUL << RTC_ERLASTSTAMP1_SEC_Pos)                    /*!< RTC ERLASTSTAMP1: SEC Mask              */
#define RTC_ERLASTSTAMP1_MIN_Pos              6                                                       /*!< RTC ERLASTSTAMP1: MIN Position          */
#define RTC_ERLASTSTAMP1_MIN_Msk              (0x3fUL << RTC_ERLASTSTAMP1_MIN_Pos)                    /*!< RTC ERLASTSTAMP1: MIN Mask              */
#define RTC_ERLASTSTAMP1_HOUR_Pos             12                                                      /*!< RTC ERLASTSTAMP1: HOUR Position         */
#define RTC_ERLASTSTAMP1_HOUR_Msk             (0x1fUL << RTC_ERLASTSTAMP1_HOUR_Pos)                   /*!< RTC ERLASTSTAMP1: HOUR Mask             */
#define RTC_ERLASTSTAMP1_DOY_Pos              17                                                      /*!< RTC ERLASTSTAMP1: DOY Position          */
#define RTC_ERLASTSTAMP1_DOY_Msk              (0x000001ffUL << RTC_ERLASTSTAMP1_DOY_Pos)              /*!< RTC ERLASTSTAMP1: DOY Mask              */

/* ------------------------------  RTC_ERLASTSTAMP2  ------------------------------ */
#define RTC_ERLASTSTAMP2_SEC_Pos              0                                                       /*!< RTC ERLASTSTAMP2: SEC Position          */
#define RTC_ERLASTSTAMP2_SEC_Msk              (0x3fUL << RTC_ERLASTSTAMP2_SEC_Pos)                    /*!< RTC ERLASTSTAMP2: SEC Mask              */
#define RTC_ERLASTSTAMP2_MIN_Pos              6                                                       /*!< RTC ERLASTSTAMP2: MIN Position          */
#define RTC_ERLASTSTAMP2_MIN_Msk              (0x3fUL << RTC_ERLASTSTAMP2_MIN_Pos)                    /*!< RTC ERLASTSTAMP2: MIN Mask              */
#define RTC_ERLASTSTAMP2_HOUR_Pos             12                                                      /*!< RTC ERLASTSTAMP2: HOUR Position         */
#define RTC_ERLASTSTAMP2_HOUR_Msk             (0x1fUL << RTC_ERLASTSTAMP2_HOUR_Pos)                   /*!< RTC ERLASTSTAMP2: HOUR Mask             */
#define RTC_ERLASTSTAMP2_DOY_Pos              17                                                      /*!< RTC ERLASTSTAMP2: DOY Position          */
#define RTC_ERLASTSTAMP2_DOY_Msk              (0x000001ffUL << RTC_ERLASTSTAMP2_DOY_Pos)              /*!< RTC ERLASTSTAMP2: DOY Mask              */


/* ================================================================================ */
/* ================          struct 'CGU' Position & Mask          ================ */
/* ================================================================================ */


/* --------------------------------  CGU_FREQ_MON  -------------------------------- */
#define CGU_FREQ_MON_RCNT_Pos                 0                                                       /*!< CGU FREQ_MON: RCNT Position             */
#define CGU_FREQ_MON_RCNT_Msk                 (0x000001ffUL << CGU_FREQ_MON_RCNT_Pos)                 /*!< CGU FREQ_MON: RCNT Mask                 */
#define CGU_FREQ_MON_FCNT_Pos                 9                                                       /*!< CGU FREQ_MON: FCNT Position             */
#define CGU_FREQ_MON_FCNT_Msk                 (0x00003fffUL << CGU_FREQ_MON_FCNT_Pos)                 /*!< CGU FREQ_MON: FCNT Mask                 */
#define CGU_FREQ_MON_MEAS_Pos                 23                                                      /*!< CGU FREQ_MON: MEAS Position             */
#define CGU_FREQ_MON_MEAS_Msk                 (0x01UL << CGU_FREQ_MON_MEAS_Pos)                       /*!< CGU FREQ_MON: MEAS Mask                 */
#define CGU_FREQ_MON_CLK_SEL_Pos              24                                                      /*!< CGU FREQ_MON: CLK_SEL Position          */
#define CGU_FREQ_MON_CLK_SEL_Msk              (0x1fUL << CGU_FREQ_MON_CLK_SEL_Pos)                    /*!< CGU FREQ_MON: CLK_SEL Mask              */

/* ------------------------------  CGU_XTAL_OSC_CTRL  ----------------------------- */
#define CGU_XTAL_OSC_CTRL_ENABLE_Pos          0                                                       /*!< CGU XTAL_OSC_CTRL: ENABLE Position      */
#define CGU_XTAL_OSC_CTRL_ENABLE_Msk          (0x01UL << CGU_XTAL_OSC_CTRL_ENABLE_Pos)                /*!< CGU XTAL_OSC_CTRL: ENABLE Mask          */
#define CGU_XTAL_OSC_CTRL_BYPASS_Pos          1                                                       /*!< CGU XTAL_OSC_CTRL: BYPASS Position      */
#define CGU_XTAL_OSC_CTRL_BYPASS_Msk          (0x01UL << CGU_XTAL_OSC_CTRL_BYPASS_Pos)                /*!< CGU XTAL_OSC_CTRL: BYPASS Mask          */
#define CGU_XTAL_OSC_CTRL_HF_Pos              2                                                       /*!< CGU XTAL_OSC_CTRL: HF Position          */
#define CGU_XTAL_OSC_CTRL_HF_Msk              (0x01UL << CGU_XTAL_OSC_CTRL_HF_Pos)                    /*!< CGU XTAL_OSC_CTRL: HF Mask              */

/* ------------------------------  CGU_PLL0USB_STAT  ------------------------------ */
#define CGU_PLL0USB_STAT_LOCK_Pos             0                                                       /*!< CGU PLL0USB_STAT: LOCK Position         */
#define CGU_PLL0USB_STAT_LOCK_Msk             (0x01UL << CGU_PLL0USB_STAT_LOCK_Pos)                   /*!< CGU PLL0USB_STAT: LOCK Mask             */
#define CGU_PLL0USB_STAT_FR_Pos               1                                                       /*!< CGU PLL0USB_STAT: FR Position           */
#define CGU_PLL0USB_STAT_FR_Msk               (0x01UL << CGU_PLL0USB_STAT_FR_Pos)                     /*!< CGU PLL0USB_STAT: FR Mask               */

