MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ------------------------------  CGU_PLL0USB_CTRL  ------------------------------ */
#define CGU_PLL0USB_CTRL_PD_Pos               0                                                       /*!< CGU PLL0USB_CTRL: PD Position           */
#define CGU_PLL0USB_CTRL_PD_Msk               (0x01UL << CGU_PLL0USB_CTRL_PD_Pos)                     /*!< CGU PLL0USB_CTRL: PD Mask               */
#define CGU_PLL0USB_CTRL_BYPASS_Pos           1                                                       /*!< CGU PLL0USB_CTRL: BYPASS Position       */
#define CGU_PLL0USB_CTRL_BYPASS_Msk           (0x01UL << CGU_PLL0USB_CTRL_BYPASS_Pos)                 /*!< CGU PLL0USB_CTRL: BYPASS Mask           */
#define CGU_PLL0USB_CTRL_DIRECTI_Pos          2                                                       /*!< CGU PLL0USB_CTRL: DIRECTI Position      */
#define CGU_PLL0USB_CTRL_DIRECTI_Msk          (0x01UL << CGU_PLL0USB_CTRL_DIRECTI_Pos)                /*!< CGU PLL0USB_CTRL: DIRECTI Mask          */
#define CGU_PLL0USB_CTRL_DIRECTO_Pos          3                                                       /*!< CGU PLL0USB_CTRL: DIRECTO Position      */
#define CGU_PLL0USB_CTRL_DIRECTO_Msk          (0x01UL << CGU_PLL0USB_CTRL_DIRECTO_Pos)                /*!< CGU PLL0USB_CTRL: DIRECTO Mask          */
#define CGU_PLL0USB_CTRL_CLKEN_Pos            4                                                       /*!< CGU PLL0USB_CTRL: CLKEN Position        */
#define CGU_PLL0USB_CTRL_CLKEN_Msk            (0x01UL << CGU_PLL0USB_CTRL_CLKEN_Pos)                  /*!< CGU PLL0USB_CTRL: CLKEN Mask            */
#define CGU_PLL0USB_CTRL_FRM_Pos              6                                                       /*!< CGU PLL0USB_CTRL: FRM Position          */
#define CGU_PLL0USB_CTRL_FRM_Msk              (0x01UL << CGU_PLL0USB_CTRL_FRM_Pos)                    /*!< CGU PLL0USB_CTRL: FRM Mask              */
#define CGU_PLL0USB_CTRL_AUTOBLOCK_Pos        11                                                      /*!< CGU PLL0USB_CTRL: AUTOBLOCK Position    */
#define CGU_PLL0USB_CTRL_AUTOBLOCK_Msk        (0x01UL << CGU_PLL0USB_CTRL_AUTOBLOCK_Pos)              /*!< CGU PLL0USB_CTRL: AUTOBLOCK Mask        */
#define CGU_PLL0USB_CTRL_CLK_SEL_Pos          24                                                      /*!< CGU PLL0USB_CTRL: CLK_SEL Position      */
#define CGU_PLL0USB_CTRL_CLK_SEL_Msk          (0x1fUL << CGU_PLL0USB_CTRL_CLK_SEL_Pos)                /*!< CGU PLL0USB_CTRL: CLK_SEL Mask          */

/* ------------------------------  CGU_PLL0USB_MDIV  ------------------------------ */
#define CGU_PLL0USB_MDIV_MDEC_Pos             0                                                       /*!< CGU PLL0USB_MDIV: MDEC Position         */
#define CGU_PLL0USB_MDIV_MDEC_Msk             (0x0001ffffUL << CGU_PLL0USB_MDIV_MDEC_Pos)             /*!< CGU PLL0USB_MDIV: MDEC Mask             */
#define CGU_PLL0USB_MDIV_SELP_Pos             17                                                      /*!< CGU PLL0USB_MDIV: SELP Position         */
#define CGU_PLL0USB_MDIV_SELP_Msk             (0x1fUL << CGU_PLL0USB_MDIV_SELP_Pos)                   /*!< CGU PLL0USB_MDIV: SELP Mask             */
#define CGU_PLL0USB_MDIV_SELI_Pos             22                                                      /*!< CGU PLL0USB_MDIV: SELI Position         */
#define CGU_PLL0USB_MDIV_SELI_Msk             (0x3fUL << CGU_PLL0USB_MDIV_SELI_Pos)                   /*!< CGU PLL0USB_MDIV: SELI Mask             */
#define CGU_PLL0USB_MDIV_SELR_Pos             28                                                      /*!< CGU PLL0USB_MDIV: SELR Position         */
#define CGU_PLL0USB_MDIV_SELR_Msk             (0x0fUL << CGU_PLL0USB_MDIV_SELR_Pos)                   /*!< CGU PLL0USB_MDIV: SELR Mask             */

/* -----------------------------  CGU_PLL0USB_NP_DIV  ----------------------------- */
#define CGU_PLL0USB_NP_DIV_PDEC_Pos           0                                                       /*!< CGU PLL0USB_NP_DIV: PDEC Position       */
#define CGU_PLL0USB_NP_DIV_PDEC_Msk           (0x7fUL << CGU_PLL0USB_NP_DIV_PDEC_Pos)                 /*!< CGU PLL0USB_NP_DIV: PDEC Mask           */
#define CGU_PLL0USB_NP_DIV_NDEC_Pos           12                                                      /*!< CGU PLL0USB_NP_DIV: NDEC Position       */
#define CGU_PLL0USB_NP_DIV_NDEC_Msk           (0x000003ffUL << CGU_PLL0USB_NP_DIV_NDEC_Pos)           /*!< CGU PLL0USB_NP_DIV: NDEC Mask           */

/* -----------------------------  CGU_PLL0AUDIO_STAT  ----------------------------- */
#define CGU_PLL0AUDIO_STAT_LOCK_Pos           0                                                       /*!< CGU PLL0AUDIO_STAT: LOCK Position       */
#define CGU_PLL0AUDIO_STAT_LOCK_Msk           (0x01UL << CGU_PLL0AUDIO_STAT_LOCK_Pos)                 /*!< CGU PLL0AUDIO_STAT: LOCK Mask           */
#define CGU_PLL0AUDIO_STAT_FR_Pos             1                                                       /*!< CGU PLL0AUDIO_STAT: FR Position         */
#define CGU_PLL0AUDIO_STAT_FR_Msk             (0x01UL << CGU_PLL0AUDIO_STAT_FR_Pos)                   /*!< CGU PLL0AUDIO_STAT: FR Mask             */

/* -----------------------------  CGU_PLL0AUDIO_CTRL  ----------------------------- */
#define CGU_PLL0AUDIO_CTRL_PD_Pos             0                                                       /*!< CGU PLL0AUDIO_CTRL: PD Position         */
#define CGU_PLL0AUDIO_CTRL_PD_Msk             (0x01UL << CGU_PLL0AUDIO_CTRL_PD_Pos)                   /*!< CGU PLL0AUDIO_CTRL: PD Mask             */
#define CGU_PLL0AUDIO_CTRL_BYPASS_Pos         1                                                       /*!< CGU PLL0AUDIO_CTRL: BYPASS Position     */
#define CGU_PLL0AUDIO_CTRL_BYPASS_Msk         (0x01UL << CGU_PLL0AUDIO_CTRL_BYPASS_Pos)               /*!< CGU PLL0AUDIO_CTRL: BYPASS Mask         */
#define CGU_PLL0AUDIO_CTRL_DIRECTI_Pos        2                                                       /*!< CGU PLL0AUDIO_CTRL: DIRECTI Position    */
#define CGU_PLL0AUDIO_CTRL_DIRECTI_Msk        (0x01UL << CGU_PLL0AUDIO_CTRL_DIRECTI_Pos)              /*!< CGU PLL0AUDIO_CTRL: DIRECTI Mask        */
#define CGU_PLL0AUDIO_CTRL_DIRECTO_Pos        3                                                       /*!< CGU PLL0AUDIO_CTRL: DIRECTO Position    */
#define CGU_PLL0AUDIO_CTRL_DIRECTO_Msk        (0x01UL << CGU_PLL0AUDIO_CTRL_DIRECTO_Pos)              /*!< CGU PLL0AUDIO_CTRL: DIRECTO Mask        */
#define CGU_PLL0AUDIO_CTRL_CLKEN_Pos          4                                                       /*!< CGU PLL0AUDIO_CTRL: CLKEN Position      */
#define CGU_PLL0AUDIO_CTRL_CLKEN_Msk          (0x01UL << CGU_PLL0AUDIO_CTRL_CLKEN_Pos)                /*!< CGU PLL0AUDIO_CTRL: CLKEN Mask          */
#define CGU_PLL0AUDIO_CTRL_FRM_Pos            6                                                       /*!< CGU PLL0AUDIO_CTRL: FRM Position        */
#define CGU_PLL0AUDIO_CTRL_FRM_Msk            (0x01UL << CGU_PLL0AUDIO_CTRL_FRM_Pos)                  /*!< CGU PLL0AUDIO_CTRL: FRM Mask            */
#define CGU_PLL0AUDIO_CTRL_AUTOBLOCK_Pos      11                                                      /*!< CGU PLL0AUDIO_CTRL: AUTOBLOCK Position  */
#define CGU_PLL0AUDIO_CTRL_AUTOBLOCK_Msk      (0x01UL << CGU_PLL0AUDIO_CTRL_AUTOBLOCK_Pos)            /*!< CGU PLL0AUDIO_CTRL: AUTOBLOCK Mask      */
#define CGU_PLL0AUDIO_CTRL_PLLFRACT_REQ_Pos   12                                                      /*!< CGU PLL0AUDIO_CTRL: PLLFRACT_REQ Position */
#define CGU_PLL0AUDIO_CTRL_PLLFRACT_REQ_Msk   (0x01UL << CGU_PLL0AUDIO_CTRL_PLLFRACT_REQ_Pos)         /*!< CGU PLL0AUDIO_CTRL: PLLFRACT_REQ Mask   */
#define CGU_PLL0AUDIO_CTRL_SEL_EXT_Pos        13                                                      /*!< CGU PLL0AUDIO_CTRL: SEL_EXT Position    */
#define CGU_PLL0AUDIO_CTRL_SEL_EXT_Msk        (0x01UL << CGU_PLL0AUDIO_CTRL_SEL_EXT_Pos)              /*!< CGU PLL0AUDIO_CTRL: SEL_EXT Mask        */
#define CGU_PLL0AUDIO_CTRL_MOD_PD_Pos         14                                                      /*!< CGU PLL0AUDIO_CTRL: MOD_PD Position     */
#define CGU_PLL0AUDIO_CTRL_MOD_PD_Msk         (0x01UL << CGU_PLL0AUDIO_CTRL_MOD_PD_Pos)               /*!< CGU PLL0AUDIO_CTRL: MOD_PD Mask         */
#define CGU_PLL0AUDIO_CTRL_CLK_SEL_Pos        24                                                      /*!< CGU PLL0AUDIO_CTRL: CLK_SEL Position    */
#define CGU_PLL0AUDIO_CTRL_CLK_SEL_Msk        (0x1fUL << CGU_PLL0AUDIO_CTRL_CLK_SEL_Pos)              /*!< CGU PLL0AUDIO_CTRL: CLK_SEL Mask        */

/* -----------------------------  CGU_PLL0AUDIO_MDIV  ----------------------------- */
#define CGU_PLL0AUDIO_MDIV_MDEC_Pos           0                                                       /*!< CGU PLL0AUDIO_MDIV: MDEC Position       */
#define CGU_PLL0AUDIO_MDIV_MDEC_Msk           (0x0001ffffUL << CGU_PLL0AUDIO_MDIV_MDEC_Pos)           /*!< CGU PLL0AUDIO_MDIV: MDEC Mask           */

/* ----------------------------  CGU_PLL0AUDIO_NP_DIV  ---------------------------- */
#define CGU_PLL0AUDIO_NP_DIV_PDEC_Pos         0                                                       /*!< CGU PLL0AUDIO_NP_DIV: PDEC Position     */
#define CGU_PLL0AUDIO_NP_DIV_PDEC_Msk         (0x7fUL << CGU_PLL0AUDIO_NP_DIV_PDEC_Pos)               /*!< CGU PLL0AUDIO_NP_DIV: PDEC Mask         */
#define CGU_PLL0AUDIO_NP_DIV_NDEC_Pos         12                                                      /*!< CGU PLL0AUDIO_NP_DIV: NDEC Position     */
#define CGU_PLL0AUDIO_NP_DIV_NDEC_Msk         (0x000003ffUL << CGU_PLL0AUDIO_NP_DIV_NDEC_Pos)         /*!< CGU PLL0AUDIO_NP_DIV: NDEC Mask         */

/* -----------------------------  CGU_PLL0AUDIO_FRAC  ----------------------------- */
#define CGU_PLL0AUDIO_FRAC_PLLFRACT_CTRL_Pos  0                                                       /*!< CGU PLL0AUDIO_FRAC: PLLFRACT_CTRL Position */
#define CGU_PLL0AUDIO_FRAC_PLLFRACT_CTRL_Msk  (0x003fffffUL << CGU_PLL0AUDIO_FRAC_PLLFRACT_CTRL_Pos)  /*!< CGU PLL0AUDIO_FRAC: PLLFRACT_CTRL Mask  */

/* --------------------------------  CGU_PLL1_STAT  ------------------------------- */
#define CGU_PLL1_STAT_LOCK_Pos                0                                                       /*!< CGU PLL1_STAT: LOCK Position            */
#define CGU_PLL1_STAT_LOCK_Msk                (0x01UL << CGU_PLL1_STAT_LOCK_Pos)                      /*!< CGU PLL1_STAT: LOCK Mask                */

/* --------------------------------  CGU_PLL1_CTRL  ------------------------------- */
#define CGU_PLL1_CTRL_PD_Pos                  0                                                       /*!< CGU PLL1_CTRL: PD Position              */
#define CGU_PLL1_CTRL_PD_Msk                  (0x01UL << CGU_PLL1_CTRL_PD_Pos)                        /*!< CGU PLL1_CTRL: PD Mask                  */
#define CGU_PLL1_CTRL_BYPASS_Pos              1                                                       /*!< CGU PLL1_CTRL: BYPASS Position          */
#define CGU_PLL1_CTRL_BYPASS_Msk              (0x01UL << CGU_PLL1_CTRL_BYPASS_Pos)                    /*!< CGU PLL1_CTRL: BYPASS Mask              */
#define CGU_PLL1_CTRL_FBSEL_Pos               6                                                       /*!< CGU PLL1_CTRL: FBSEL Position           */
#define CGU_PLL1_CTRL_FBSEL_Msk               (0x01UL << CGU_PLL1_CTRL_FBSEL_Pos)                     /*!< CGU PLL1_CTRL: FBSEL Mask               */
#define CGU_PLL1_CTRL_DIRECT_Pos              7                                                       /*!< CGU PLL1_CTRL: DIRECT Position          */
#define CGU_PLL1_CTRL_DIRECT_Msk              (0x01UL << CGU_PLL1_CTRL_DIRECT_Pos)                    /*!< CGU PLL1_CTRL: DIRECT Mask              */
#define CGU_PLL1_CTRL_PSEL_Pos                8                                                       /*!< CGU PLL1_CTRL: PSEL Position            */
#define CGU_PLL1_CTRL_PSEL_Msk                (0x03UL << CGU_PLL1_CTRL_PSEL_Pos)                      /*!< CGU PLL1_CTRL: PSEL Mask                */
#define CGU_PLL1_CTRL_AUTOBLOCK_Pos           11                                                      /*!< CGU PLL1_CTRL: AUTOBLOCK Position       */
#define CGU_PLL1_CTRL_AUTOBLOCK_Msk           (0x01UL << CGU_PLL1_CTRL_AUTOBLOCK_Pos)                 /*!< CGU PLL1_CTRL: AUTOBLOCK Mask           */
#define CGU_PLL1_CTRL_NSEL_Pos                12                                                      /*!< CGU PLL1_CTRL: NSEL Position            */
#define CGU_PLL1_CTRL_NSEL_Msk                (0x03UL << CGU_PLL1_CTRL_NSEL_Pos)                      /*!< CGU PLL1_CTRL: NSEL Mask                */
#define CGU_PLL1_CTRL_MSEL_Pos                16                                                      /*!< CGU PLL1_CTRL: MSEL Position            */
#define CGU_PLL1_CTRL_MSEL_Msk                (0x000000ffUL << CGU_PLL1_CTRL_MSEL_Pos)                /*!< CGU PLL1_CTRL: MSEL Mask                */
#define CGU_PLL1_CTRL_CLK_SEL_Pos             24                                                      /*!< CGU PLL1_CTRL: CLK_SEL Position         */
#define CGU_PLL1_CTRL_CLK_SEL_Msk             (0x1fUL << CGU_PLL1_CTRL_CLK_SEL_Pos)                   /*!< CGU PLL1_CTRL: CLK_SEL Mask             */

/* -------------------------------  CGU_IDIVA_CTRL  ------------------------------- */
#define CGU_IDIVA_CTRL_PD_Pos                 0                                                       /*!< CGU IDIVA_CTRL: PD Position             */
#define CGU_IDIVA_CTRL_PD_Msk                 (0x01UL << CGU_IDIVA_CTRL_PD_Pos)                       /*!< CGU IDIVA_CTRL: PD Mask                 */
#define CGU_IDIVA_CTRL_IDIV_Pos               2                                                       /*!< CGU IDIVA_CTRL: IDIV Position           */
#define CGU_IDIVA_CTRL_IDIV_Msk               (0x03UL << CGU_IDIVA_CTRL_IDIV_Pos)                     /*!< CGU IDIVA_CTRL: IDIV Mask               */
#define CGU_IDIVA_CTRL_AUTOBLOCK_Pos          11                                                      /*!< CGU IDIVA_CTRL: AUTOBLOCK Position      */
#define CGU_IDIVA_CTRL_AUTOBLOCK_Msk          (0x01UL << CGU_IDIVA_CTRL_AUTOBLOCK_Pos)                /*!< CGU IDIVA_CTRL: AUTOBLOCK Mask          */
#define CGU_IDIVA_CTRL_CLK_SEL_Pos            24                                                      /*!< CGU IDIVA_CTRL: CLK_SEL Position        */
#define CGU_IDIVA_CTRL_CLK_SEL_Msk            (0x1fUL << CGU_IDIVA_CTRL_CLK_SEL_Pos)                  /*!< CGU IDIVA_CTRL: CLK_SEL Mask            */

