MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ------------------------------  CGU_BASE_USB0_CLK  ----------------------------- */
#define CGU_BASE_USB0_CLK_PD_Pos              0                                                       /*!< CGU BASE_USB0_CLK: PD Position          */
#define CGU_BASE_USB0_CLK_PD_Msk              (0x01UL << CGU_BASE_USB0_CLK_PD_Pos)                    /*!< CGU BASE_USB0_CLK: PD Mask              */
#define CGU_BASE_USB0_CLK_AUTOBLOCK_Pos       11                                                      /*!< CGU BASE_USB0_CLK: AUTOBLOCK Position   */
#define CGU_BASE_USB0_CLK_AUTOBLOCK_Msk       (0x01UL << CGU_BASE_USB0_CLK_AUTOBLOCK_Pos)             /*!< CGU BASE_USB0_CLK: AUTOBLOCK Mask       */
#define CGU_BASE_USB0_CLK_CLK_SEL_Pos         24                                                      /*!< CGU BASE_USB0_CLK: CLK_SEL Position     */
#define CGU_BASE_USB0_CLK_CLK_SEL_Msk         (0x1fUL << CGU_BASE_USB0_CLK_CLK_SEL_Pos)               /*!< CGU BASE_USB0_CLK: CLK_SEL Mask         */

/* -----------------------------  CGU_BASE_PERIPH_CLK  ---------------------------- */
#define CGU_BASE_PERIPH_CLK_PD_Pos            0                                                       /*!< CGU BASE_PERIPH_CLK: PD Position        */
#define CGU_BASE_PERIPH_CLK_PD_Msk            (0x01UL << CGU_BASE_PERIPH_CLK_PD_Pos)                  /*!< CGU BASE_PERIPH_CLK: PD Mask            */
#define CGU_BASE_PERIPH_CLK_AUTOBLOCK_Pos     11                                                      /*!< CGU BASE_PERIPH_CLK: AUTOBLOCK Position */
#define CGU_BASE_PERIPH_CLK_AUTOBLOCK_Msk     (0x01UL << CGU_BASE_PERIPH_CLK_AUTOBLOCK_Pos)           /*!< CGU BASE_PERIPH_CLK: AUTOBLOCK Mask     */
#define CGU_BASE_PERIPH_CLK_CLK_SEL_Pos       24                                                      /*!< CGU BASE_PERIPH_CLK: CLK_SEL Position   */
#define CGU_BASE_PERIPH_CLK_CLK_SEL_Msk       (0x1fUL << CGU_BASE_PERIPH_CLK_CLK_SEL_Pos)             /*!< CGU BASE_PERIPH_CLK: CLK_SEL Mask       */

/* ------------------------------  CGU_BASE_USB1_CLK  ----------------------------- */
#define CGU_BASE_USB1_CLK_PD_Pos              0                                                       /*!< CGU BASE_USB1_CLK: PD Position          */
#define CGU_BASE_USB1_CLK_PD_Msk              (0x01UL << CGU_BASE_USB1_CLK_PD_Pos)                    /*!< CGU BASE_USB1_CLK: PD Mask              */
#define CGU_BASE_USB1_CLK_AUTOBLOCK_Pos       11                                                      /*!< CGU BASE_USB1_CLK: AUTOBLOCK Position   */
#define CGU_BASE_USB1_CLK_AUTOBLOCK_Msk       (0x01UL << CGU_BASE_USB1_CLK_AUTOBLOCK_Pos)             /*!< CGU BASE_USB1_CLK: AUTOBLOCK Mask       */
#define CGU_BASE_USB1_CLK_CLK_SEL_Pos         24                                                      /*!< CGU BASE_USB1_CLK: CLK_SEL Position     */
#define CGU_BASE_USB1_CLK_CLK_SEL_Msk         (0x1fUL << CGU_BASE_USB1_CLK_CLK_SEL_Pos)               /*!< CGU BASE_USB1_CLK: CLK_SEL Mask         */

/* -------------------------------  CGU_BASE_M4_CLK  ------------------------------ */
#define CGU_BASE_M4_CLK_PD_Pos                0                                                       /*!< CGU BASE_M4_CLK: PD Position            */
#define CGU_BASE_M4_CLK_PD_Msk                (0x01UL << CGU_BASE_M4_CLK_PD_Pos)                      /*!< CGU BASE_M4_CLK: PD Mask                */
#define CGU_BASE_M4_CLK_AUTOBLOCK_Pos         11                                                      /*!< CGU BASE_M4_CLK: AUTOBLOCK Position     */
#define CGU_BASE_M4_CLK_AUTOBLOCK_Msk         (0x01UL << CGU_BASE_M4_CLK_AUTOBLOCK_Pos)               /*!< CGU BASE_M4_CLK: AUTOBLOCK Mask         */
#define CGU_BASE_M4_CLK_CLK_SEL_Pos           24                                                      /*!< CGU BASE_M4_CLK: CLK_SEL Position       */
#define CGU_BASE_M4_CLK_CLK_SEL_Msk           (0x1fUL << CGU_BASE_M4_CLK_CLK_SEL_Pos)                 /*!< CGU BASE_M4_CLK: CLK_SEL Mask           */

/* -----------------------------  CGU_BASE_SPIFI_CLK  ----------------------------- */
#define CGU_BASE_SPIFI_CLK_PD_Pos             0                                                       /*!< CGU BASE_SPIFI_CLK: PD Position         */
#define CGU_BASE_SPIFI_CLK_PD_Msk             (0x01UL << CGU_BASE_SPIFI_CLK_PD_Pos)                   /*!< CGU BASE_SPIFI_CLK: PD Mask             */
#define CGU_BASE_SPIFI_CLK_AUTOBLOCK_Pos      11                                                      /*!< CGU BASE_SPIFI_CLK: AUTOBLOCK Position  */
#define CGU_BASE_SPIFI_CLK_AUTOBLOCK_Msk      (0x01UL << CGU_BASE_SPIFI_CLK_AUTOBLOCK_Pos)            /*!< CGU BASE_SPIFI_CLK: AUTOBLOCK Mask      */
#define CGU_BASE_SPIFI_CLK_CLK_SEL_Pos        24                                                      /*!< CGU BASE_SPIFI_CLK: CLK_SEL Position    */
#define CGU_BASE_SPIFI_CLK_CLK_SEL_Msk        (0x1fUL << CGU_BASE_SPIFI_CLK_CLK_SEL_Pos)              /*!< CGU BASE_SPIFI_CLK: CLK_SEL Mask        */

/* ------------------------------  CGU_BASE_SPI_CLK  ------------------------------ */
#define CGU_BASE_SPI_CLK_PD_Pos               0                                                       /*!< CGU BASE_SPI_CLK: PD Position           */
#define CGU_BASE_SPI_CLK_PD_Msk               (0x01UL << CGU_BASE_SPI_CLK_PD_Pos)                     /*!< CGU BASE_SPI_CLK: PD Mask               */
#define CGU_BASE_SPI_CLK_AUTOBLOCK_Pos        11                                                      /*!< CGU BASE_SPI_CLK: AUTOBLOCK Position    */
#define CGU_BASE_SPI_CLK_AUTOBLOCK_Msk        (0x01UL << CGU_BASE_SPI_CLK_AUTOBLOCK_Pos)              /*!< CGU BASE_SPI_CLK: AUTOBLOCK Mask        */
#define CGU_BASE_SPI_CLK_CLK_SEL_Pos          24                                                      /*!< CGU BASE_SPI_CLK: CLK_SEL Position      */
#define CGU_BASE_SPI_CLK_CLK_SEL_Msk          (0x1fUL << CGU_BASE_SPI_CLK_CLK_SEL_Pos)                /*!< CGU BASE_SPI_CLK: CLK_SEL Mask          */

/* -----------------------------  CGU_BASE_PHY_RX_CLK  ---------------------------- */
#define CGU_BASE_PHY_RX_CLK_PD_Pos            0                                                       /*!< CGU BASE_PHY_RX_CLK: PD Position        */
#define CGU_BASE_PHY_RX_CLK_PD_Msk            (0x01UL << CGU_BASE_PHY_RX_CLK_PD_Pos)                  /*!< CGU BASE_PHY_RX_CLK: PD Mask            */
#define CGU_BASE_PHY_RX_CLK_AUTOBLOCK_Pos     11                                                      /*!< CGU BASE_PHY_RX_CLK: AUTOBLOCK Position */
#define CGU_BASE_PHY_RX_CLK_AUTOBLOCK_Msk     (0x01UL << CGU_BASE_PHY_RX_CLK_AUTOBLOCK_Pos)           /*!< CGU BASE_PHY_RX_CLK: AUTOBLOCK Mask     */
#define CGU_BASE_PHY_RX_CLK_CLK_SEL_Pos       24                                                      /*!< CGU BASE_PHY_RX_CLK: CLK_SEL Position   */
#define CGU_BASE_PHY_RX_CLK_CLK_SEL_Msk       (0x1fUL << CGU_BASE_PHY_RX_CLK_CLK_SEL_Pos)             /*!< CGU BASE_PHY_RX_CLK: CLK_SEL Mask       */

/* -----------------------------  CGU_BASE_PHY_TX_CLK  ---------------------------- */
#define CGU_BASE_PHY_TX_CLK_PD_Pos            0                                                       /*!< CGU BASE_PHY_TX_CLK: PD Position        */
#define CGU_BASE_PHY_TX_CLK_PD_Msk            (0x01UL << CGU_BASE_PHY_TX_CLK_PD_Pos)                  /*!< CGU BASE_PHY_TX_CLK: PD Mask            */
#define CGU_BASE_PHY_TX_CLK_AUTOBLOCK_Pos     11                                                      /*!< CGU BASE_PHY_TX_CLK: AUTOBLOCK Position */
#define CGU_BASE_PHY_TX_CLK_AUTOBLOCK_Msk     (0x01UL << CGU_BASE_PHY_TX_CLK_AUTOBLOCK_Pos)           /*!< CGU BASE_PHY_TX_CLK: AUTOBLOCK Mask     */
#define CGU_BASE_PHY_TX_CLK_CLK_SEL_Pos       24                                                      /*!< CGU BASE_PHY_TX_CLK: CLK_SEL Position   */
#define CGU_BASE_PHY_TX_CLK_CLK_SEL_Msk       (0x1fUL << CGU_BASE_PHY_TX_CLK_CLK_SEL_Pos)             /*!< CGU BASE_PHY_TX_CLK: CLK_SEL Mask       */

/* ------------------------------  CGU_BASE_APB1_CLK  ----------------------------- */
#define CGU_BASE_APB1_CLK_PD_Pos              0                                                       /*!< CGU BASE_APB1_CLK: PD Position          */
#define CGU_BASE_APB1_CLK_PD_Msk              (0x01UL << CGU_BASE_APB1_CLK_PD_Pos)                    /*!< CGU BASE_APB1_CLK: PD Mask              */
#define CGU_BASE_APB1_CLK_AUTOBLOCK_Pos       11                                                      /*!< CGU BASE_APB1_CLK: AUTOBLOCK Position   */
#define CGU_BASE_APB1_CLK_AUTOBLOCK_Msk       (0x01UL << CGU_BASE_APB1_CLK_AUTOBLOCK_Pos)             /*!< CGU BASE_APB1_CLK: AUTOBLOCK Mask       */
#define CGU_BASE_APB1_CLK_CLK_SEL_Pos         24                                                      /*!< CGU BASE_APB1_CLK: CLK_SEL Position     */
#define CGU_BASE_APB1_CLK_CLK_SEL_Msk         (0x1fUL << CGU_BASE_APB1_CLK_CLK_SEL_Pos)               /*!< CGU BASE_APB1_CLK: CLK_SEL Mask         */

