MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------  CCU1_CLK_APB1_CAN1_CFG  --------------------------- */
#define CCU1_CLK_APB1_CAN1_CFG_RUN_Pos        0                                                       /*!< CCU1 CLK_APB1_CAN1_CFG: RUN Position    */
#define CCU1_CLK_APB1_CAN1_CFG_RUN_Msk        (0x01UL << CCU1_CLK_APB1_CAN1_CFG_RUN_Pos)              /*!< CCU1 CLK_APB1_CAN1_CFG: RUN Mask        */
#define CCU1_CLK_APB1_CAN1_CFG_AUTO_Pos       1                                                       /*!< CCU1 CLK_APB1_CAN1_CFG: AUTO Position   */
#define CCU1_CLK_APB1_CAN1_CFG_AUTO_Msk       (0x01UL << CCU1_CLK_APB1_CAN1_CFG_AUTO_Pos)             /*!< CCU1 CLK_APB1_CAN1_CFG: AUTO Mask       */
#define CCU1_CLK_APB1_CAN1_CFG_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_APB1_CAN1_CFG: WAKEUP Position */
#define CCU1_CLK_APB1_CAN1_CFG_WAKEUP_Msk     (0x01UL << CCU1_CLK_APB1_CAN1_CFG_WAKEUP_Pos)           /*!< CCU1 CLK_APB1_CAN1_CFG: WAKEUP Mask     */

/* ---------------------------  CCU1_CLK_APB1_CAN1_STAT  -------------------------- */
#define CCU1_CLK_APB1_CAN1_STAT_RUN_Pos       0                                                       /*!< CCU1 CLK_APB1_CAN1_STAT: RUN Position   */
#define CCU1_CLK_APB1_CAN1_STAT_RUN_Msk       (0x01UL << CCU1_CLK_APB1_CAN1_STAT_RUN_Pos)             /*!< CCU1 CLK_APB1_CAN1_STAT: RUN Mask       */
#define CCU1_CLK_APB1_CAN1_STAT_AUTO_Pos      1                                                       /*!< CCU1 CLK_APB1_CAN1_STAT: AUTO Position  */
#define CCU1_CLK_APB1_CAN1_STAT_AUTO_Msk      (0x01UL << CCU1_CLK_APB1_CAN1_STAT_AUTO_Pos)            /*!< CCU1 CLK_APB1_CAN1_STAT: AUTO Mask      */
#define CCU1_CLK_APB1_CAN1_STAT_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_APB1_CAN1_STAT: WAKEUP Position */
#define CCU1_CLK_APB1_CAN1_STAT_WAKEUP_Msk    (0x01UL << CCU1_CLK_APB1_CAN1_STAT_WAKEUP_Pos)          /*!< CCU1 CLK_APB1_CAN1_STAT: WAKEUP Mask    */

/* -----------------------------  CCU1_CLK_SPIFI_CFG  ----------------------------- */
#define CCU1_CLK_SPIFI_CFG_RUN_Pos            0                                                       /*!< CCU1 CLK_SPIFI_CFG: RUN Position        */
#define CCU1_CLK_SPIFI_CFG_RUN_Msk            (0x01UL << CCU1_CLK_SPIFI_CFG_RUN_Pos)                  /*!< CCU1 CLK_SPIFI_CFG: RUN Mask            */
#define CCU1_CLK_SPIFI_CFG_AUTO_Pos           1                                                       /*!< CCU1 CLK_SPIFI_CFG: AUTO Position       */
#define CCU1_CLK_SPIFI_CFG_AUTO_Msk           (0x01UL << CCU1_CLK_SPIFI_CFG_AUTO_Pos)                 /*!< CCU1 CLK_SPIFI_CFG: AUTO Mask           */
#define CCU1_CLK_SPIFI_CFG_WAKEUP_Pos         2                                                       /*!< CCU1 CLK_SPIFI_CFG: WAKEUP Position     */
#define CCU1_CLK_SPIFI_CFG_WAKEUP_Msk         (0x01UL << CCU1_CLK_SPIFI_CFG_WAKEUP_Pos)               /*!< CCU1 CLK_SPIFI_CFG: WAKEUP Mask         */

/* -----------------------------  CCU1_CLK_SPIFI_STAT  ---------------------------- */
#define CCU1_CLK_SPIFI_STAT_RUN_Pos           0                                                       /*!< CCU1 CLK_SPIFI_STAT: RUN Position       */
#define CCU1_CLK_SPIFI_STAT_RUN_Msk           (0x01UL << CCU1_CLK_SPIFI_STAT_RUN_Pos)                 /*!< CCU1 CLK_SPIFI_STAT: RUN Mask           */
#define CCU1_CLK_SPIFI_STAT_AUTO_Pos          1                                                       /*!< CCU1 CLK_SPIFI_STAT: AUTO Position      */
#define CCU1_CLK_SPIFI_STAT_AUTO_Msk          (0x01UL << CCU1_CLK_SPIFI_STAT_AUTO_Pos)                /*!< CCU1 CLK_SPIFI_STAT: AUTO Mask          */
#define CCU1_CLK_SPIFI_STAT_WAKEUP_Pos        2                                                       /*!< CCU1 CLK_SPIFI_STAT: WAKEUP Position    */
#define CCU1_CLK_SPIFI_STAT_WAKEUP_Msk        (0x01UL << CCU1_CLK_SPIFI_STAT_WAKEUP_Pos)              /*!< CCU1 CLK_SPIFI_STAT: WAKEUP Mask        */

/* -----------------------------  CCU1_CLK_M4_BUS_CFG  ---------------------------- */
#define CCU1_CLK_M4_BUS_CFG_RUN_Pos           0                                                       /*!< CCU1 CLK_M4_BUS_CFG: RUN Position       */
#define CCU1_CLK_M4_BUS_CFG_RUN_Msk           (0x01UL << CCU1_CLK_M4_BUS_CFG_RUN_Pos)                 /*!< CCU1 CLK_M4_BUS_CFG: RUN Mask           */
#define CCU1_CLK_M4_BUS_CFG_AUTO_Pos          1                                                       /*!< CCU1 CLK_M4_BUS_CFG: AUTO Position      */
#define CCU1_CLK_M4_BUS_CFG_AUTO_Msk          (0x01UL << CCU1_CLK_M4_BUS_CFG_AUTO_Pos)                /*!< CCU1 CLK_M4_BUS_CFG: AUTO Mask          */
#define CCU1_CLK_M4_BUS_CFG_WAKEUP_Pos        2                                                       /*!< CCU1 CLK_M4_BUS_CFG: WAKEUP Position    */
#define CCU1_CLK_M4_BUS_CFG_WAKEUP_Msk        (0x01UL << CCU1_CLK_M4_BUS_CFG_WAKEUP_Pos)              /*!< CCU1 CLK_M4_BUS_CFG: WAKEUP Mask        */

/* ----------------------------  CCU1_CLK_M4_BUS_STAT  ---------------------------- */
#define CCU1_CLK_M4_BUS_STAT_RUN_Pos          0                                                       /*!< CCU1 CLK_M4_BUS_STAT: RUN Position      */
#define CCU1_CLK_M4_BUS_STAT_RUN_Msk          (0x01UL << CCU1_CLK_M4_BUS_STAT_RUN_Pos)                /*!< CCU1 CLK_M4_BUS_STAT: RUN Mask          */
#define CCU1_CLK_M4_BUS_STAT_AUTO_Pos         1                                                       /*!< CCU1 CLK_M4_BUS_STAT: AUTO Position     */
#define CCU1_CLK_M4_BUS_STAT_AUTO_Msk         (0x01UL << CCU1_CLK_M4_BUS_STAT_AUTO_Pos)               /*!< CCU1 CLK_M4_BUS_STAT: AUTO Mask         */
#define CCU1_CLK_M4_BUS_STAT_WAKEUP_Pos       2                                                       /*!< CCU1 CLK_M4_BUS_STAT: WAKEUP Position   */
#define CCU1_CLK_M4_BUS_STAT_WAKEUP_Msk       (0x01UL << CCU1_CLK_M4_BUS_STAT_WAKEUP_Pos)             /*!< CCU1 CLK_M4_BUS_STAT: WAKEUP Mask       */

/* ----------------------------  CCU1_CLK_M4_SPIFI_CFG  --------------------------- */
#define CCU1_CLK_M4_SPIFI_CFG_RUN_Pos         0                                                       /*!< CCU1 CLK_M4_SPIFI_CFG: RUN Position     */
#define CCU1_CLK_M4_SPIFI_CFG_RUN_Msk         (0x01UL << CCU1_CLK_M4_SPIFI_CFG_RUN_Pos)               /*!< CCU1 CLK_M4_SPIFI_CFG: RUN Mask         */
#define CCU1_CLK_M4_SPIFI_CFG_AUTO_Pos        1                                                       /*!< CCU1 CLK_M4_SPIFI_CFG: AUTO Position    */
#define CCU1_CLK_M4_SPIFI_CFG_AUTO_Msk        (0x01UL << CCU1_CLK_M4_SPIFI_CFG_AUTO_Pos)              /*!< CCU1 CLK_M4_SPIFI_CFG: AUTO Mask        */
#define CCU1_CLK_M4_SPIFI_CFG_WAKEUP_Pos      2                                                       /*!< CCU1 CLK_M4_SPIFI_CFG: WAKEUP Position  */
#define CCU1_CLK_M4_SPIFI_CFG_WAKEUP_Msk      (0x01UL << CCU1_CLK_M4_SPIFI_CFG_WAKEUP_Pos)            /*!< CCU1 CLK_M4_SPIFI_CFG: WAKEUP Mask      */

