MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------  CCU1_CLK_M4_SPIFI_STAT  --------------------------- */
#define CCU1_CLK_M4_SPIFI_STAT_RUN_Pos        0                                                       /*!< CCU1 CLK_M4_SPIFI_STAT: RUN Position    */
#define CCU1_CLK_M4_SPIFI_STAT_RUN_Msk        (0x01UL << CCU1_CLK_M4_SPIFI_STAT_RUN_Pos)              /*!< CCU1 CLK_M4_SPIFI_STAT: RUN Mask        */
#define CCU1_CLK_M4_SPIFI_STAT_AUTO_Pos       1                                                       /*!< CCU1 CLK_M4_SPIFI_STAT: AUTO Position   */
#define CCU1_CLK_M4_SPIFI_STAT_AUTO_Msk       (0x01UL << CCU1_CLK_M4_SPIFI_STAT_AUTO_Pos)             /*!< CCU1 CLK_M4_SPIFI_STAT: AUTO Mask       */
#define CCU1_CLK_M4_SPIFI_STAT_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_M4_SPIFI_STAT: WAKEUP Position */
#define CCU1_CLK_M4_SPIFI_STAT_WAKEUP_Msk     (0x01UL << CCU1_CLK_M4_SPIFI_STAT_WAKEUP_Pos)           /*!< CCU1 CLK_M4_SPIFI_STAT: WAKEUP Mask     */

/* ----------------------------  CCU1_CLK_M4_GPIO_CFG  ---------------------------- */
#define CCU1_CLK_M4_GPIO_CFG_RUN_Pos          0                                                       /*!< CCU1 CLK_M4_GPIO_CFG: RUN Position      */
#define CCU1_CLK_M4_GPIO_CFG_RUN_Msk          (0x01UL << CCU1_CLK_M4_GPIO_CFG_RUN_Pos)                /*!< CCU1 CLK_M4_GPIO_CFG: RUN Mask          */
#define CCU1_CLK_M4_GPIO_CFG_AUTO_Pos         1                                                       /*!< CCU1 CLK_M4_GPIO_CFG: AUTO Position     */
#define CCU1_CLK_M4_GPIO_CFG_AUTO_Msk         (0x01UL << CCU1_CLK_M4_GPIO_CFG_AUTO_Pos)               /*!< CCU1 CLK_M4_GPIO_CFG: AUTO Mask         */
#define CCU1_CLK_M4_GPIO_CFG_WAKEUP_Pos       2                                                       /*!< CCU1 CLK_M4_GPIO_CFG: WAKEUP Position   */
#define CCU1_CLK_M4_GPIO_CFG_WAKEUP_Msk       (0x01UL << CCU1_CLK_M4_GPIO_CFG_WAKEUP_Pos)             /*!< CCU1 CLK_M4_GPIO_CFG: WAKEUP Mask       */

/* ----------------------------  CCU1_CLK_M4_GPIO_STAT  --------------------------- */
#define CCU1_CLK_M4_GPIO_STAT_RUN_Pos         0                                                       /*!< CCU1 CLK_M4_GPIO_STAT: RUN Position     */
#define CCU1_CLK_M4_GPIO_STAT_RUN_Msk         (0x01UL << CCU1_CLK_M4_GPIO_STAT_RUN_Pos)               /*!< CCU1 CLK_M4_GPIO_STAT: RUN Mask         */
#define CCU1_CLK_M4_GPIO_STAT_AUTO_Pos        1                                                       /*!< CCU1 CLK_M4_GPIO_STAT: AUTO Position    */
#define CCU1_CLK_M4_GPIO_STAT_AUTO_Msk        (0x01UL << CCU1_CLK_M4_GPIO_STAT_AUTO_Pos)              /*!< CCU1 CLK_M4_GPIO_STAT: AUTO Mask        */
#define CCU1_CLK_M4_GPIO_STAT_WAKEUP_Pos      2                                                       /*!< CCU1 CLK_M4_GPIO_STAT: WAKEUP Position  */
#define CCU1_CLK_M4_GPIO_STAT_WAKEUP_Msk      (0x01UL << CCU1_CLK_M4_GPIO_STAT_WAKEUP_Pos)            /*!< CCU1 CLK_M4_GPIO_STAT: WAKEUP Mask      */

/* -----------------------------  CCU1_CLK_M4_LCD_CFG  ---------------------------- */
#define CCU1_CLK_M4_LCD_CFG_RUN_Pos           0                                                       /*!< CCU1 CLK_M4_LCD_CFG: RUN Position       */
#define CCU1_CLK_M4_LCD_CFG_RUN_Msk           (0x01UL << CCU1_CLK_M4_LCD_CFG_RUN_Pos)                 /*!< CCU1 CLK_M4_LCD_CFG: RUN Mask           */
#define CCU1_CLK_M4_LCD_CFG_AUTO_Pos          1                                                       /*!< CCU1 CLK_M4_LCD_CFG: AUTO Position      */
#define CCU1_CLK_M4_LCD_CFG_AUTO_Msk          (0x01UL << CCU1_CLK_M4_LCD_CFG_AUTO_Pos)                /*!< CCU1 CLK_M4_LCD_CFG: AUTO Mask          */
#define CCU1_CLK_M4_LCD_CFG_WAKEUP_Pos        2                                                       /*!< CCU1 CLK_M4_LCD_CFG: WAKEUP Position    */
#define CCU1_CLK_M4_LCD_CFG_WAKEUP_Msk        (0x01UL << CCU1_CLK_M4_LCD_CFG_WAKEUP_Pos)              /*!< CCU1 CLK_M4_LCD_CFG: WAKEUP Mask        */

/* ----------------------------  CCU1_CLK_M4_LCD_STAT  ---------------------------- */
#define CCU1_CLK_M4_LCD_STAT_RUN_Pos          0                                                       /*!< CCU1 CLK_M4_LCD_STAT: RUN Position      */
#define CCU1_CLK_M4_LCD_STAT_RUN_Msk          (0x01UL << CCU1_CLK_M4_LCD_STAT_RUN_Pos)                /*!< CCU1 CLK_M4_LCD_STAT: RUN Mask          */
#define CCU1_CLK_M4_LCD_STAT_AUTO_Pos         1                                                       /*!< CCU1 CLK_M4_LCD_STAT: AUTO Position     */
#define CCU1_CLK_M4_LCD_STAT_AUTO_Msk         (0x01UL << CCU1_CLK_M4_LCD_STAT_AUTO_Pos)               /*!< CCU1 CLK_M4_LCD_STAT: AUTO Mask         */
#define CCU1_CLK_M4_LCD_STAT_WAKEUP_Pos       2                                                       /*!< CCU1 CLK_M4_LCD_STAT: WAKEUP Position   */
#define CCU1_CLK_M4_LCD_STAT_WAKEUP_Msk       (0x01UL << CCU1_CLK_M4_LCD_STAT_WAKEUP_Pos)             /*!< CCU1 CLK_M4_LCD_STAT: WAKEUP Mask       */

/* --------------------------  CCU1_CLK_M4_ETHERNET_CFG  -------------------------- */
#define CCU1_CLK_M4_ETHERNET_CFG_RUN_Pos      0                                                       /*!< CCU1 CLK_M4_ETHERNET_CFG: RUN Position  */
#define CCU1_CLK_M4_ETHERNET_CFG_RUN_Msk      (0x01UL << CCU1_CLK_M4_ETHERNET_CFG_RUN_Pos)            /*!< CCU1 CLK_M4_ETHERNET_CFG: RUN Mask      */
#define CCU1_CLK_M4_ETHERNET_CFG_AUTO_Pos     1                                                       /*!< CCU1 CLK_M4_ETHERNET_CFG: AUTO Position */
#define CCU1_CLK_M4_ETHERNET_CFG_AUTO_Msk     (0x01UL << CCU1_CLK_M4_ETHERNET_CFG_AUTO_Pos)           /*!< CCU1 CLK_M4_ETHERNET_CFG: AUTO Mask     */
#define CCU1_CLK_M4_ETHERNET_CFG_WAKEUP_Pos   2                                                       /*!< CCU1 CLK_M4_ETHERNET_CFG: WAKEUP Position */
#define CCU1_CLK_M4_ETHERNET_CFG_WAKEUP_Msk   (0x01UL << CCU1_CLK_M4_ETHERNET_CFG_WAKEUP_Pos)         /*!< CCU1 CLK_M4_ETHERNET_CFG: WAKEUP Mask   */

/* --------------------------  CCU1_CLK_M4_ETHERNET_STAT  ------------------------- */
#define CCU1_CLK_M4_ETHERNET_STAT_RUN_Pos     0                                                       /*!< CCU1 CLK_M4_ETHERNET_STAT: RUN Position */
#define CCU1_CLK_M4_ETHERNET_STAT_RUN_Msk     (0x01UL << CCU1_CLK_M4_ETHERNET_STAT_RUN_Pos)           /*!< CCU1 CLK_M4_ETHERNET_STAT: RUN Mask     */
#define CCU1_CLK_M4_ETHERNET_STAT_AUTO_Pos    1                                                       /*!< CCU1 CLK_M4_ETHERNET_STAT: AUTO Position */
#define CCU1_CLK_M4_ETHERNET_STAT_AUTO_Msk    (0x01UL << CCU1_CLK_M4_ETHERNET_STAT_AUTO_Pos)          /*!< CCU1 CLK_M4_ETHERNET_STAT: AUTO Mask    */
#define CCU1_CLK_M4_ETHERNET_STAT_WAKEUP_Pos  2                                                       /*!< CCU1 CLK_M4_ETHERNET_STAT: WAKEUP Position */
#define CCU1_CLK_M4_ETHERNET_STAT_WAKEUP_Msk  (0x01UL << CCU1_CLK_M4_ETHERNET_STAT_WAKEUP_Pos)        /*!< CCU1 CLK_M4_ETHERNET_STAT: WAKEUP Mask  */

