MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------  CCU1_CLK_M4_EEPROM_STAT  -------------------------- */
#define CCU1_CLK_M4_EEPROM_STAT_RUN_Pos       0                                                       /*!< CCU1 CLK_M4_EEPROM_STAT: RUN Position   */
#define CCU1_CLK_M4_EEPROM_STAT_RUN_Msk       (0x01UL << CCU1_CLK_M4_EEPROM_STAT_RUN_Pos)             /*!< CCU1 CLK_M4_EEPROM_STAT: RUN Mask       */
#define CCU1_CLK_M4_EEPROM_STAT_AUTO_Pos      1                                                       /*!< CCU1 CLK_M4_EEPROM_STAT: AUTO Position  */
#define CCU1_CLK_M4_EEPROM_STAT_AUTO_Msk      (0x01UL << CCU1_CLK_M4_EEPROM_STAT_AUTO_Pos)            /*!< CCU1 CLK_M4_EEPROM_STAT: AUTO Mask      */
#define CCU1_CLK_M4_EEPROM_STAT_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_M4_EEPROM_STAT: WAKEUP Position */
#define CCU1_CLK_M4_EEPROM_STAT_WAKEUP_Msk    (0x01UL << CCU1_CLK_M4_EEPROM_STAT_WAKEUP_Pos)          /*!< CCU1 CLK_M4_EEPROM_STAT: WAKEUP Mask    */

/* ----------------------------  CCU1_CLK_M4_WWDT_CFG  ---------------------------- */
#define CCU1_CLK_M4_WWDT_CFG_RUN_Pos          0                                                       /*!< CCU1 CLK_M4_WWDT_CFG: RUN Position      */
#define CCU1_CLK_M4_WWDT_CFG_RUN_Msk          (0x01UL << CCU1_CLK_M4_WWDT_CFG_RUN_Pos)                /*!< CCU1 CLK_M4_WWDT_CFG: RUN Mask          */
#define CCU1_CLK_M4_WWDT_CFG_AUTO_Pos         1                                                       /*!< CCU1 CLK_M4_WWDT_CFG: AUTO Position     */
#define CCU1_CLK_M4_WWDT_CFG_AUTO_Msk         (0x01UL << CCU1_CLK_M4_WWDT_CFG_AUTO_Pos)               /*!< CCU1 CLK_M4_WWDT_CFG: AUTO Mask         */
#define CCU1_CLK_M4_WWDT_CFG_WAKEUP_Pos       2                                                       /*!< CCU1 CLK_M4_WWDT_CFG: WAKEUP Position   */
#define CCU1_CLK_M4_WWDT_CFG_WAKEUP_Msk       (0x01UL << CCU1_CLK_M4_WWDT_CFG_WAKEUP_Pos)             /*!< CCU1 CLK_M4_WWDT_CFG: WAKEUP Mask       */

/* ----------------------------  CCU1_CLK_M4_WWDT_STAT  --------------------------- */
#define CCU1_CLK_M4_WWDT_STAT_RUN_Pos         0                                                       /*!< CCU1 CLK_M4_WWDT_STAT: RUN Position     */
#define CCU1_CLK_M4_WWDT_STAT_RUN_Msk         (0x01UL << CCU1_CLK_M4_WWDT_STAT_RUN_Pos)               /*!< CCU1 CLK_M4_WWDT_STAT: RUN Mask         */
#define CCU1_CLK_M4_WWDT_STAT_AUTO_Pos        1                                                       /*!< CCU1 CLK_M4_WWDT_STAT: AUTO Position    */
#define CCU1_CLK_M4_WWDT_STAT_AUTO_Msk        (0x01UL << CCU1_CLK_M4_WWDT_STAT_AUTO_Pos)              /*!< CCU1 CLK_M4_WWDT_STAT: AUTO Mask        */
#define CCU1_CLK_M4_WWDT_STAT_WAKEUP_Pos      2                                                       /*!< CCU1 CLK_M4_WWDT_STAT: WAKEUP Position  */
#define CCU1_CLK_M4_WWDT_STAT_WAKEUP_Msk      (0x01UL << CCU1_CLK_M4_WWDT_STAT_WAKEUP_Pos)            /*!< CCU1 CLK_M4_WWDT_STAT: WAKEUP Mask      */

/* ---------------------------  CCU1_CLK_M4_USART0_CFG  --------------------------- */
#define CCU1_CLK_M4_USART0_CFG_RUN_Pos        0                                                       /*!< CCU1 CLK_M4_USART0_CFG: RUN Position    */
#define CCU1_CLK_M4_USART0_CFG_RUN_Msk        (0x01UL << CCU1_CLK_M4_USART0_CFG_RUN_Pos)              /*!< CCU1 CLK_M4_USART0_CFG: RUN Mask        */
#define CCU1_CLK_M4_USART0_CFG_AUTO_Pos       1                                                       /*!< CCU1 CLK_M4_USART0_CFG: AUTO Position   */
#define CCU1_CLK_M4_USART0_CFG_AUTO_Msk       (0x01UL << CCU1_CLK_M4_USART0_CFG_AUTO_Pos)             /*!< CCU1 CLK_M4_USART0_CFG: AUTO Mask       */
#define CCU1_CLK_M4_USART0_CFG_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_M4_USART0_CFG: WAKEUP Position */
#define CCU1_CLK_M4_USART0_CFG_WAKEUP_Msk     (0x01UL << CCU1_CLK_M4_USART0_CFG_WAKEUP_Pos)           /*!< CCU1 CLK_M4_USART0_CFG: WAKEUP Mask     */

/* ---------------------------  CCU1_CLK_M4_USART0_STAT  -------------------------- */
#define CCU1_CLK_M4_USART0_STAT_RUN_Pos       0                                                       /*!< CCU1 CLK_M4_USART0_STAT: RUN Position   */
#define CCU1_CLK_M4_USART0_STAT_RUN_Msk       (0x01UL << CCU1_CLK_M4_USART0_STAT_RUN_Pos)             /*!< CCU1 CLK_M4_USART0_STAT: RUN Mask       */
#define CCU1_CLK_M4_USART0_STAT_AUTO_Pos      1                                                       /*!< CCU1 CLK_M4_USART0_STAT: AUTO Position  */
#define CCU1_CLK_M4_USART0_STAT_AUTO_Msk      (0x01UL << CCU1_CLK_M4_USART0_STAT_AUTO_Pos)            /*!< CCU1 CLK_M4_USART0_STAT: AUTO Mask      */
#define CCU1_CLK_M4_USART0_STAT_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_M4_USART0_STAT: WAKEUP Position */
#define CCU1_CLK_M4_USART0_STAT_WAKEUP_Msk    (0x01UL << CCU1_CLK_M4_USART0_STAT_WAKEUP_Pos)          /*!< CCU1 CLK_M4_USART0_STAT: WAKEUP Mask    */

/* ----------------------------  CCU1_CLK_M4_UART1_CFG  --------------------------- */
#define CCU1_CLK_M4_UART1_CFG_RUN_Pos         0                                                       /*!< CCU1 CLK_M4_UART1_CFG: RUN Position     */
#define CCU1_CLK_M4_UART1_CFG_RUN_Msk         (0x01UL << CCU1_CLK_M4_UART1_CFG_RUN_Pos)               /*!< CCU1 CLK_M4_UART1_CFG: RUN Mask         */
#define CCU1_CLK_M4_UART1_CFG_AUTO_Pos        1                                                       /*!< CCU1 CLK_M4_UART1_CFG: AUTO Position    */
#define CCU1_CLK_M4_UART1_CFG_AUTO_Msk        (0x01UL << CCU1_CLK_M4_UART1_CFG_AUTO_Pos)              /*!< CCU1 CLK_M4_UART1_CFG: AUTO Mask        */
#define CCU1_CLK_M4_UART1_CFG_WAKEUP_Pos      2                                                       /*!< CCU1 CLK_M4_UART1_CFG: WAKEUP Position  */
#define CCU1_CLK_M4_UART1_CFG_WAKEUP_Msk      (0x01UL << CCU1_CLK_M4_UART1_CFG_WAKEUP_Pos)            /*!< CCU1 CLK_M4_UART1_CFG: WAKEUP Mask      */

/* ---------------------------  CCU1_CLK_M4_UART1_STAT  --------------------------- */
#define CCU1_CLK_M4_UART1_STAT_RUN_Pos        0                                                       /*!< CCU1 CLK_M4_UART1_STAT: RUN Position    */
#define CCU1_CLK_M4_UART1_STAT_RUN_Msk        (0x01UL << CCU1_CLK_M4_UART1_STAT_RUN_Pos)              /*!< CCU1 CLK_M4_UART1_STAT: RUN Mask        */
#define CCU1_CLK_M4_UART1_STAT_AUTO_Pos       1                                                       /*!< CCU1 CLK_M4_UART1_STAT: AUTO Position   */
#define CCU1_CLK_M4_UART1_STAT_AUTO_Msk       (0x01UL << CCU1_CLK_M4_UART1_STAT_AUTO_Pos)             /*!< CCU1 CLK_M4_UART1_STAT: AUTO Mask       */
#define CCU1_CLK_M4_UART1_STAT_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_M4_UART1_STAT: WAKEUP Position */
#define CCU1_CLK_M4_UART1_STAT_WAKEUP_Msk     (0x01UL << CCU1_CLK_M4_UART1_STAT_WAKEUP_Pos)           /*!< CCU1 CLK_M4_UART1_STAT: WAKEUP Mask     */

/* ----------------------------  CCU1_CLK_M4_SSP0_CFG  ---------------------------- */
#define CCU1_CLK_M4_SSP0_CFG_RUN_Pos          0                                                       /*!< CCU1 CLK_M4_SSP0_CFG: RUN Position      */
#define CCU1_CLK_M4_SSP0_CFG_RUN_Msk          (0x01UL << CCU1_CLK_M4_SSP0_CFG_RUN_Pos)                /*!< CCU1 CLK_M4_SSP0_CFG: RUN Mask          */
#define CCU1_CLK_M4_SSP0_CFG_AUTO_Pos         1                                                       /*!< CCU1 CLK_M4_SSP0_CFG: AUTO Position     */
#define CCU1_CLK_M4_SSP0_CFG_AUTO_Msk         (0x01UL << CCU1_CLK_M4_SSP0_CFG_AUTO_Pos)               /*!< CCU1 CLK_M4_SSP0_CFG: AUTO Mask         */
#define CCU1_CLK_M4_SSP0_CFG_WAKEUP_Pos       2                                                       /*!< CCU1 CLK_M4_SSP0_CFG: WAKEUP Position   */
#define CCU1_CLK_M4_SSP0_CFG_WAKEUP_Msk       (0x01UL << CCU1_CLK_M4_SSP0_CFG_WAKEUP_Pos)             /*!< CCU1 CLK_M4_SSP0_CFG: WAKEUP Mask       */

/* ----------------------------  CCU1_CLK_M4_SSP0_STAT  --------------------------- */
#define CCU1_CLK_M4_SSP0_STAT_RUN_Pos         0                                                       /*!< CCU1 CLK_M4_SSP0_STAT: RUN Position     */
#define CCU1_CLK_M4_SSP0_STAT_RUN_Msk         (0x01UL << CCU1_CLK_M4_SSP0_STAT_RUN_Pos)               /*!< CCU1 CLK_M4_SSP0_STAT: RUN Mask         */
#define CCU1_CLK_M4_SSP0_STAT_AUTO_Pos        1                                                       /*!< CCU1 CLK_M4_SSP0_STAT: AUTO Position    */
#define CCU1_CLK_M4_SSP0_STAT_AUTO_Msk        (0x01UL << CCU1_CLK_M4_SSP0_STAT_AUTO_Pos)              /*!< CCU1 CLK_M4_SSP0_STAT: AUTO Mask        */
#define CCU1_CLK_M4_SSP0_STAT_WAKEUP_Pos      2                                                       /*!< CCU1 CLK_M4_SSP0_STAT: WAKEUP Position  */
#define CCU1_CLK_M4_SSP0_STAT_WAKEUP_Msk      (0x01UL << CCU1_CLK_M4_SSP0_STAT_WAKEUP_Pos)            /*!< CCU1 CLK_M4_SSP0_STAT: WAKEUP Mask      */

/* ---------------------------  CCU1_CLK_M4_TIMER0_CFG  --------------------------- */
#define CCU1_CLK_M4_TIMER0_CFG_RUN_Pos        0                                                       /*!< CCU1 CLK_M4_TIMER0_CFG: RUN Position    */
#define CCU1_CLK_M4_TIMER0_CFG_RUN_Msk        (0x01UL << CCU1_CLK_M4_TIMER0_CFG_RUN_Pos)              /*!< CCU1 CLK_M4_TIMER0_CFG: RUN Mask        */
#define CCU1_CLK_M4_TIMER0_CFG_AUTO_Pos       1                                                       /*!< CCU1 CLK_M4_TIMER0_CFG: AUTO Position   */
#define CCU1_CLK_M4_TIMER0_CFG_AUTO_Msk       (0x01UL << CCU1_CLK_M4_TIMER0_CFG_AUTO_Pos)             /*!< CCU1 CLK_M4_TIMER0_CFG: AUTO Mask       */
#define CCU1_CLK_M4_TIMER0_CFG_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_M4_TIMER0_CFG: WAKEUP Position */
#define CCU1_CLK_M4_TIMER0_CFG_WAKEUP_Msk     (0x01UL << CCU1_CLK_M4_TIMER0_CFG_WAKEUP_Pos)           /*!< CCU1 CLK_M4_TIMER0_CFG: WAKEUP Mask     */

/* ---------------------------  CCU1_CLK_M4_TIMER0_STAT  -------------------------- */
#define CCU1_CLK_M4_TIMER0_STAT_RUN_Pos       0                                                       /*!< CCU1 CLK_M4_TIMER0_STAT: RUN Position   */
#define CCU1_CLK_M4_TIMER0_STAT_RUN_Msk       (0x01UL << CCU1_CLK_M4_TIMER0_STAT_RUN_Pos)             /*!< CCU1 CLK_M4_TIMER0_STAT: RUN Mask       */
#define CCU1_CLK_M4_TIMER0_STAT_AUTO_Pos      1                                                       /*!< CCU1 CLK_M4_TIMER0_STAT: AUTO Position  */
#define CCU1_CLK_M4_TIMER0_STAT_AUTO_Msk      (0x01UL << CCU1_CLK_M4_TIMER0_STAT_AUTO_Pos)            /*!< CCU1 CLK_M4_TIMER0_STAT: AUTO Mask      */
#define CCU1_CLK_M4_TIMER0_STAT_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_M4_TIMER0_STAT: WAKEUP Position */
#define CCU1_CLK_M4_TIMER0_STAT_WAKEUP_Msk    (0x01UL << CCU1_CLK_M4_TIMER0_STAT_WAKEUP_Pos)          /*!< CCU1 CLK_M4_TIMER0_STAT: WAKEUP Mask    */

