MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------  CCU1_CLK_M4_TIMER1_CFG  --------------------------- */
#define CCU1_CLK_M4_TIMER1_CFG_RUN_Pos        0                                                       /*!< CCU1 CLK_M4_TIMER1_CFG: RUN Position    */
#define CCU1_CLK_M4_TIMER1_CFG_RUN_Msk        (0x01UL << CCU1_CLK_M4_TIMER1_CFG_RUN_Pos)              /*!< CCU1 CLK_M4_TIMER1_CFG: RUN Mask        */
#define CCU1_CLK_M4_TIMER1_CFG_AUTO_Pos       1                                                       /*!< CCU1 CLK_M4_TIMER1_CFG: AUTO Position   */
#define CCU1_CLK_M4_TIMER1_CFG_AUTO_Msk       (0x01UL << CCU1_CLK_M4_TIMER1_CFG_AUTO_Pos)             /*!< CCU1 CLK_M4_TIMER1_CFG: AUTO Mask       */
#define CCU1_CLK_M4_TIMER1_CFG_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_M4_TIMER1_CFG: WAKEUP Position */
#define CCU1_CLK_M4_TIMER1_CFG_WAKEUP_Msk     (0x01UL << CCU1_CLK_M4_TIMER1_CFG_WAKEUP_Pos)           /*!< CCU1 CLK_M4_TIMER1_CFG: WAKEUP Mask     */

/* ---------------------------  CCU1_CLK_M4_TIMER1_STAT  -------------------------- */
#define CCU1_CLK_M4_TIMER1_STAT_RUN_Pos       0                                                       /*!< CCU1 CLK_M4_TIMER1_STAT: RUN Position   */
#define CCU1_CLK_M4_TIMER1_STAT_RUN_Msk       (0x01UL << CCU1_CLK_M4_TIMER1_STAT_RUN_Pos)             /*!< CCU1 CLK_M4_TIMER1_STAT: RUN Mask       */
#define CCU1_CLK_M4_TIMER1_STAT_AUTO_Pos      1                                                       /*!< CCU1 CLK_M4_TIMER1_STAT: AUTO Position  */
#define CCU1_CLK_M4_TIMER1_STAT_AUTO_Msk      (0x01UL << CCU1_CLK_M4_TIMER1_STAT_AUTO_Pos)            /*!< CCU1 CLK_M4_TIMER1_STAT: AUTO Mask      */
#define CCU1_CLK_M4_TIMER1_STAT_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_M4_TIMER1_STAT: WAKEUP Position */
#define CCU1_CLK_M4_TIMER1_STAT_WAKEUP_Msk    (0x01UL << CCU1_CLK_M4_TIMER1_STAT_WAKEUP_Pos)          /*!< CCU1 CLK_M4_TIMER1_STAT: WAKEUP Mask    */

/* -----------------------------  CCU1_CLK_M4_SCU_CFG  ---------------------------- */
#define CCU1_CLK_M4_SCU_CFG_RUN_Pos           0                                                       /*!< CCU1 CLK_M4_SCU_CFG: RUN Position       */
#define CCU1_CLK_M4_SCU_CFG_RUN_Msk           (0x01UL << CCU1_CLK_M4_SCU_CFG_RUN_Pos)                 /*!< CCU1 CLK_M4_SCU_CFG: RUN Mask           */
#define CCU1_CLK_M4_SCU_CFG_AUTO_Pos          1                                                       /*!< CCU1 CLK_M4_SCU_CFG: AUTO Position      */
#define CCU1_CLK_M4_SCU_CFG_AUTO_Msk          (0x01UL << CCU1_CLK_M4_SCU_CFG_AUTO_Pos)                /*!< CCU1 CLK_M4_SCU_CFG: AUTO Mask          */
#define CCU1_CLK_M4_SCU_CFG_WAKEUP_Pos        2                                                       /*!< CCU1 CLK_M4_SCU_CFG: WAKEUP Position    */
#define CCU1_CLK_M4_SCU_CFG_WAKEUP_Msk        (0x01UL << CCU1_CLK_M4_SCU_CFG_WAKEUP_Pos)              /*!< CCU1 CLK_M4_SCU_CFG: WAKEUP Mask        */

/* ----------------------------  CCU1_CLK_M4_SCU_STAT  ---------------------------- */
#define CCU1_CLK_M4_SCU_STAT_RUN_Pos          0                                                       /*!< CCU1 CLK_M4_SCU_STAT: RUN Position      */
#define CCU1_CLK_M4_SCU_STAT_RUN_Msk          (0x01UL << CCU1_CLK_M4_SCU_STAT_RUN_Pos)                /*!< CCU1 CLK_M4_SCU_STAT: RUN Mask          */
#define CCU1_CLK_M4_SCU_STAT_AUTO_Pos         1                                                       /*!< CCU1 CLK_M4_SCU_STAT: AUTO Position     */
#define CCU1_CLK_M4_SCU_STAT_AUTO_Msk         (0x01UL << CCU1_CLK_M4_SCU_STAT_AUTO_Pos)               /*!< CCU1 CLK_M4_SCU_STAT: AUTO Mask         */
#define CCU1_CLK_M4_SCU_STAT_WAKEUP_Pos       2                                                       /*!< CCU1 CLK_M4_SCU_STAT: WAKEUP Position   */
#define CCU1_CLK_M4_SCU_STAT_WAKEUP_Msk       (0x01UL << CCU1_CLK_M4_SCU_STAT_WAKEUP_Pos)             /*!< CCU1 CLK_M4_SCU_STAT: WAKEUP Mask       */

/* ----------------------------  CCU1_CLK_M4_CREG_CFG  ---------------------------- */
#define CCU1_CLK_M4_CREG_CFG_RUN_Pos          0                                                       /*!< CCU1 CLK_M4_CREG_CFG: RUN Position      */
#define CCU1_CLK_M4_CREG_CFG_RUN_Msk          (0x01UL << CCU1_CLK_M4_CREG_CFG_RUN_Pos)                /*!< CCU1 CLK_M4_CREG_CFG: RUN Mask          */
#define CCU1_CLK_M4_CREG_CFG_AUTO_Pos         1                                                       /*!< CCU1 CLK_M4_CREG_CFG: AUTO Position     */
#define CCU1_CLK_M4_CREG_CFG_AUTO_Msk         (0x01UL << CCU1_CLK_M4_CREG_CFG_AUTO_Pos)               /*!< CCU1 CLK_M4_CREG_CFG: AUTO Mask         */
#define CCU1_CLK_M4_CREG_CFG_WAKEUP_Pos       2                                                       /*!< CCU1 CLK_M4_CREG_CFG: WAKEUP Position   */
#define CCU1_CLK_M4_CREG_CFG_WAKEUP_Msk       (0x01UL << CCU1_CLK_M4_CREG_CFG_WAKEUP_Pos)             /*!< CCU1 CLK_M4_CREG_CFG: WAKEUP Mask       */

/* ----------------------------  CCU1_CLK_M4_CREG_STAT  --------------------------- */
#define CCU1_CLK_M4_CREG_STAT_RUN_Pos         0                                                       /*!< CCU1 CLK_M4_CREG_STAT: RUN Position     */
#define CCU1_CLK_M4_CREG_STAT_RUN_Msk         (0x01UL << CCU1_CLK_M4_CREG_STAT_RUN_Pos)               /*!< CCU1 CLK_M4_CREG_STAT: RUN Mask         */
#define CCU1_CLK_M4_CREG_STAT_AUTO_Pos        1                                                       /*!< CCU1 CLK_M4_CREG_STAT: AUTO Position    */
#define CCU1_CLK_M4_CREG_STAT_AUTO_Msk        (0x01UL << CCU1_CLK_M4_CREG_STAT_AUTO_Pos)              /*!< CCU1 CLK_M4_CREG_STAT: AUTO Mask        */
#define CCU1_CLK_M4_CREG_STAT_WAKEUP_Pos      2                                                       /*!< CCU1 CLK_M4_CREG_STAT: WAKEUP Position  */
#define CCU1_CLK_M4_CREG_STAT_WAKEUP_Msk      (0x01UL << CCU1_CLK_M4_CREG_STAT_WAKEUP_Pos)            /*!< CCU1 CLK_M4_CREG_STAT: WAKEUP Mask      */

/* ---------------------------  CCU1_CLK_M4_RITIMER_CFG  -------------------------- */
#define CCU1_CLK_M4_RITIMER_CFG_RUN_Pos       0                                                       /*!< CCU1 CLK_M4_RITIMER_CFG: RUN Position   */
#define CCU1_CLK_M4_RITIMER_CFG_RUN_Msk       (0x01UL << CCU1_CLK_M4_RITIMER_CFG_RUN_Pos)             /*!< CCU1 CLK_M4_RITIMER_CFG: RUN Mask       */
#define CCU1_CLK_M4_RITIMER_CFG_AUTO_Pos      1                                                       /*!< CCU1 CLK_M4_RITIMER_CFG: AUTO Position  */
#define CCU1_CLK_M4_RITIMER_CFG_AUTO_Msk      (0x01UL << CCU1_CLK_M4_RITIMER_CFG_AUTO_Pos)            /*!< CCU1 CLK_M4_RITIMER_CFG: AUTO Mask      */
#define CCU1_CLK_M4_RITIMER_CFG_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_M4_RITIMER_CFG: WAKEUP Position */
#define CCU1_CLK_M4_RITIMER_CFG_WAKEUP_Msk    (0x01UL << CCU1_CLK_M4_RITIMER_CFG_WAKEUP_Pos)          /*!< CCU1 CLK_M4_RITIMER_CFG: WAKEUP Mask    */

/* --------------------------  CCU1_CLK_M4_RITIMER_STAT  -------------------------- */
#define CCU1_CLK_M4_RITIMER_STAT_RUN_Pos      0                                                       /*!< CCU1 CLK_M4_RITIMER_STAT: RUN Position  */
#define CCU1_CLK_M4_RITIMER_STAT_RUN_Msk      (0x01UL << CCU1_CLK_M4_RITIMER_STAT_RUN_Pos)            /*!< CCU1 CLK_M4_RITIMER_STAT: RUN Mask      */
#define CCU1_CLK_M4_RITIMER_STAT_AUTO_Pos     1                                                       /*!< CCU1 CLK_M4_RITIMER_STAT: AUTO Position */
#define CCU1_CLK_M4_RITIMER_STAT_AUTO_Msk     (0x01UL << CCU1_CLK_M4_RITIMER_STAT_AUTO_Pos)           /*!< CCU1 CLK_M4_RITIMER_STAT: AUTO Mask     */
#define CCU1_CLK_M4_RITIMER_STAT_WAKEUP_Pos   2                                                       /*!< CCU1 CLK_M4_RITIMER_STAT: WAKEUP Position */
#define CCU1_CLK_M4_RITIMER_STAT_WAKEUP_Msk   (0x01UL << CCU1_CLK_M4_RITIMER_STAT_WAKEUP_Pos)         /*!< CCU1 CLK_M4_RITIMER_STAT: WAKEUP Mask   */

/* ---------------------------  CCU1_CLK_M4_USART2_CFG  --------------------------- */
#define CCU1_CLK_M4_USART2_CFG_RUN_Pos        0                                                       /*!< CCU1 CLK_M4_USART2_CFG: RUN Position    */
#define CCU1_CLK_M4_USART2_CFG_RUN_Msk        (0x01UL << CCU1_CLK_M4_USART2_CFG_RUN_Pos)              /*!< CCU1 CLK_M4_USART2_CFG: RUN Mask        */
#define CCU1_CLK_M4_USART2_CFG_AUTO_Pos       1                                                       /*!< CCU1 CLK_M4_USART2_CFG: AUTO Position   */
#define CCU1_CLK_M4_USART2_CFG_AUTO_Msk       (0x01UL << CCU1_CLK_M4_USART2_CFG_AUTO_Pos)             /*!< CCU1 CLK_M4_USART2_CFG: AUTO Mask       */
#define CCU1_CLK_M4_USART2_CFG_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_M4_USART2_CFG: WAKEUP Position */
#define CCU1_CLK_M4_USART2_CFG_WAKEUP_Msk     (0x01UL << CCU1_CLK_M4_USART2_CFG_WAKEUP_Pos)           /*!< CCU1 CLK_M4_USART2_CFG: WAKEUP Mask     */

/* ---------------------------  CCU1_CLK_M4_USART2_STAT  -------------------------- */
#define CCU1_CLK_M4_USART2_STAT_RUN_Pos       0                                                       /*!< CCU1 CLK_M4_USART2_STAT: RUN Position   */
#define CCU1_CLK_M4_USART2_STAT_RUN_Msk       (0x01UL << CCU1_CLK_M4_USART2_STAT_RUN_Pos)             /*!< CCU1 CLK_M4_USART2_STAT: RUN Mask       */
#define CCU1_CLK_M4_USART2_STAT_AUTO_Pos      1                                                       /*!< CCU1 CLK_M4_USART2_STAT: AUTO Position  */
#define CCU1_CLK_M4_USART2_STAT_AUTO_Msk      (0x01UL << CCU1_CLK_M4_USART2_STAT_AUTO_Pos)            /*!< CCU1 CLK_M4_USART2_STAT: AUTO Mask      */
#define CCU1_CLK_M4_USART2_STAT_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_M4_USART2_STAT: WAKEUP Position */
#define CCU1_CLK_M4_USART2_STAT_WAKEUP_Msk    (0x01UL << CCU1_CLK_M4_USART2_STAT_WAKEUP_Pos)          /*!< CCU1 CLK_M4_USART2_STAT: WAKEUP Mask    */

