MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ----------------------------  CCU1_CLK_M4_QEI_STAT  ---------------------------- */
#define CCU1_CLK_M4_QEI_STAT_RUN_Pos          0                                                       /*!< CCU1 CLK_M4_QEI_STAT: RUN Position      */
#define CCU1_CLK_M4_QEI_STAT_RUN_Msk          (0x01UL << CCU1_CLK_M4_QEI_STAT_RUN_Pos)                /*!< CCU1 CLK_M4_QEI_STAT: RUN Mask          */
#define CCU1_CLK_M4_QEI_STAT_AUTO_Pos         1                                                       /*!< CCU1 CLK_M4_QEI_STAT: AUTO Position     */
#define CCU1_CLK_M4_QEI_STAT_AUTO_Msk         (0x01UL << CCU1_CLK_M4_QEI_STAT_AUTO_Pos)               /*!< CCU1 CLK_M4_QEI_STAT: AUTO Mask         */
#define CCU1_CLK_M4_QEI_STAT_WAKEUP_Pos       2                                                       /*!< CCU1 CLK_M4_QEI_STAT: WAKEUP Position   */
#define CCU1_CLK_M4_QEI_STAT_WAKEUP_Msk       (0x01UL << CCU1_CLK_M4_QEI_STAT_WAKEUP_Pos)             /*!< CCU1 CLK_M4_QEI_STAT: WAKEUP Mask       */

/* ---------------------------  CCU1_CLK_PERIPH_BUS_CFG  -------------------------- */
#define CCU1_CLK_PERIPH_BUS_CFG_RUN_Pos       0                                                       /*!< CCU1 CLK_PERIPH_BUS_CFG: RUN Position   */
#define CCU1_CLK_PERIPH_BUS_CFG_RUN_Msk       (0x01UL << CCU1_CLK_PERIPH_BUS_CFG_RUN_Pos)             /*!< CCU1 CLK_PERIPH_BUS_CFG: RUN Mask       */
#define CCU1_CLK_PERIPH_BUS_CFG_AUTO_Pos      1                                                       /*!< CCU1 CLK_PERIPH_BUS_CFG: AUTO Position  */
#define CCU1_CLK_PERIPH_BUS_CFG_AUTO_Msk      (0x01UL << CCU1_CLK_PERIPH_BUS_CFG_AUTO_Pos)            /*!< CCU1 CLK_PERIPH_BUS_CFG: AUTO Mask      */
#define CCU1_CLK_PERIPH_BUS_CFG_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_PERIPH_BUS_CFG: WAKEUP Position */
#define CCU1_CLK_PERIPH_BUS_CFG_WAKEUP_Msk    (0x01UL << CCU1_CLK_PERIPH_BUS_CFG_WAKEUP_Pos)          /*!< CCU1 CLK_PERIPH_BUS_CFG: WAKEUP Mask    */

/* --------------------------  CCU1_CLK_PERIPH_BUS_STAT  -------------------------- */
#define CCU1_CLK_PERIPH_BUS_STAT_RUN_Pos      0                                                       /*!< CCU1 CLK_PERIPH_BUS_STAT: RUN Position  */
#define CCU1_CLK_PERIPH_BUS_STAT_RUN_Msk      (0x01UL << CCU1_CLK_PERIPH_BUS_STAT_RUN_Pos)            /*!< CCU1 CLK_PERIPH_BUS_STAT: RUN Mask      */
#define CCU1_CLK_PERIPH_BUS_STAT_AUTO_Pos     1                                                       /*!< CCU1 CLK_PERIPH_BUS_STAT: AUTO Position */
#define CCU1_CLK_PERIPH_BUS_STAT_AUTO_Msk     (0x01UL << CCU1_CLK_PERIPH_BUS_STAT_AUTO_Pos)           /*!< CCU1 CLK_PERIPH_BUS_STAT: AUTO Mask     */
#define CCU1_CLK_PERIPH_BUS_STAT_WAKEUP_Pos   2                                                       /*!< CCU1 CLK_PERIPH_BUS_STAT: WAKEUP Position */
#define CCU1_CLK_PERIPH_BUS_STAT_WAKEUP_Msk   (0x01UL << CCU1_CLK_PERIPH_BUS_STAT_WAKEUP_Pos)         /*!< CCU1 CLK_PERIPH_BUS_STAT: WAKEUP Mask   */

/* --------------------------  CCU1_CLK_PERIPH_CORE_CFG  -------------------------- */
#define CCU1_CLK_PERIPH_CORE_CFG_RUN_Pos      0                                                       /*!< CCU1 CLK_PERIPH_CORE_CFG: RUN Position  */
#define CCU1_CLK_PERIPH_CORE_CFG_RUN_Msk      (0x01UL << CCU1_CLK_PERIPH_CORE_CFG_RUN_Pos)            /*!< CCU1 CLK_PERIPH_CORE_CFG: RUN Mask      */
#define CCU1_CLK_PERIPH_CORE_CFG_AUTO_Pos     1                                                       /*!< CCU1 CLK_PERIPH_CORE_CFG: AUTO Position */
#define CCU1_CLK_PERIPH_CORE_CFG_AUTO_Msk     (0x01UL << CCU1_CLK_PERIPH_CORE_CFG_AUTO_Pos)           /*!< CCU1 CLK_PERIPH_CORE_CFG: AUTO Mask     */
#define CCU1_CLK_PERIPH_CORE_CFG_WAKEUP_Pos   2                                                       /*!< CCU1 CLK_PERIPH_CORE_CFG: WAKEUP Position */
#define CCU1_CLK_PERIPH_CORE_CFG_WAKEUP_Msk   (0x01UL << CCU1_CLK_PERIPH_CORE_CFG_WAKEUP_Pos)         /*!< CCU1 CLK_PERIPH_CORE_CFG: WAKEUP Mask   */

/* --------------------------  CCU1_CLK_PERIPH_CORE_STAT  ------------------------- */
#define CCU1_CLK_PERIPH_CORE_STAT_RUN_Pos     0                                                       /*!< CCU1 CLK_PERIPH_CORE_STAT: RUN Position */
#define CCU1_CLK_PERIPH_CORE_STAT_RUN_Msk     (0x01UL << CCU1_CLK_PERIPH_CORE_STAT_RUN_Pos)           /*!< CCU1 CLK_PERIPH_CORE_STAT: RUN Mask     */
#define CCU1_CLK_PERIPH_CORE_STAT_AUTO_Pos    1                                                       /*!< CCU1 CLK_PERIPH_CORE_STAT: AUTO Position */
#define CCU1_CLK_PERIPH_CORE_STAT_AUTO_Msk    (0x01UL << CCU1_CLK_PERIPH_CORE_STAT_AUTO_Pos)          /*!< CCU1 CLK_PERIPH_CORE_STAT: AUTO Mask    */
#define CCU1_CLK_PERIPH_CORE_STAT_WAKEUP_Pos  2                                                       /*!< CCU1 CLK_PERIPH_CORE_STAT: WAKEUP Position */
#define CCU1_CLK_PERIPH_CORE_STAT_WAKEUP_Msk  (0x01UL << CCU1_CLK_PERIPH_CORE_STAT_WAKEUP_Pos)        /*!< CCU1 CLK_PERIPH_CORE_STAT: WAKEUP Mask  */

/* --------------------------  CCU1_CLK_PERIPH_SGPIO_CFG  ------------------------- */
#define CCU1_CLK_PERIPH_SGPIO_CFG_RUN_Pos     0                                                       /*!< CCU1 CLK_PERIPH_SGPIO_CFG: RUN Position */
#define CCU1_CLK_PERIPH_SGPIO_CFG_RUN_Msk     (0x01UL << CCU1_CLK_PERIPH_SGPIO_CFG_RUN_Pos)           /*!< CCU1 CLK_PERIPH_SGPIO_CFG: RUN Mask     */
#define CCU1_CLK_PERIPH_SGPIO_CFG_AUTO_Pos    1                                                       /*!< CCU1 CLK_PERIPH_SGPIO_CFG: AUTO Position */
#define CCU1_CLK_PERIPH_SGPIO_CFG_AUTO_Msk    (0x01UL << CCU1_CLK_PERIPH_SGPIO_CFG_AUTO_Pos)          /*!< CCU1 CLK_PERIPH_SGPIO_CFG: AUTO Mask    */
#define CCU1_CLK_PERIPH_SGPIO_CFG_WAKEUP_Pos  2                                                       /*!< CCU1 CLK_PERIPH_SGPIO_CFG: WAKEUP Position */
#define CCU1_CLK_PERIPH_SGPIO_CFG_WAKEUP_Msk  (0x01UL << CCU1_CLK_PERIPH_SGPIO_CFG_WAKEUP_Pos)        /*!< CCU1 CLK_PERIPH_SGPIO_CFG: WAKEUP Mask  */

/* -------------------------  CCU1_CLK_PERIPH_SGPIO_STAT  ------------------------- */
#define CCU1_CLK_PERIPH_SGPIO_STAT_RUN_Pos    0                                                       /*!< CCU1 CLK_PERIPH_SGPIO_STAT: RUN Position */
#define CCU1_CLK_PERIPH_SGPIO_STAT_RUN_Msk    (0x01UL << CCU1_CLK_PERIPH_SGPIO_STAT_RUN_Pos)          /*!< CCU1 CLK_PERIPH_SGPIO_STAT: RUN Mask    */
#define CCU1_CLK_PERIPH_SGPIO_STAT_AUTO_Pos   1                                                       /*!< CCU1 CLK_PERIPH_SGPIO_STAT: AUTO Position */
#define CCU1_CLK_PERIPH_SGPIO_STAT_AUTO_Msk   (0x01UL << CCU1_CLK_PERIPH_SGPIO_STAT_AUTO_Pos)         /*!< CCU1 CLK_PERIPH_SGPIO_STAT: AUTO Mask   */
#define CCU1_CLK_PERIPH_SGPIO_STAT_WAKEUP_Pos 2                                                       /*!< CCU1 CLK_PERIPH_SGPIO_STAT: WAKEUP Position */
#define CCU1_CLK_PERIPH_SGPIO_STAT_WAKEUP_Msk (0x01UL << CCU1_CLK_PERIPH_SGPIO_STAT_WAKEUP_Pos)       /*!< CCU1 CLK_PERIPH_SGPIO_STAT: WAKEUP Mask */

/* ------------------------------  CCU1_CLK_USB0_CFG  ----------------------------- */
#define CCU1_CLK_USB0_CFG_RUN_Pos             0                                                       /*!< CCU1 CLK_USB0_CFG: RUN Position         */
#define CCU1_CLK_USB0_CFG_RUN_Msk             (0x01UL << CCU1_CLK_USB0_CFG_RUN_Pos)                   /*!< CCU1 CLK_USB0_CFG: RUN Mask             */
#define CCU1_CLK_USB0_CFG_AUTO_Pos            1                                                       /*!< CCU1 CLK_USB0_CFG: AUTO Position        */
#define CCU1_CLK_USB0_CFG_AUTO_Msk            (0x01UL << CCU1_CLK_USB0_CFG_AUTO_Pos)                  /*!< CCU1 CLK_USB0_CFG: AUTO Mask            */
#define CCU1_CLK_USB0_CFG_WAKEUP_Pos          2                                                       /*!< CCU1 CLK_USB0_CFG: WAKEUP Position      */
#define CCU1_CLK_USB0_CFG_WAKEUP_Msk          (0x01UL << CCU1_CLK_USB0_CFG_WAKEUP_Pos)                /*!< CCU1 CLK_USB0_CFG: WAKEUP Mask          */

/* -----------------------------  CCU1_CLK_USB0_STAT  ----------------------------- */
#define CCU1_CLK_USB0_STAT_RUN_Pos            0                                                       /*!< CCU1 CLK_USB0_STAT: RUN Position        */
#define CCU1_CLK_USB0_STAT_RUN_Msk            (0x01UL << CCU1_CLK_USB0_STAT_RUN_Pos)                  /*!< CCU1 CLK_USB0_STAT: RUN Mask            */
#define CCU1_CLK_USB0_STAT_AUTO_Pos           1                                                       /*!< CCU1 CLK_USB0_STAT: AUTO Position       */
#define CCU1_CLK_USB0_STAT_AUTO_Msk           (0x01UL << CCU1_CLK_USB0_STAT_AUTO_Pos)                 /*!< CCU1 CLK_USB0_STAT: AUTO Mask           */
#define CCU1_CLK_USB0_STAT_WAKEUP_Pos         2                                                       /*!< CCU1 CLK_USB0_STAT: WAKEUP Position     */
#define CCU1_CLK_USB0_STAT_WAKEUP_Msk         (0x01UL << CCU1_CLK_USB0_STAT_WAKEUP_Pos)               /*!< CCU1 CLK_USB0_STAT: WAKEUP Mask         */

/* ------------------------------  CCU1_CLK_USB1_CFG  ----------------------------- */
#define CCU1_CLK_USB1_CFG_RUN_Pos             0                                                       /*!< CCU1 CLK_USB1_CFG: RUN Position         */
#define CCU1_CLK_USB1_CFG_RUN_Msk             (0x01UL << CCU1_CLK_USB1_CFG_RUN_Pos)                   /*!< CCU1 CLK_USB1_CFG: RUN Mask             */
#define CCU1_CLK_USB1_CFG_AUTO_Pos            1                                                       /*!< CCU1 CLK_USB1_CFG: AUTO Position        */
#define CCU1_CLK_USB1_CFG_AUTO_Msk            (0x01UL << CCU1_CLK_USB1_CFG_AUTO_Pos)                  /*!< CCU1 CLK_USB1_CFG: AUTO Mask            */
#define CCU1_CLK_USB1_CFG_WAKEUP_Pos          2                                                       /*!< CCU1 CLK_USB1_CFG: WAKEUP Position      */
#define CCU1_CLK_USB1_CFG_WAKEUP_Msk          (0x01UL << CCU1_CLK_USB1_CFG_WAKEUP_Pos)                /*!< CCU1 CLK_USB1_CFG: WAKEUP Mask          */

