MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -------------------------------  RGU_RESET_CTRL1  ------------------------------ */
#define RGU_RESET_CTRL1_TIMER0_RST_Pos        0                                                       /*!< RGU RESET_CTRL1: TIMER0_RST Position    */
#define RGU_RESET_CTRL1_TIMER0_RST_Msk        (0x01UL << RGU_RESET_CTRL1_TIMER0_RST_Pos)              /*!< RGU RESET_CTRL1: TIMER0_RST Mask        */
#define RGU_RESET_CTRL1_TIMER1_RST_Pos        1                                                       /*!< RGU RESET_CTRL1: TIMER1_RST Position    */
#define RGU_RESET_CTRL1_TIMER1_RST_Msk        (0x01UL << RGU_RESET_CTRL1_TIMER1_RST_Pos)              /*!< RGU RESET_CTRL1: TIMER1_RST Mask        */
#define RGU_RESET_CTRL1_TIMER2_RST_Pos        2                                                       /*!< RGU RESET_CTRL1: TIMER2_RST Position    */
#define RGU_RESET_CTRL1_TIMER2_RST_Msk        (0x01UL << RGU_RESET_CTRL1_TIMER2_RST_Pos)              /*!< RGU RESET_CTRL1: TIMER2_RST Mask        */
#define RGU_RESET_CTRL1_TIMER3_RST_Pos        3                                                       /*!< RGU RESET_CTRL1: TIMER3_RST Position    */
#define RGU_RESET_CTRL1_TIMER3_RST_Msk        (0x01UL << RGU_RESET_CTRL1_TIMER3_RST_Pos)              /*!< RGU RESET_CTRL1: TIMER3_RST Mask        */
#define RGU_RESET_CTRL1_RITIMER_RST_Pos       4                                                       /*!< RGU RESET_CTRL1: RITIMER_RST Position   */
#define RGU_RESET_CTRL1_RITIMER_RST_Msk       (0x01UL << RGU_RESET_CTRL1_RITIMER_RST_Pos)             /*!< RGU RESET_CTRL1: RITIMER_RST Mask       */
#define RGU_RESET_CTRL1_SCT_RST_Pos           5                                                       /*!< RGU RESET_CTRL1: SCT_RST Position       */
#define RGU_RESET_CTRL1_SCT_RST_Msk           (0x01UL << RGU_RESET_CTRL1_SCT_RST_Pos)                 /*!< RGU RESET_CTRL1: SCT_RST Mask           */
#define RGU_RESET_CTRL1_MOTOCONPWM_RST_Pos    6                                                       /*!< RGU RESET_CTRL1: MOTOCONPWM_RST Position */
#define RGU_RESET_CTRL1_MOTOCONPWM_RST_Msk    (0x01UL << RGU_RESET_CTRL1_MOTOCONPWM_RST_Pos)          /*!< RGU RESET_CTRL1: MOTOCONPWM_RST Mask    */
#define RGU_RESET_CTRL1_QEI_RST_Pos           7                                                       /*!< RGU RESET_CTRL1: QEI_RST Position       */
#define RGU_RESET_CTRL1_QEI_RST_Msk           (0x01UL << RGU_RESET_CTRL1_QEI_RST_Pos)                 /*!< RGU RESET_CTRL1: QEI_RST Mask           */
#define RGU_RESET_CTRL1_ADC0_RST_Pos          8                                                       /*!< RGU RESET_CTRL1: ADC0_RST Position      */
#define RGU_RESET_CTRL1_ADC0_RST_Msk          (0x01UL << RGU_RESET_CTRL1_ADC0_RST_Pos)                /*!< RGU RESET_CTRL1: ADC0_RST Mask          */
#define RGU_RESET_CTRL1_ADC1_RST_Pos          9                                                       /*!< RGU RESET_CTRL1: ADC1_RST Position      */
#define RGU_RESET_CTRL1_ADC1_RST_Msk          (0x01UL << RGU_RESET_CTRL1_ADC1_RST_Pos)                /*!< RGU RESET_CTRL1: ADC1_RST Mask          */
#define RGU_RESET_CTRL1_DAC_RST_Pos           10                                                      /*!< RGU RESET_CTRL1: DAC_RST Position       */
#define RGU_RESET_CTRL1_DAC_RST_Msk           (0x01UL << RGU_RESET_CTRL1_DAC_RST_Pos)                 /*!< RGU RESET_CTRL1: DAC_RST Mask           */
#define RGU_RESET_CTRL1_UART0_RST_Pos         12                                                      /*!< RGU RESET_CTRL1: UART0_RST Position     */
#define RGU_RESET_CTRL1_UART0_RST_Msk         (0x01UL << RGU_RESET_CTRL1_UART0_RST_Pos)               /*!< RGU RESET_CTRL1: UART0_RST Mask         */
#define RGU_RESET_CTRL1_UART1_RST_Pos         13                                                      /*!< RGU RESET_CTRL1: UART1_RST Position     */
#define RGU_RESET_CTRL1_UART1_RST_Msk         (0x01UL << RGU_RESET_CTRL1_UART1_RST_Pos)               /*!< RGU RESET_CTRL1: UART1_RST Mask         */
#define RGU_RESET_CTRL1_UART2_RST_Pos         14                                                      /*!< RGU RESET_CTRL1: UART2_RST Position     */
#define RGU_RESET_CTRL1_UART2_RST_Msk         (0x01UL << RGU_RESET_CTRL1_UART2_RST_Pos)               /*!< RGU RESET_CTRL1: UART2_RST Mask         */
#define RGU_RESET_CTRL1_UART3_RST_Pos         15                                                      /*!< RGU RESET_CTRL1: UART3_RST Position     */
#define RGU_RESET_CTRL1_UART3_RST_Msk         (0x01UL << RGU_RESET_CTRL1_UART3_RST_Pos)               /*!< RGU RESET_CTRL1: UART3_RST Mask         */
#define RGU_RESET_CTRL1_I2C0_RST_Pos          16                                                      /*!< RGU RESET_CTRL1: I2C0_RST Position      */
#define RGU_RESET_CTRL1_I2C0_RST_Msk          (0x01UL << RGU_RESET_CTRL1_I2C0_RST_Pos)                /*!< RGU RESET_CTRL1: I2C0_RST Mask          */
#define RGU_RESET_CTRL1_I2C1_RST_Pos          17                                                      /*!< RGU RESET_CTRL1: I2C1_RST Position      */
#define RGU_RESET_CTRL1_I2C1_RST_Msk          (0x01UL << RGU_RESET_CTRL1_I2C1_RST_Pos)                /*!< RGU RESET_CTRL1: I2C1_RST Mask          */
#define RGU_RESET_CTRL1_SSP0_RST_Pos          18                                                      /*!< RGU RESET_CTRL1: SSP0_RST Position      */
#define RGU_RESET_CTRL1_SSP0_RST_Msk          (0x01UL << RGU_RESET_CTRL1_SSP0_RST_Pos)                /*!< RGU RESET_CTRL1: SSP0_RST Mask          */
#define RGU_RESET_CTRL1_SSP1_RST_Pos          19                                                      /*!< RGU RESET_CTRL1: SSP1_RST Position      */
#define RGU_RESET_CTRL1_SSP1_RST_Msk          (0x01UL << RGU_RESET_CTRL1_SSP1_RST_Pos)                /*!< RGU RESET_CTRL1: SSP1_RST Mask          */
#define RGU_RESET_CTRL1_I2S_RST_Pos           20                                                      /*!< RGU RESET_CTRL1: I2S_RST Position       */
#define RGU_RESET_CTRL1_I2S_RST_Msk           (0x01UL << RGU_RESET_CTRL1_I2S_RST_Pos)                 /*!< RGU RESET_CTRL1: I2S_RST Mask           */
#define RGU_RESET_CTRL1_SPIFI_RST_Pos         21                                                      /*!< RGU RESET_CTRL1: SPIFI_RST Position     */
#define RGU_RESET_CTRL1_SPIFI_RST_Msk         (0x01UL << RGU_RESET_CTRL1_SPIFI_RST_Pos)               /*!< RGU RESET_CTRL1: SPIFI_RST Mask         */
#define RGU_RESET_CTRL1_CAN1_RST_Pos          22                                                      /*!< RGU RESET_CTRL1: CAN1_RST Position      */
#define RGU_RESET_CTRL1_CAN1_RST_Msk          (0x01UL << RGU_RESET_CTRL1_CAN1_RST_Pos)                /*!< RGU RESET_CTRL1: CAN1_RST Mask          */
#define RGU_RESET_CTRL1_CAN0_RST_Pos          23                                                      /*!< RGU RESET_CTRL1: CAN0_RST Position      */
#define RGU_RESET_CTRL1_CAN0_RST_Msk          (0x01UL << RGU_RESET_CTRL1_CAN0_RST_Pos)                /*!< RGU RESET_CTRL1: CAN0_RST Mask          */
#define RGU_RESET_CTRL1_M0APP_RST_Pos         24                                                      /*!< RGU RESET_CTRL1: M0APP_RST Position     */
#define RGU_RESET_CTRL1_M0APP_RST_Msk         (0x01UL << RGU_RESET_CTRL1_M0APP_RST_Pos)               /*!< RGU RESET_CTRL1: M0APP_RST Mask         */
#define RGU_RESET_CTRL1_SGPIO_RST_Pos         25                                                      /*!< RGU RESET_CTRL1: SGPIO_RST Position     */
#define RGU_RESET_CTRL1_SGPIO_RST_Msk         (0x01UL << RGU_RESET_CTRL1_SGPIO_RST_Pos)               /*!< RGU RESET_CTRL1: SGPIO_RST Mask         */
#define RGU_RESET_CTRL1_SPI_RST_Pos           26                                                      /*!< RGU RESET_CTRL1: SPI_RST Position       */
#define RGU_RESET_CTRL1_SPI_RST_Msk           (0x01UL << RGU_RESET_CTRL1_SPI_RST_Pos)                 /*!< RGU RESET_CTRL1: SPI_RST Mask           */
#define RGU_RESET_CTRL1_ADCHS_RST_Pos         28                                                      /*!< RGU RESET_CTRL1: ADCHS_RST Position     */
#define RGU_RESET_CTRL1_ADCHS_RST_Msk         (0x01UL << RGU_RESET_CTRL1_ADCHS_RST_Pos)               /*!< RGU RESET_CTRL1: ADCHS_RST Mask         */

/* ------------------------------  RGU_RESET_STATUS0  ----------------------------- */
#define RGU_RESET_STATUS0_PERIPH_RST_Pos      2                                                       /*!< RGU RESET_STATUS0: PERIPH_RST Position  */
#define RGU_RESET_STATUS0_PERIPH_RST_Msk      (0x03UL << RGU_RESET_STATUS0_PERIPH_RST_Pos)            /*!< RGU RESET_STATUS0: PERIPH_RST Mask      */
#define RGU_RESET_STATUS0_MASTER_RST_Pos      4                                                       /*!< RGU RESET_STATUS0: MASTER_RST Position  */
#define RGU_RESET_STATUS0_MASTER_RST_Msk      (0x03UL << RGU_RESET_STATUS0_MASTER_RST_Pos)            /*!< RGU RESET_STATUS0: MASTER_RST Mask      */
#define RGU_RESET_STATUS0_WWDT_RST_Pos        8                                                       /*!< RGU RESET_STATUS0: WWDT_RST Position    */
#define RGU_RESET_STATUS0_WWDT_RST_Msk        (0x03UL << RGU_RESET_STATUS0_WWDT_RST_Pos)              /*!< RGU RESET_STATUS0: WWDT_RST Mask        */
#define RGU_RESET_STATUS0_CREG_RST_Pos        10                                                      /*!< RGU RESET_STATUS0: CREG_RST Position    */
#define RGU_RESET_STATUS0_CREG_RST_Msk        (0x03UL << RGU_RESET_STATUS0_CREG_RST_Pos)              /*!< RGU RESET_STATUS0: CREG_RST Mask        */
#define RGU_RESET_STATUS0_BUS_RST_Pos         16                                                      /*!< RGU RESET_STATUS0: BUS_RST Position     */
#define RGU_RESET_STATUS0_BUS_RST_Msk         (0x03UL << RGU_RESET_STATUS0_BUS_RST_Pos)               /*!< RGU RESET_STATUS0: BUS_RST Mask         */
#define RGU_RESET_STATUS0_SCU_RST_Pos         18                                                      /*!< RGU RESET_STATUS0: SCU_RST Position     */
#define RGU_RESET_STATUS0_SCU_RST_Msk         (0x03UL << RGU_RESET_STATUS0_SCU_RST_Pos)               /*!< RGU RESET_STATUS0: SCU_RST Mask         */
#define RGU_RESET_STATUS0_M0SUB_RST_Pos       24                                                      /*!< RGU RESET_STATUS0: M0SUB_RST Position   */
#define RGU_RESET_STATUS0_M0SUB_RST_Msk       (0x03UL << RGU_RESET_STATUS0_M0SUB_RST_Pos)             /*!< RGU RESET_STATUS0: M0SUB_RST Mask       */
#define RGU_RESET_STATUS0_M4_RST_Pos          26                                                      /*!< RGU RESET_STATUS0: M4_RST Position      */
#define RGU_RESET_STATUS0_M4_RST_Msk          (0x03UL << RGU_RESET_STATUS0_M4_RST_Pos)                /*!< RGU RESET_STATUS0: M4_RST Mask          */

/* ------------------------------  RGU_RESET_STATUS1  ----------------------------- */
#define RGU_RESET_STATUS1_LCD_RST_Pos         0                                                       /*!< RGU RESET_STATUS1: LCD_RST Position     */
#define RGU_RESET_STATUS1_LCD_RST_Msk         (0x03UL << RGU_RESET_STATUS1_LCD_RST_Pos)               /*!< RGU RESET_STATUS1: LCD_RST Mask         */
#define RGU_RESET_STATUS1_USB0_RST_Pos        2                                                       /*!< RGU RESET_STATUS1: USB0_RST Position    */
#define RGU_RESET_STATUS1_USB0_RST_Msk        (0x03UL << RGU_RESET_STATUS1_USB0_RST_Pos)              /*!< RGU RESET_STATUS1: USB0_RST Mask        */
#define RGU_RESET_STATUS1_USB1_RST_Pos        4                                                       /*!< RGU RESET_STATUS1: USB1_RST Position    */
#define RGU_RESET_STATUS1_USB1_RST_Msk        (0x03UL << RGU_RESET_STATUS1_USB1_RST_Pos)              /*!< RGU RESET_STATUS1: USB1_RST Mask        */
#define RGU_RESET_STATUS1_DMA_RST_Pos         6                                                       /*!< RGU RESET_STATUS1: DMA_RST Position     */
#define RGU_RESET_STATUS1_DMA_RST_Msk         (0x03UL << RGU_RESET_STATUS1_DMA_RST_Pos)               /*!< RGU RESET_STATUS1: DMA_RST Mask         */
#define RGU_RESET_STATUS1_SDIO_RST_Pos        8                                                       /*!< RGU RESET_STATUS1: SDIO_RST Position    */
#define RGU_RESET_STATUS1_SDIO_RST_Msk        (0x03UL << RGU_RESET_STATUS1_SDIO_RST_Pos)              /*!< RGU RESET_STATUS1: SDIO_RST Mask        */
#define RGU_RESET_STATUS1_EMC_RST_Pos         10                                                      /*!< RGU RESET_STATUS1: EMC_RST Position     */
#define RGU_RESET_STATUS1_EMC_RST_Msk         (0x03UL << RGU_RESET_STATUS1_EMC_RST_Pos)               /*!< RGU RESET_STATUS1: EMC_RST Mask         */
#define RGU_RESET_STATUS1_ETHERNET_RST_Pos    12                                                      /*!< RGU RESET_STATUS1: ETHERNET_RST Position */
#define RGU_RESET_STATUS1_ETHERNET_RST_Msk    (0x03UL << RGU_RESET_STATUS1_ETHERNET_RST_Pos)          /*!< RGU RESET_STATUS1: ETHERNET_RST Mask    */
#define RGU_RESET_STATUS1_FLASHA_RST_Pos      18                                                      /*!< RGU RESET_STATUS1: FLASHA_RST Position  */
#define RGU_RESET_STATUS1_FLASHA_RST_Msk      (0x03UL << RGU_RESET_STATUS1_FLASHA_RST_Pos)            /*!< RGU RESET_STATUS1: FLASHA_RST Mask      */
#define RGU_RESET_STATUS1_EEPROM_RST_Pos      22                                                      /*!< RGU RESET_STATUS1: EEPROM_RST Position  */
#define RGU_RESET_STATUS1_EEPROM_RST_Msk      (0x03UL << RGU_RESET_STATUS1_EEPROM_RST_Pos)            /*!< RGU RESET_STATUS1: EEPROM_RST Mask      */
#define RGU_RESET_STATUS1_GPIO_RST_Pos        24                                                      /*!< RGU RESET_STATUS1: GPIO_RST Position    */
#define RGU_RESET_STATUS1_GPIO_RST_Msk        (0x03UL << RGU_RESET_STATUS1_GPIO_RST_Pos)              /*!< RGU RESET_STATUS1: GPIO_RST Mask        */
#define RGU_RESET_STATUS1_FLASHB_RST_Pos      26                                                      /*!< RGU RESET_STATUS1: FLASHB_RST Position  */
#define RGU_RESET_STATUS1_FLASHB_RST_Msk      (0x03UL << RGU_RESET_STATUS1_FLASHB_RST_Pos)            /*!< RGU RESET_STATUS1: FLASHB_RST Mask      */

/* ------------------------------  RGU_RESET_STATUS2  ----------------------------- */
#define RGU_RESET_STATUS2_TIMER0_RST_Pos      0                                                       /*!< RGU RESET_STATUS2: TIMER0_RST Position  */
#define RGU_RESET_STATUS2_TIMER0_RST_Msk      (0x03UL << RGU_RESET_STATUS2_TIMER0_RST_Pos)            /*!< RGU RESET_STATUS2: TIMER0_RST Mask      */
#define RGU_RESET_STATUS2_TIMER1_RST_Pos      2                                                       /*!< RGU RESET_STATUS2: TIMER1_RST Position  */
#define RGU_RESET_STATUS2_TIMER1_RST_Msk      (0x03UL << RGU_RESET_STATUS2_TIMER1_RST_Pos)            /*!< RGU RESET_STATUS2: TIMER1_RST Mask      */
#define RGU_RESET_STATUS2_TIMER2_RST_Pos      4                                                       /*!< RGU RESET_STATUS2: TIMER2_RST Position  */
#define RGU_RESET_STATUS2_TIMER2_RST_Msk      (0x03UL << RGU_RESET_STATUS2_TIMER2_RST_Pos)            /*!< RGU RESET_STATUS2: TIMER2_RST Mask      */
#define RGU_RESET_STATUS2_TIMER3_RST_Pos      6                                                       /*!< RGU RESET_STATUS2: TIMER3_RST Position  */
#define RGU_RESET_STATUS2_TIMER3_RST_Msk      (0x03UL << RGU_RESET_STATUS2_TIMER3_RST_Pos)            /*!< RGU RESET_STATUS2: TIMER3_RST Mask      */
#define RGU_RESET_STATUS2_RITIMER_RST_Pos     8                                                       /*!< RGU RESET_STATUS2: RITIMER_RST Position */
#define RGU_RESET_STATUS2_RITIMER_RST_Msk     (0x03UL << RGU_RESET_STATUS2_RITIMER_RST_Pos)           /*!< RGU RESET_STATUS2: RITIMER_RST Mask     */
#define RGU_RESET_STATUS2_SCT_RST_Pos         10                                                      /*!< RGU RESET_STATUS2: SCT_RST Position     */
#define RGU_RESET_STATUS2_SCT_RST_Msk         (0x03UL << RGU_RESET_STATUS2_SCT_RST_Pos)               /*!< RGU RESET_STATUS2: SCT_RST Mask         */
#define RGU_RESET_STATUS2_MOTOCONPWM_RST_Pos  12                                                      /*!< RGU RESET_STATUS2: MOTOCONPWM_RST Position */
#define RGU_RESET_STATUS2_MOTOCONPWM_RST_Msk  (0x03UL << RGU_RESET_STATUS2_MOTOCONPWM_RST_Pos)        /*!< RGU RESET_STATUS2: MOTOCONPWM_RST Mask  */
#define RGU_RESET_STATUS2_QEI_RST_Pos         14                                                      /*!< RGU RESET_STATUS2: QEI_RST Position     */
#define RGU_RESET_STATUS2_QEI_RST_Msk         (0x03UL << RGU_RESET_STATUS2_QEI_RST_Pos)               /*!< RGU RESET_STATUS2: QEI_RST Mask         */
#define RGU_RESET_STATUS2_ADC0_RST_Pos        16                                                      /*!< RGU RESET_STATUS2: ADC0_RST Position    */
#define RGU_RESET_STATUS2_ADC0_RST_Msk        (0x03UL << RGU_RESET_STATUS2_ADC0_RST_Pos)              /*!< RGU RESET_STATUS2: ADC0_RST Mask        */
#define RGU_RESET_STATUS2_ADC1_RST_Pos        18                                                      /*!< RGU RESET_STATUS2: ADC1_RST Position    */
#define RGU_RESET_STATUS2_ADC1_RST_Msk        (0x03UL << RGU_RESET_STATUS2_ADC1_RST_Pos)              /*!< RGU RESET_STATUS2: ADC1_RST Mask        */
#define RGU_RESET_STATUS2_DAC_RST_Pos         20                                                      /*!< RGU RESET_STATUS2: DAC_RST Position     */
#define RGU_RESET_STATUS2_DAC_RST_Msk         (0x03UL << RGU_RESET_STATUS2_DAC_RST_Pos)               /*!< RGU RESET_STATUS2: DAC_RST Mask         */
#define RGU_RESET_STATUS2_UART0_RST_Pos       24                                                      /*!< RGU RESET_STATUS2: UART0_RST Position   */
#define RGU_RESET_STATUS2_UART0_RST_Msk       (0x03UL << RGU_RESET_STATUS2_UART0_RST_Pos)             /*!< RGU RESET_STATUS2: UART0_RST Mask       */
#define RGU_RESET_STATUS2_UART1_RST_Pos       26                                                      /*!< RGU RESET_STATUS2: UART1_RST Position   */
#define RGU_RESET_STATUS2_UART1_RST_Msk       (0x03UL << RGU_RESET_STATUS2_UART1_RST_Pos)             /*!< RGU RESET_STATUS2: UART1_RST Mask       */
#define RGU_RESET_STATUS2_UART2_RST_Pos       28                                                      /*!< RGU RESET_STATUS2: UART2_RST Position   */
#define RGU_RESET_STATUS2_UART2_RST_Msk       (0x03UL << RGU_RESET_STATUS2_UART2_RST_Pos)             /*!< RGU RESET_STATUS2: UART2_RST Mask       */
#define RGU_RESET_STATUS2_UART3_RST_Pos       30                                                      /*!< RGU RESET_STATUS2: UART3_RST Position   */
#define RGU_RESET_STATUS2_UART3_RST_Msk       (0x03UL << RGU_RESET_STATUS2_UART3_RST_Pos)             /*!< RGU RESET_STATUS2: UART3_RST Mask       */

/* ------------------------------  RGU_RESET_STATUS3  ----------------------------- */
#define RGU_RESET_STATUS3_I2C0_RST_Pos        0                                                       /*!< RGU RESET_STATUS3: I2C0_RST Position    */
#define RGU_RESET_STATUS3_I2C0_RST_Msk        (0x03UL << RGU_RESET_STATUS3_I2C0_RST_Pos)              /*!< RGU RESET_STATUS3: I2C0_RST Mask        */
#define RGU_RESET_STATUS3_I2C1_RST_Pos        2                                                       /*!< RGU RESET_STATUS3: I2C1_RST Position    */
#define RGU_RESET_STATUS3_I2C1_RST_Msk        (0x03UL << RGU_RESET_STATUS3_I2C1_RST_Pos)              /*!< RGU RESET_STATUS3: I2C1_RST Mask        */
#define RGU_RESET_STATUS3_SSP0_RST_Pos        4                                                       /*!< RGU RESET_STATUS3: SSP0_RST Position    */
#define RGU_RESET_STATUS3_SSP0_RST_Msk        (0x03UL << RGU_RESET_STATUS3_SSP0_RST_Pos)              /*!< RGU RESET_STATUS3: SSP0_RST Mask        */
#define RGU_RESET_STATUS3_SSP1_RST_Pos        6                                                       /*!< RGU RESET_STATUS3: SSP1_RST Position    */
#define RGU_RESET_STATUS3_SSP1_RST_Msk        (0x03UL << RGU_RESET_STATUS3_SSP1_RST_Pos)              /*!< RGU RESET_STATUS3: SSP1_RST Mask        */
#define RGU_RESET_STATUS3_I2S_RST_Pos         8                                                       /*!< RGU RESET_STATUS3: I2S_RST Position     */
#define RGU_RESET_STATUS3_I2S_RST_Msk         (0x03UL << RGU_RESET_STATUS3_I2S_RST_Pos)               /*!< RGU RESET_STATUS3: I2S_RST Mask         */
#define RGU_RESET_STATUS3_SPIFI_RST_Pos       10                                                      /*!< RGU RESET_STATUS3: SPIFI_RST Position   */
#define RGU_RESET_STATUS3_SPIFI_RST_Msk       (0x03UL << RGU_RESET_STATUS3_SPIFI_RST_Pos)             /*!< RGU RESET_STATUS3: SPIFI_RST Mask       */
#define RGU_RESET_STATUS3_CAN1_RST_Pos        12                                                      /*!< RGU RESET_STATUS3: CAN1_RST Position    */
#define RGU_RESET_STATUS3_CAN1_RST_Msk        (0x03UL << RGU_RESET_STATUS3_CAN1_RST_Pos)              /*!< RGU RESET_STATUS3: CAN1_RST Mask        */
#define RGU_RESET_STATUS3_CAN0_RST_Pos        14                                                      /*!< RGU RESET_STATUS3: CAN0_RST Position    */
#define RGU_RESET_STATUS3_CAN0_RST_Msk        (0x03UL << RGU_RESET_STATUS3_CAN0_RST_Pos)              /*!< RGU RESET_STATUS3: CAN0_RST Mask        */
#define RGU_RESET_STATUS3_M0APP_RST_Pos       16                                                      /*!< RGU RESET_STATUS3: M0APP_RST Position   */
#define RGU_RESET_STATUS3_M0APP_RST_Msk       (0x03UL << RGU_RESET_STATUS3_M0APP_RST_Pos)             /*!< RGU RESET_STATUS3: M0APP_RST Mask       */
#define RGU_RESET_STATUS3_SGPIO_RST_Pos       18                                                      /*!< RGU RESET_STATUS3: SGPIO_RST Position   */
#define RGU_RESET_STATUS3_SGPIO_RST_Msk       (0x03UL << RGU_RESET_STATUS3_SGPIO_RST_Pos)             /*!< RGU RESET_STATUS3: SGPIO_RST Mask       */
#define RGU_RESET_STATUS3_SPI_RST_Pos         20                                                      /*!< RGU RESET_STATUS3: SPI_RST Position     */
#define RGU_RESET_STATUS3_SPI_RST_Msk         (0x03UL << RGU_RESET_STATUS3_SPI_RST_Pos)               /*!< RGU RESET_STATUS3: SPI_RST Mask         */
#define RGU_RESET_STATUS3_ADCHS_RST_Pos       24                                                      /*!< RGU RESET_STATUS3: ADCHS_RST Position   */
#define RGU_RESET_STATUS3_ADCHS_RST_Msk       (0x03UL << RGU_RESET_STATUS3_ADCHS_RST_Pos)             /*!< RGU RESET_STATUS3: ADCHS_RST Mask       */

