MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* --------------------------  RGU_RESET_ACTIVE_STATUS1  -------------------------- */
#define RGU_RESET_ACTIVE_STATUS1_TIMER0_RST_Pos 0                                                     /*!< RGU RESET_ACTIVE_STATUS1: TIMER0_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_TIMER0_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_TIMER0_RST_Pos)   /*!< RGU RESET_ACTIVE_STATUS1: TIMER0_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_TIMER1_RST_Pos 1                                                     /*!< RGU RESET_ACTIVE_STATUS1: TIMER1_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_TIMER1_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_TIMER1_RST_Pos)   /*!< RGU RESET_ACTIVE_STATUS1: TIMER1_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_TIMER2_RST_Pos 2                                                     /*!< RGU RESET_ACTIVE_STATUS1: TIMER2_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_TIMER2_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_TIMER2_RST_Pos)   /*!< RGU RESET_ACTIVE_STATUS1: TIMER2_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_TIMER3_RST_Pos 3                                                     /*!< RGU RESET_ACTIVE_STATUS1: TIMER3_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_TIMER3_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_TIMER3_RST_Pos)   /*!< RGU RESET_ACTIVE_STATUS1: TIMER3_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_RITIMER_RST_Pos 4                                                    /*!< RGU RESET_ACTIVE_STATUS1: RITIMER_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_RITIMER_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_RITIMER_RST_Pos) /*!< RGU RESET_ACTIVE_STATUS1: RITIMER_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_SCT_RST_Pos  5                                                       /*!< RGU RESET_ACTIVE_STATUS1: SCT_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_SCT_RST_Msk  (0x01UL << RGU_RESET_ACTIVE_STATUS1_SCT_RST_Pos)        /*!< RGU RESET_ACTIVE_STATUS1: SCT_RST Mask  */
#define RGU_RESET_ACTIVE_STATUS1_MOTOCONPWM_RST_Pos 6                                                 /*!< RGU RESET_ACTIVE_STATUS1: MOTOCONPWM_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_MOTOCONPWM_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_MOTOCONPWM_RST_Pos)/*!< RGU RESET_ACTIVE_STATUS1: MOTOCONPWM_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_QEI_RST_Pos  7                                                       /*!< RGU RESET_ACTIVE_STATUS1: QEI_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_QEI_RST_Msk  (0x01UL << RGU_RESET_ACTIVE_STATUS1_QEI_RST_Pos)        /*!< RGU RESET_ACTIVE_STATUS1: QEI_RST Mask  */
#define RGU_RESET_ACTIVE_STATUS1_ADC0_RST_Pos 8                                                       /*!< RGU RESET_ACTIVE_STATUS1: ADC0_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_ADC0_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_ADC0_RST_Pos)       /*!< RGU RESET_ACTIVE_STATUS1: ADC0_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_ADC1_RST_Pos 9                                                       /*!< RGU RESET_ACTIVE_STATUS1: ADC1_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_ADC1_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_ADC1_RST_Pos)       /*!< RGU RESET_ACTIVE_STATUS1: ADC1_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_DAC_RST_Pos  10                                                      /*!< RGU RESET_ACTIVE_STATUS1: DAC_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_DAC_RST_Msk  (0x01UL << RGU_RESET_ACTIVE_STATUS1_DAC_RST_Pos)        /*!< RGU RESET_ACTIVE_STATUS1: DAC_RST Mask  */
#define RGU_RESET_ACTIVE_STATUS1_UART0_RST_Pos 12                                                     /*!< RGU RESET_ACTIVE_STATUS1: UART0_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_UART0_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_UART0_RST_Pos)     /*!< RGU RESET_ACTIVE_STATUS1: UART0_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_UART1_RST_Pos 13                                                     /*!< RGU RESET_ACTIVE_STATUS1: UART1_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_UART1_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_UART1_RST_Pos)     /*!< RGU RESET_ACTIVE_STATUS1: UART1_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_UART2_RST_Pos 14                                                     /*!< RGU RESET_ACTIVE_STATUS1: UART2_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_UART2_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_UART2_RST_Pos)     /*!< RGU RESET_ACTIVE_STATUS1: UART2_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_UART3_RST_Pos 15                                                     /*!< RGU RESET_ACTIVE_STATUS1: UART3_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_UART3_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_UART3_RST_Pos)     /*!< RGU RESET_ACTIVE_STATUS1: UART3_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_I2C0_RST_Pos 16                                                      /*!< RGU RESET_ACTIVE_STATUS1: I2C0_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_I2C0_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_I2C0_RST_Pos)       /*!< RGU RESET_ACTIVE_STATUS1: I2C0_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_I2C1_RST_Pos 17                                                      /*!< RGU RESET_ACTIVE_STATUS1: I2C1_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_I2C1_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_I2C1_RST_Pos)       /*!< RGU RESET_ACTIVE_STATUS1: I2C1_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_SSP0_RST_Pos 18                                                      /*!< RGU RESET_ACTIVE_STATUS1: SSP0_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_SSP0_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_SSP0_RST_Pos)       /*!< RGU RESET_ACTIVE_STATUS1: SSP0_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_SSP1_RST_Pos 19                                                      /*!< RGU RESET_ACTIVE_STATUS1: SSP1_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_SSP1_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_SSP1_RST_Pos)       /*!< RGU RESET_ACTIVE_STATUS1: SSP1_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_I2S_RST_Pos  20                                                      /*!< RGU RESET_ACTIVE_STATUS1: I2S_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_I2S_RST_Msk  (0x01UL << RGU_RESET_ACTIVE_STATUS1_I2S_RST_Pos)        /*!< RGU RESET_ACTIVE_STATUS1: I2S_RST Mask  */
#define RGU_RESET_ACTIVE_STATUS1_SPIFI_RST_Pos 21                                                     /*!< RGU RESET_ACTIVE_STATUS1: SPIFI_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_SPIFI_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_SPIFI_RST_Pos)     /*!< RGU RESET_ACTIVE_STATUS1: SPIFI_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_CAN1_RST_Pos 22                                                      /*!< RGU RESET_ACTIVE_STATUS1: CAN1_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_CAN1_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_CAN1_RST_Pos)       /*!< RGU RESET_ACTIVE_STATUS1: CAN1_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_CAN0_RST_Pos 23                                                      /*!< RGU RESET_ACTIVE_STATUS1: CAN0_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_CAN0_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_CAN0_RST_Pos)       /*!< RGU RESET_ACTIVE_STATUS1: CAN0_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_M0APP_RST_Pos 24                                                     /*!< RGU RESET_ACTIVE_STATUS1: M0APP_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_M0APP_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_M0APP_RST_Pos)     /*!< RGU RESET_ACTIVE_STATUS1: M0APP_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_SGPIO_RST_Pos 25                                                     /*!< RGU RESET_ACTIVE_STATUS1: SGPIO_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_SGPIO_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_SGPIO_RST_Pos)     /*!< RGU RESET_ACTIVE_STATUS1: SGPIO_RST Mask */
#define RGU_RESET_ACTIVE_STATUS1_SPI_RST_Pos  26                                                      /*!< RGU RESET_ACTIVE_STATUS1: SPI_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_SPI_RST_Msk  (0x01UL << RGU_RESET_ACTIVE_STATUS1_SPI_RST_Pos)        /*!< RGU RESET_ACTIVE_STATUS1: SPI_RST Mask  */
#define RGU_RESET_ACTIVE_STATUS1_ADCHS_RST_Pos 28                                                     /*!< RGU RESET_ACTIVE_STATUS1: ADCHS_RST Position */
#define RGU_RESET_ACTIVE_STATUS1_ADCHS_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS1_ADCHS_RST_Pos)     /*!< RGU RESET_ACTIVE_STATUS1: ADCHS_RST Mask */

/* -----------------------------  RGU_RESET_EXT_STAT1  ---------------------------- */
#define RGU_RESET_EXT_STAT1_CORE_RESET_Pos    1                                                       /*!< RGU RESET_EXT_STAT1: CORE_RESET Position */
#define RGU_RESET_EXT_STAT1_CORE_RESET_Msk    (0x01UL << RGU_RESET_EXT_STAT1_CORE_RESET_Pos)          /*!< RGU RESET_EXT_STAT1: CORE_RESET Mask    */

