MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ----------------------------  RGU_RESET_EXT_STAT33  ---------------------------- */
#define RGU_RESET_EXT_STAT33_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT33: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT33_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT33_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT33: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT34  ---------------------------- */
#define RGU_RESET_EXT_STAT34_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT34: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT34_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT34_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT34: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT35  ---------------------------- */
#define RGU_RESET_EXT_STAT35_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT35: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT35_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT35_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT35: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT36  ---------------------------- */
#define RGU_RESET_EXT_STAT36_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT36: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT36_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT36_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT36: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT37  ---------------------------- */
#define RGU_RESET_EXT_STAT37_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT37: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT37_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT37_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT37: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT38  ---------------------------- */
#define RGU_RESET_EXT_STAT38_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT38: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT38_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT38_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT38: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT39  ---------------------------- */
#define RGU_RESET_EXT_STAT39_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT39: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT39_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT39_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT39: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT40  ---------------------------- */
#define RGU_RESET_EXT_STAT40_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT40: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT40_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT40_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT40: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT41  ---------------------------- */
#define RGU_RESET_EXT_STAT41_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT41: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT41_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT41_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT41: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT42  ---------------------------- */
#define RGU_RESET_EXT_STAT42_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT42: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT42_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT42_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT42: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT44  ---------------------------- */
#define RGU_RESET_EXT_STAT44_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT44: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT44_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT44_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT44: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT45  ---------------------------- */
#define RGU_RESET_EXT_STAT45_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT45: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT45_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT45_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT45: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT46  ---------------------------- */
#define RGU_RESET_EXT_STAT46_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT46: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT46_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT46_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT46: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT47  ---------------------------- */
#define RGU_RESET_EXT_STAT47_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT47: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT47_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT47_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT47: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT48  ---------------------------- */
#define RGU_RESET_EXT_STAT48_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT48: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT48_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT48_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT48: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT49  ---------------------------- */
#define RGU_RESET_EXT_STAT49_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT49: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT49_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT49_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT49: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT50  ---------------------------- */
#define RGU_RESET_EXT_STAT50_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT50: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT50_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT50_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT50: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT51  ---------------------------- */
#define RGU_RESET_EXT_STAT51_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT51: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT51_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT51_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT51: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT52  ---------------------------- */
#define RGU_RESET_EXT_STAT52_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT52: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT52_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT52_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT52: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT53  ---------------------------- */
#define RGU_RESET_EXT_STAT53_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT53: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT53_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT53_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT53: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT54  ---------------------------- */
#define RGU_RESET_EXT_STAT54_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT54: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT54_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT54_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT54: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT55  ---------------------------- */
#define RGU_RESET_EXT_STAT55_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT55: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT55_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT55_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT55: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT56  ---------------------------- */
#define RGU_RESET_EXT_STAT56_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT56: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT56_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT56_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT56: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT57  ---------------------------- */
#define RGU_RESET_EXT_STAT57_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT57: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT57_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT57_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT57: PERIPHERAL_RESET Mask */

