MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  USARTn_FDR  --------------------------------- */
#define USARTn_FDR_DIVADDVAL_Pos              0                                                       /*!< USARTn FDR: DIVADDVAL Position          */
#define USARTn_FDR_DIVADDVAL_Msk              (0x0fUL << USARTn_FDR_DIVADDVAL_Pos)                    /*!< USARTn FDR: DIVADDVAL Mask              */
#define USARTn_FDR_MULVAL_Pos                 4                                                       /*!< USARTn FDR: MULVAL Position             */
#define USARTn_FDR_MULVAL_Msk                 (0x0fUL << USARTn_FDR_MULVAL_Pos)                       /*!< USARTn FDR: MULVAL Mask                 */

/* ---------------------------------  USARTn_OSR  --------------------------------- */
#define USARTn_OSR_OSFRAC_Pos                 1                                                       /*!< USARTn OSR: OSFRAC Position             */
#define USARTn_OSR_OSFRAC_Msk                 (0x07UL << USARTn_OSR_OSFRAC_Pos)                       /*!< USARTn OSR: OSFRAC Mask                 */
#define USARTn_OSR_OSINT_Pos                  4                                                       /*!< USARTn OSR: OSINT Position              */
#define USARTn_OSR_OSINT_Msk                  (0x0fUL << USARTn_OSR_OSINT_Pos)                        /*!< USARTn OSR: OSINT Mask                  */
#define USARTn_OSR_FDINT_Pos                  8                                                       /*!< USARTn OSR: FDINT Position              */
#define USARTn_OSR_FDINT_Msk                  (0x7fUL << USARTn_OSR_FDINT_Pos)                        /*!< USARTn OSR: FDINT Mask                  */

/* ---------------------------------  USARTn_HDEN  -------------------------------- */
#define USARTn_HDEN_HDEN_Pos                  0                                                       /*!< USARTn HDEN: HDEN Position              */
#define USARTn_HDEN_HDEN_Msk                  (0x01UL << USARTn_HDEN_HDEN_Pos)                        /*!< USARTn HDEN: HDEN Mask                  */

/* -------------------------------  USARTn_SCICTRL  ------------------------------- */
#define USARTn_SCICTRL_SCIEN_Pos              0                                                       /*!< USARTn SCICTRL: SCIEN Position          */
#define USARTn_SCICTRL_SCIEN_Msk              (0x01UL << USARTn_SCICTRL_SCIEN_Pos)                    /*!< USARTn SCICTRL: SCIEN Mask              */
#define USARTn_SCICTRL_NACKDIS_Pos            1                                                       /*!< USARTn SCICTRL: NACKDIS Position        */
#define USARTn_SCICTRL_NACKDIS_Msk            (0x01UL << USARTn_SCICTRL_NACKDIS_Pos)                  /*!< USARTn SCICTRL: NACKDIS Mask            */
#define USARTn_SCICTRL_PROTSEL_Pos            2                                                       /*!< USARTn SCICTRL: PROTSEL Position        */
#define USARTn_SCICTRL_PROTSEL_Msk            (0x01UL << USARTn_SCICTRL_PROTSEL_Pos)                  /*!< USARTn SCICTRL: PROTSEL Mask            */
#define USARTn_SCICTRL_TXRETRY_Pos            5                                                       /*!< USARTn SCICTRL: TXRETRY Position        */
#define USARTn_SCICTRL_TXRETRY_Msk            (0x07UL << USARTn_SCICTRL_TXRETRY_Pos)                  /*!< USARTn SCICTRL: TXRETRY Mask            */
#define USARTn_SCICTRL_GUARDTIME_Pos          8                                                       /*!< USARTn SCICTRL: GUARDTIME Position      */
#define USARTn_SCICTRL_GUARDTIME_Msk          (0x000000ffUL << USARTn_SCICTRL_GUARDTIME_Pos)          /*!< USARTn SCICTRL: GUARDTIME Mask          */

/* ------------------------------  USARTn_RS485CTRL  ------------------------------ */
#define USARTn_RS485CTRL_NMMEN_Pos            0                                                       /*!< USARTn RS485CTRL: NMMEN Position        */
#define USARTn_RS485CTRL_NMMEN_Msk            (0x01UL << USARTn_RS485CTRL_NMMEN_Pos)                  /*!< USARTn RS485CTRL: NMMEN Mask            */
#define USARTn_RS485CTRL_RXDIS_Pos            1                                                       /*!< USARTn RS485CTRL: RXDIS Position        */
#define USARTn_RS485CTRL_RXDIS_Msk            (0x01UL << USARTn_RS485CTRL_RXDIS_Pos)                  /*!< USARTn RS485CTRL: RXDIS Mask            */
#define USARTn_RS485CTRL_AADEN_Pos            2                                                       /*!< USARTn RS485CTRL: AADEN Position        */
#define USARTn_RS485CTRL_AADEN_Msk            (0x01UL << USARTn_RS485CTRL_AADEN_Pos)                  /*!< USARTn RS485CTRL: AADEN Mask            */
#define USARTn_RS485CTRL_DCTRL_Pos            4                                                       /*!< USARTn RS485CTRL: DCTRL Position        */
#define USARTn_RS485CTRL_DCTRL_Msk            (0x01UL << USARTn_RS485CTRL_DCTRL_Pos)                  /*!< USARTn RS485CTRL: DCTRL Mask            */
#define USARTn_RS485CTRL_OINV_Pos             5                                                       /*!< USARTn RS485CTRL: OINV Position         */
#define USARTn_RS485CTRL_OINV_Msk             (0x01UL << USARTn_RS485CTRL_OINV_Pos)                   /*!< USARTn RS485CTRL: OINV Mask             */

/* ----------------------------  USARTn_RS485ADRMATCH  ---------------------------- */
#define USARTn_RS485ADRMATCH_ADRMATCH_Pos     0                                                       /*!< USARTn RS485ADRMATCH: ADRMATCH Position */
#define USARTn_RS485ADRMATCH_ADRMATCH_Msk     (0x000000ffUL << USARTn_RS485ADRMATCH_ADRMATCH_Pos)     /*!< USARTn RS485ADRMATCH: ADRMATCH Mask     */

/* -------------------------------  USARTn_RS485DLY  ------------------------------ */
#define USARTn_RS485DLY_DLY_Pos               0                                                       /*!< USARTn RS485DLY: DLY Position           */
#define USARTn_RS485DLY_DLY_Msk               (0x000000ffUL << USARTn_RS485DLY_DLY_Pos)               /*!< USARTn RS485DLY: DLY Mask               */

/* -------------------------------  USARTn_SYNCCTRL  ------------------------------ */
#define USARTn_SYNCCTRL_SYNC_Pos              0                                                       /*!< USARTn SYNCCTRL: SYNC Position          */
#define USARTn_SYNCCTRL_SYNC_Msk              (0x01UL << USARTn_SYNCCTRL_SYNC_Pos)                    /*!< USARTn SYNCCTRL: SYNC Mask              */
#define USARTn_SYNCCTRL_CSRC_Pos              1                                                       /*!< USARTn SYNCCTRL: CSRC Position          */
#define USARTn_SYNCCTRL_CSRC_Msk              (0x01UL << USARTn_SYNCCTRL_CSRC_Pos)                    /*!< USARTn SYNCCTRL: CSRC Mask              */
#define USARTn_SYNCCTRL_FES_Pos               2                                                       /*!< USARTn SYNCCTRL: FES Position           */
#define USARTn_SYNCCTRL_FES_Msk               (0x01UL << USARTn_SYNCCTRL_FES_Pos)                     /*!< USARTn SYNCCTRL: FES Mask               */
#define USARTn_SYNCCTRL_TSBYPASS_Pos          3                                                       /*!< USARTn SYNCCTRL: TSBYPASS Position      */
#define USARTn_SYNCCTRL_TSBYPASS_Msk          (0x01UL << USARTn_SYNCCTRL_TSBYPASS_Pos)                /*!< USARTn SYNCCTRL: TSBYPASS Mask          */
#define USARTn_SYNCCTRL_CSCEN_Pos             4                                                       /*!< USARTn SYNCCTRL: CSCEN Position         */
#define USARTn_SYNCCTRL_CSCEN_Msk             (0x01UL << USARTn_SYNCCTRL_CSCEN_Pos)                   /*!< USARTn SYNCCTRL: CSCEN Mask             */
#define USARTn_SYNCCTRL_SSSDIS_Pos            5                                                       /*!< USARTn SYNCCTRL: SSSDIS Position        */
#define USARTn_SYNCCTRL_SSSDIS_Msk            (0x01UL << USARTn_SYNCCTRL_SSSDIS_Pos)                  /*!< USARTn SYNCCTRL: SSSDIS Mask            */
#define USARTn_SYNCCTRL_CCCLR_Pos             6                                                       /*!< USARTn SYNCCTRL: CCCLR Position         */
#define USARTn_SYNCCTRL_CCCLR_Msk             (0x01UL << USARTn_SYNCCTRL_CCCLR_Pos)                   /*!< USARTn SYNCCTRL: CCCLR Mask             */

