MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  USARTn_TER  --------------------------------- */
#define USARTn_TER_TXEN_Pos                   0                                                       /*!< USARTn TER: TXEN Position               */
#define USARTn_TER_TXEN_Msk                   (0x01UL << USARTn_TER_TXEN_Pos)                         /*!< USARTn TER: TXEN Mask                   */


/* ================================================================================ */
/* ================         struct 'USART0' Position & Mask        ================ */
/* ================================================================================ */


/* ---------------------------------  USART0_RBR  --------------------------------- */
#define USART0_RBR_RBR_Pos                    0                                                       /*!< USART0 RBR: RBR Position                */
#define USART0_RBR_RBR_Msk                    (0x000000ffUL << USART0_RBR_RBR_Pos)                    /*!< USART0 RBR: RBR Mask                    */

/* ---------------------------------  USART0_THR  --------------------------------- */
#define USART0_THR_THR_Pos                    0                                                       /*!< USART0 THR: THR Position                */
#define USART0_THR_THR_Msk                    (0x000000ffUL << USART0_THR_THR_Pos)                    /*!< USART0 THR: THR Mask                    */

/* ---------------------------------  USART0_DLL  --------------------------------- */
#define USART0_DLL_DLLSB_Pos                  0                                                       /*!< USART0 DLL: DLLSB Position              */
#define USART0_DLL_DLLSB_Msk                  (0x000000ffUL << USART0_DLL_DLLSB_Pos)                  /*!< USART0 DLL: DLLSB Mask                  */

/* ---------------------------------  USART0_DLM  --------------------------------- */
#define USART0_DLM_DLMSB_Pos                  0                                                       /*!< USART0 DLM: DLMSB Position              */
#define USART0_DLM_DLMSB_Msk                  (0x000000ffUL << USART0_DLM_DLMSB_Pos)                  /*!< USART0 DLM: DLMSB Mask                  */

/* ---------------------------------  USART0_IER  --------------------------------- */
#define USART0_IER_RBRIE_Pos                  0                                                       /*!< USART0 IER: RBRIE Position              */
#define USART0_IER_RBRIE_Msk                  (0x01UL << USART0_IER_RBRIE_Pos)                        /*!< USART0 IER: RBRIE Mask                  */
#define USART0_IER_THREIE_Pos                 1                                                       /*!< USART0 IER: THREIE Position             */
#define USART0_IER_THREIE_Msk                 (0x01UL << USART0_IER_THREIE_Pos)                       /*!< USART0 IER: THREIE Mask                 */
#define USART0_IER_RXIE_Pos                   2                                                       /*!< USART0 IER: RXIE Position               */
#define USART0_IER_RXIE_Msk                   (0x01UL << USART0_IER_RXIE_Pos)                         /*!< USART0 IER: RXIE Mask                   */
#define USART0_IER_ABEOINTEN_Pos              8                                                       /*!< USART0 IER: ABEOINTEN Position          */
#define USART0_IER_ABEOINTEN_Msk              (0x01UL << USART0_IER_ABEOINTEN_Pos)                    /*!< USART0 IER: ABEOINTEN Mask              */
#define USART0_IER_ABTOINTEN_Pos              9                                                       /*!< USART0 IER: ABTOINTEN Position          */
#define USART0_IER_ABTOINTEN_Msk              (0x01UL << USART0_IER_ABTOINTEN_Pos)                    /*!< USART0 IER: ABTOINTEN Mask              */

/* ---------------------------------  USART0_IIR  --------------------------------- */
#define USART0_IIR_INTSTATUS_Pos              0                                                       /*!< USART0 IIR: INTSTATUS Position          */
#define USART0_IIR_INTSTATUS_Msk              (0x01UL << USART0_IIR_INTSTATUS_Pos)                    /*!< USART0 IIR: INTSTATUS Mask              */
#define USART0_IIR_INTID_Pos                  1                                                       /*!< USART0 IIR: INTID Position              */
#define USART0_IIR_INTID_Msk                  (0x07UL << USART0_IIR_INTID_Pos)                        /*!< USART0 IIR: INTID Mask                  */
#define USART0_IIR_FIFOENABLE_Pos             6                                                       /*!< USART0 IIR: FIFOENABLE Position         */
#define USART0_IIR_FIFOENABLE_Msk             (0x03UL << USART0_IIR_FIFOENABLE_Pos)                   /*!< USART0 IIR: FIFOENABLE Mask             */
#define USART0_IIR_ABEOINT_Pos                8                                                       /*!< USART0 IIR: ABEOINT Position            */
#define USART0_IIR_ABEOINT_Msk                (0x01UL << USART0_IIR_ABEOINT_Pos)                      /*!< USART0 IIR: ABEOINT Mask                */
#define USART0_IIR_ABTOINT_Pos                9                                                       /*!< USART0 IIR: ABTOINT Position            */
#define USART0_IIR_ABTOINT_Msk                (0x01UL << USART0_IIR_ABTOINT_Pos)                      /*!< USART0 IIR: ABTOINT Mask                */

/* ---------------------------------  USART0_FCR  --------------------------------- */
#define USART0_FCR_FIFOEN_Pos                 0                                                       /*!< USART0 FCR: FIFOEN Position             */
#define USART0_FCR_FIFOEN_Msk                 (0x01UL << USART0_FCR_FIFOEN_Pos)                       /*!< USART0 FCR: FIFOEN Mask                 */
#define USART0_FCR_RXFIFORES_Pos              1                                                       /*!< USART0 FCR: RXFIFORES Position          */
#define USART0_FCR_RXFIFORES_Msk              (0x01UL << USART0_FCR_RXFIFORES_Pos)                    /*!< USART0 FCR: RXFIFORES Mask              */
#define USART0_FCR_TXFIFORES_Pos              2                                                       /*!< USART0 FCR: TXFIFORES Position          */
#define USART0_FCR_TXFIFORES_Msk              (0x01UL << USART0_FCR_TXFIFORES_Pos)                    /*!< USART0 FCR: TXFIFORES Mask              */
#define USART0_FCR_DMAMODE_Pos                3                                                       /*!< USART0 FCR: DMAMODE Position            */
#define USART0_FCR_DMAMODE_Msk                (0x01UL << USART0_FCR_DMAMODE_Pos)                      /*!< USART0 FCR: DMAMODE Mask                */
#define USART0_FCR_RXTRIGLVL_Pos              6                                                       /*!< USART0 FCR: RXTRIGLVL Position          */
#define USART0_FCR_RXTRIGLVL_Msk              (0x03UL << USART0_FCR_RXTRIGLVL_Pos)                    /*!< USART0 FCR: RXTRIGLVL Mask              */

/* ---------------------------------  USART0_LCR  --------------------------------- */
#define USART0_LCR_WLS_Pos                    0                                                       /*!< USART0 LCR: WLS Position                */
#define USART0_LCR_WLS_Msk                    (0x03UL << USART0_LCR_WLS_Pos)                          /*!< USART0 LCR: WLS Mask                    */
#define USART0_LCR_SBS_Pos                    2                                                       /*!< USART0 LCR: SBS Position                */
#define USART0_LCR_SBS_Msk                    (0x01UL << USART0_LCR_SBS_Pos)                          /*!< USART0 LCR: SBS Mask                    */
#define USART0_LCR_PE_Pos                     3                                                       /*!< USART0 LCR: PE Position                 */
#define USART0_LCR_PE_Msk                     (0x01UL << USART0_LCR_PE_Pos)                           /*!< USART0 LCR: PE Mask                     */
#define USART0_LCR_PS_Pos                     4                                                       /*!< USART0 LCR: PS Position                 */
#define USART0_LCR_PS_Msk                     (0x03UL << USART0_LCR_PS_Pos)                           /*!< USART0 LCR: PS Mask                     */
#define USART0_LCR_BC_Pos                     6                                                       /*!< USART0 LCR: BC Position                 */
#define USART0_LCR_BC_Msk                     (0x01UL << USART0_LCR_BC_Pos)                           /*!< USART0 LCR: BC Mask                     */
#define USART0_LCR_DLAB_Pos                   7                                                       /*!< USART0 LCR: DLAB Position               */
#define USART0_LCR_DLAB_Msk                   (0x01UL << USART0_LCR_DLAB_Pos)                         /*!< USART0 LCR: DLAB Mask                   */

/* ---------------------------------  USART0_LSR  --------------------------------- */
#define USART0_LSR_RDR_Pos                    0                                                       /*!< USART0 LSR: RDR Position                */
#define USART0_LSR_RDR_Msk                    (0x01UL << USART0_LSR_RDR_Pos)                          /*!< USART0 LSR: RDR Mask                    */
#define USART0_LSR_OE_Pos                     1                                                       /*!< USART0 LSR: OE Position                 */
#define USART0_LSR_OE_Msk                     (0x01UL << USART0_LSR_OE_Pos)                           /*!< USART0 LSR: OE Mask                     */
#define USART0_LSR_PE_Pos                     2                                                       /*!< USART0 LSR: PE Position                 */
#define USART0_LSR_PE_Msk                     (0x01UL << USART0_LSR_PE_Pos)                           /*!< USART0 LSR: PE Mask                     */
#define USART0_LSR_FE_Pos                     3                                                       /*!< USART0 LSR: FE Position                 */
#define USART0_LSR_FE_Msk                     (0x01UL << USART0_LSR_FE_Pos)                           /*!< USART0 LSR: FE Mask                     */
#define USART0_LSR_BI_Pos                     4                                                       /*!< USART0 LSR: BI Position                 */
#define USART0_LSR_BI_Msk                     (0x01UL << USART0_LSR_BI_Pos)                           /*!< USART0 LSR: BI Mask                     */
#define USART0_LSR_THRE_Pos                   5                                                       /*!< USART0 LSR: THRE Position               */
#define USART0_LSR_THRE_Msk                   (0x01UL << USART0_LSR_THRE_Pos)                         /*!< USART0 LSR: THRE Mask                   */
#define USART0_LSR_TEMT_Pos                   6                                                       /*!< USART0 LSR: TEMT Position               */
#define USART0_LSR_TEMT_Msk                   (0x01UL << USART0_LSR_TEMT_Pos)                         /*!< USART0 LSR: TEMT Mask                   */
#define USART0_LSR_RXFE_Pos                   7                                                       /*!< USART0 LSR: RXFE Position               */
#define USART0_LSR_RXFE_Msk                   (0x01UL << USART0_LSR_RXFE_Pos)                         /*!< USART0 LSR: RXFE Mask                   */
#define USART0_LSR_TXERR_Pos                  8                                                       /*!< USART0 LSR: TXERR Position              */
#define USART0_LSR_TXERR_Msk                  (0x01UL << USART0_LSR_TXERR_Pos)                        /*!< USART0 LSR: TXERR Mask                  */

/* ---------------------------------  USART0_SCR  --------------------------------- */
#define USART0_SCR_PAD_Pos                    0                                                       /*!< USART0 SCR: PAD Position                */
#define USART0_SCR_PAD_Msk                    (0x000000ffUL << USART0_SCR_PAD_Pos)                    /*!< USART0 SCR: PAD Mask                    */

/* ---------------------------------  USART0_ACR  --------------------------------- */
#define USART0_ACR_START_Pos                  0                                                       /*!< USART0 ACR: START Position              */
#define USART0_ACR_START_Msk                  (0x01UL << USART0_ACR_START_Pos)                        /*!< USART0 ACR: START Mask                  */
#define USART0_ACR_MODE_Pos                   1                                                       /*!< USART0 ACR: MODE Position               */
#define USART0_ACR_MODE_Msk                   (0x01UL << USART0_ACR_MODE_Pos)                         /*!< USART0 ACR: MODE Mask                   */
#define USART0_ACR_AUTORESTART_Pos            2                                                       /*!< USART0 ACR: AUTORESTART Position        */
#define USART0_ACR_AUTORESTART_Msk            (0x01UL << USART0_ACR_AUTORESTART_Pos)                  /*!< USART0 ACR: AUTORESTART Mask            */
#define USART0_ACR_ABEOINTCLR_Pos             8                                                       /*!< USART0 ACR: ABEOINTCLR Position         */
#define USART0_ACR_ABEOINTCLR_Msk             (0x01UL << USART0_ACR_ABEOINTCLR_Pos)                   /*!< USART0 ACR: ABEOINTCLR Mask             */
#define USART0_ACR_ABTOINTCLR_Pos             9                                                       /*!< USART0 ACR: ABTOINTCLR Position         */
#define USART0_ACR_ABTOINTCLR_Msk             (0x01UL << USART0_ACR_ABTOINTCLR_Pos)                   /*!< USART0 ACR: ABTOINTCLR Mask             */

/* ---------------------------------  USART0_ICR  --------------------------------- */
#define USART0_ICR_IRDAEN_Pos                 0                                                       /*!< USART0 ICR: IRDAEN Position             */
#define USART0_ICR_IRDAEN_Msk                 (0x01UL << USART0_ICR_IRDAEN_Pos)                       /*!< USART0 ICR: IRDAEN Mask                 */
#define USART0_ICR_IRDAINV_Pos                1                                                       /*!< USART0 ICR: IRDAINV Position            */
#define USART0_ICR_IRDAINV_Msk                (0x01UL << USART0_ICR_IRDAINV_Pos)                      /*!< USART0 ICR: IRDAINV Mask                */
#define USART0_ICR_FIXPULSEEN_Pos             2                                                       /*!< USART0 ICR: FIXPULSEEN Position         */
#define USART0_ICR_FIXPULSEEN_Msk             (0x01UL << USART0_ICR_FIXPULSEEN_Pos)                   /*!< USART0 ICR: FIXPULSEEN Mask             */
#define USART0_ICR_PULSEDIV_Pos               3                                                       /*!< USART0 ICR: PULSEDIV Position           */
#define USART0_ICR_PULSEDIV_Msk               (0x07UL << USART0_ICR_PULSEDIV_Pos)                     /*!< USART0 ICR: PULSEDIV Mask               */

/* ---------------------------------  USART0_FDR  --------------------------------- */
#define USART0_FDR_DIVADDVAL_Pos              0                                                       /*!< USART0 FDR: DIVADDVAL Position          */
#define USART0_FDR_DIVADDVAL_Msk              (0x0fUL << USART0_FDR_DIVADDVAL_Pos)                    /*!< USART0 FDR: DIVADDVAL Mask              */
#define USART0_FDR_MULVAL_Pos                 4                                                       /*!< USART0 FDR: MULVAL Position             */
#define USART0_FDR_MULVAL_Msk                 (0x0fUL << USART0_FDR_MULVAL_Pos)                       /*!< USART0 FDR: MULVAL Mask                 */

/* ---------------------------------  USART0_OSR  --------------------------------- */
#define USART0_OSR_OSFRAC_Pos                 1                                                       /*!< USART0 OSR: OSFRAC Position             */
#define USART0_OSR_OSFRAC_Msk                 (0x07UL << USART0_OSR_OSFRAC_Pos)                       /*!< USART0 OSR: OSFRAC Mask                 */
#define USART0_OSR_OSINT_Pos                  4                                                       /*!< USART0 OSR: OSINT Position              */
#define USART0_OSR_OSINT_Msk                  (0x0fUL << USART0_OSR_OSINT_Pos)                        /*!< USART0 OSR: OSINT Mask                  */
#define USART0_OSR_FDINT_Pos                  8                                                       /*!< USART0 OSR: FDINT Position              */
#define USART0_OSR_FDINT_Msk                  (0x7fUL << USART0_OSR_FDINT_Pos)                        /*!< USART0 OSR: FDINT Mask                  */

