MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  USART2_ACR  --------------------------------- */
#define USART2_ACR_START_Pos                  0                                                       /*!< USART2 ACR: START Position              */
#define USART2_ACR_START_Msk                  (0x01UL << USART2_ACR_START_Pos)                        /*!< USART2 ACR: START Mask                  */
#define USART2_ACR_MODE_Pos                   1                                                       /*!< USART2 ACR: MODE Position               */
#define USART2_ACR_MODE_Msk                   (0x01UL << USART2_ACR_MODE_Pos)                         /*!< USART2 ACR: MODE Mask                   */
#define USART2_ACR_AUTORESTART_Pos            2                                                       /*!< USART2 ACR: AUTORESTART Position        */
#define USART2_ACR_AUTORESTART_Msk            (0x01UL << USART2_ACR_AUTORESTART_Pos)                  /*!< USART2 ACR: AUTORESTART Mask            */
#define USART2_ACR_ABEOINTCLR_Pos             8                                                       /*!< USART2 ACR: ABEOINTCLR Position         */
#define USART2_ACR_ABEOINTCLR_Msk             (0x01UL << USART2_ACR_ABEOINTCLR_Pos)                   /*!< USART2 ACR: ABEOINTCLR Mask             */
#define USART2_ACR_ABTOINTCLR_Pos             9                                                       /*!< USART2 ACR: ABTOINTCLR Position         */
#define USART2_ACR_ABTOINTCLR_Msk             (0x01UL << USART2_ACR_ABTOINTCLR_Pos)                   /*!< USART2 ACR: ABTOINTCLR Mask             */

/* ---------------------------------  USART2_ICR  --------------------------------- */
#define USART2_ICR_IRDAEN_Pos                 0                                                       /*!< USART2 ICR: IRDAEN Position             */
#define USART2_ICR_IRDAEN_Msk                 (0x01UL << USART2_ICR_IRDAEN_Pos)                       /*!< USART2 ICR: IRDAEN Mask                 */
#define USART2_ICR_IRDAINV_Pos                1                                                       /*!< USART2 ICR: IRDAINV Position            */
#define USART2_ICR_IRDAINV_Msk                (0x01UL << USART2_ICR_IRDAINV_Pos)                      /*!< USART2 ICR: IRDAINV Mask                */
#define USART2_ICR_FIXPULSEEN_Pos             2                                                       /*!< USART2 ICR: FIXPULSEEN Position         */
#define USART2_ICR_FIXPULSEEN_Msk             (0x01UL << USART2_ICR_FIXPULSEEN_Pos)                   /*!< USART2 ICR: FIXPULSEEN Mask             */
#define USART2_ICR_PULSEDIV_Pos               3                                                       /*!< USART2 ICR: PULSEDIV Position           */
#define USART2_ICR_PULSEDIV_Msk               (0x07UL << USART2_ICR_PULSEDIV_Pos)                     /*!< USART2 ICR: PULSEDIV Mask               */

/* ---------------------------------  USART2_FDR  --------------------------------- */
#define USART2_FDR_DIVADDVAL_Pos              0                                                       /*!< USART2 FDR: DIVADDVAL Position          */
#define USART2_FDR_DIVADDVAL_Msk              (0x0fUL << USART2_FDR_DIVADDVAL_Pos)                    /*!< USART2 FDR: DIVADDVAL Mask              */
#define USART2_FDR_MULVAL_Pos                 4                                                       /*!< USART2 FDR: MULVAL Position             */
#define USART2_FDR_MULVAL_Msk                 (0x0fUL << USART2_FDR_MULVAL_Pos)                       /*!< USART2 FDR: MULVAL Mask                 */

/* ---------------------------------  USART2_OSR  --------------------------------- */
#define USART2_OSR_OSFRAC_Pos                 1                                                       /*!< USART2 OSR: OSFRAC Position             */
#define USART2_OSR_OSFRAC_Msk                 (0x07UL << USART2_OSR_OSFRAC_Pos)                       /*!< USART2 OSR: OSFRAC Mask                 */
#define USART2_OSR_OSINT_Pos                  4                                                       /*!< USART2 OSR: OSINT Position              */
#define USART2_OSR_OSINT_Msk                  (0x0fUL << USART2_OSR_OSINT_Pos)                        /*!< USART2 OSR: OSINT Mask                  */
#define USART2_OSR_FDINT_Pos                  8                                                       /*!< USART2 OSR: FDINT Position              */
#define USART2_OSR_FDINT_Msk                  (0x7fUL << USART2_OSR_FDINT_Pos)                        /*!< USART2 OSR: FDINT Mask                  */

/* ---------------------------------  USART2_HDEN  -------------------------------- */
#define USART2_HDEN_HDEN_Pos                  0                                                       /*!< USART2 HDEN: HDEN Position              */
#define USART2_HDEN_HDEN_Msk                  (0x01UL << USART2_HDEN_HDEN_Pos)                        /*!< USART2 HDEN: HDEN Mask                  */

/* -------------------------------  USART2_SCICTRL  ------------------------------- */
#define USART2_SCICTRL_SCIEN_Pos              0                                                       /*!< USART2 SCICTRL: SCIEN Position          */
#define USART2_SCICTRL_SCIEN_Msk              (0x01UL << USART2_SCICTRL_SCIEN_Pos)                    /*!< USART2 SCICTRL: SCIEN Mask              */
#define USART2_SCICTRL_NACKDIS_Pos            1                                                       /*!< USART2 SCICTRL: NACKDIS Position        */
#define USART2_SCICTRL_NACKDIS_Msk            (0x01UL << USART2_SCICTRL_NACKDIS_Pos)                  /*!< USART2 SCICTRL: NACKDIS Mask            */
#define USART2_SCICTRL_PROTSEL_Pos            2                                                       /*!< USART2 SCICTRL: PROTSEL Position        */
#define USART2_SCICTRL_PROTSEL_Msk            (0x01UL << USART2_SCICTRL_PROTSEL_Pos)                  /*!< USART2 SCICTRL: PROTSEL Mask            */
#define USART2_SCICTRL_TXRETRY_Pos            5                                                       /*!< USART2 SCICTRL: TXRETRY Position        */
#define USART2_SCICTRL_TXRETRY_Msk            (0x07UL << USART2_SCICTRL_TXRETRY_Pos)                  /*!< USART2 SCICTRL: TXRETRY Mask            */
#define USART2_SCICTRL_GUARDTIME_Pos          8                                                       /*!< USART2 SCICTRL: GUARDTIME Position      */
#define USART2_SCICTRL_GUARDTIME_Msk          (0x000000ffUL << USART2_SCICTRL_GUARDTIME_Pos)          /*!< USART2 SCICTRL: GUARDTIME Mask          */

/* ------------------------------  USART2_RS485CTRL  ------------------------------ */
#define USART2_RS485CTRL_NMMEN_Pos            0                                                       /*!< USART2 RS485CTRL: NMMEN Position        */
#define USART2_RS485CTRL_NMMEN_Msk            (0x01UL << USART2_RS485CTRL_NMMEN_Pos)                  /*!< USART2 RS485CTRL: NMMEN Mask            */
#define USART2_RS485CTRL_RXDIS_Pos            1                                                       /*!< USART2 RS485CTRL: RXDIS Position        */
#define USART2_RS485CTRL_RXDIS_Msk            (0x01UL << USART2_RS485CTRL_RXDIS_Pos)                  /*!< USART2 RS485CTRL: RXDIS Mask            */
#define USART2_RS485CTRL_AADEN_Pos            2                                                       /*!< USART2 RS485CTRL: AADEN Position        */
#define USART2_RS485CTRL_AADEN_Msk            (0x01UL << USART2_RS485CTRL_AADEN_Pos)                  /*!< USART2 RS485CTRL: AADEN Mask            */
#define USART2_RS485CTRL_DCTRL_Pos            4                                                       /*!< USART2 RS485CTRL: DCTRL Position        */
#define USART2_RS485CTRL_DCTRL_Msk            (0x01UL << USART2_RS485CTRL_DCTRL_Pos)                  /*!< USART2 RS485CTRL: DCTRL Mask            */
#define USART2_RS485CTRL_OINV_Pos             5                                                       /*!< USART2 RS485CTRL: OINV Position         */
#define USART2_RS485CTRL_OINV_Msk             (0x01UL << USART2_RS485CTRL_OINV_Pos)                   /*!< USART2 RS485CTRL: OINV Mask             */

