MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  USART3_FDR  --------------------------------- */
#define USART3_FDR_DIVADDVAL_Pos              0                                                       /*!< USART3 FDR: DIVADDVAL Position          */
#define USART3_FDR_DIVADDVAL_Msk              (0x0fUL << USART3_FDR_DIVADDVAL_Pos)                    /*!< USART3 FDR: DIVADDVAL Mask              */
#define USART3_FDR_MULVAL_Pos                 4                                                       /*!< USART3 FDR: MULVAL Position             */
#define USART3_FDR_MULVAL_Msk                 (0x0fUL << USART3_FDR_MULVAL_Pos)                       /*!< USART3 FDR: MULVAL Mask                 */

/* ---------------------------------  USART3_OSR  --------------------------------- */
#define USART3_OSR_OSFRAC_Pos                 1                                                       /*!< USART3 OSR: OSFRAC Position             */
#define USART3_OSR_OSFRAC_Msk                 (0x07UL << USART3_OSR_OSFRAC_Pos)                       /*!< USART3 OSR: OSFRAC Mask                 */
#define USART3_OSR_OSINT_Pos                  4                                                       /*!< USART3 OSR: OSINT Position              */
#define USART3_OSR_OSINT_Msk                  (0x0fUL << USART3_OSR_OSINT_Pos)                        /*!< USART3 OSR: OSINT Mask                  */
#define USART3_OSR_FDINT_Pos                  8                                                       /*!< USART3 OSR: FDINT Position              */
#define USART3_OSR_FDINT_Msk                  (0x7fUL << USART3_OSR_FDINT_Pos)                        /*!< USART3 OSR: FDINT Mask                  */

/* ---------------------------------  USART3_HDEN  -------------------------------- */
#define USART3_HDEN_HDEN_Pos                  0                                                       /*!< USART3 HDEN: HDEN Position              */
#define USART3_HDEN_HDEN_Msk                  (0x01UL << USART3_HDEN_HDEN_Pos)                        /*!< USART3 HDEN: HDEN Mask                  */

/* -------------------------------  USART3_SCICTRL  ------------------------------- */
#define USART3_SCICTRL_SCIEN_Pos              0                                                       /*!< USART3 SCICTRL: SCIEN Position          */
#define USART3_SCICTRL_SCIEN_Msk              (0x01UL << USART3_SCICTRL_SCIEN_Pos)                    /*!< USART3 SCICTRL: SCIEN Mask              */
#define USART3_SCICTRL_NACKDIS_Pos            1                                                       /*!< USART3 SCICTRL: NACKDIS Position        */
#define USART3_SCICTRL_NACKDIS_Msk            (0x01UL << USART3_SCICTRL_NACKDIS_Pos)                  /*!< USART3 SCICTRL: NACKDIS Mask            */
#define USART3_SCICTRL_PROTSEL_Pos            2                                                       /*!< USART3 SCICTRL: PROTSEL Position        */
#define USART3_SCICTRL_PROTSEL_Msk            (0x01UL << USART3_SCICTRL_PROTSEL_Pos)                  /*!< USART3 SCICTRL: PROTSEL Mask            */
#define USART3_SCICTRL_TXRETRY_Pos            5                                                       /*!< USART3 SCICTRL: TXRETRY Position        */
#define USART3_SCICTRL_TXRETRY_Msk            (0x07UL << USART3_SCICTRL_TXRETRY_Pos)                  /*!< USART3 SCICTRL: TXRETRY Mask            */
#define USART3_SCICTRL_GUARDTIME_Pos          8                                                       /*!< USART3 SCICTRL: GUARDTIME Position      */
#define USART3_SCICTRL_GUARDTIME_Msk          (0x000000ffUL << USART3_SCICTRL_GUARDTIME_Pos)          /*!< USART3 SCICTRL: GUARDTIME Mask          */

/* ------------------------------  USART3_RS485CTRL  ------------------------------ */
#define USART3_RS485CTRL_NMMEN_Pos            0                                                       /*!< USART3 RS485CTRL: NMMEN Position        */
#define USART3_RS485CTRL_NMMEN_Msk            (0x01UL << USART3_RS485CTRL_NMMEN_Pos)                  /*!< USART3 RS485CTRL: NMMEN Mask            */
#define USART3_RS485CTRL_RXDIS_Pos            1                                                       /*!< USART3 RS485CTRL: RXDIS Position        */
#define USART3_RS485CTRL_RXDIS_Msk            (0x01UL << USART3_RS485CTRL_RXDIS_Pos)                  /*!< USART3 RS485CTRL: RXDIS Mask            */
#define USART3_RS485CTRL_AADEN_Pos            2                                                       /*!< USART3 RS485CTRL: AADEN Position        */
#define USART3_RS485CTRL_AADEN_Msk            (0x01UL << USART3_RS485CTRL_AADEN_Pos)                  /*!< USART3 RS485CTRL: AADEN Mask            */
#define USART3_RS485CTRL_DCTRL_Pos            4                                                       /*!< USART3 RS485CTRL: DCTRL Position        */
#define USART3_RS485CTRL_DCTRL_Msk            (0x01UL << USART3_RS485CTRL_DCTRL_Pos)                  /*!< USART3 RS485CTRL: DCTRL Mask            */
#define USART3_RS485CTRL_OINV_Pos             5                                                       /*!< USART3 RS485CTRL: OINV Position         */
#define USART3_RS485CTRL_OINV_Msk             (0x01UL << USART3_RS485CTRL_OINV_Pos)                   /*!< USART3 RS485CTRL: OINV Mask             */

/* ----------------------------  USART3_RS485ADRMATCH  ---------------------------- */
#define USART3_RS485ADRMATCH_ADRMATCH_Pos     0                                                       /*!< USART3 RS485ADRMATCH: ADRMATCH Position */
#define USART3_RS485ADRMATCH_ADRMATCH_Msk     (0x000000ffUL << USART3_RS485ADRMATCH_ADRMATCH_Pos)     /*!< USART3 RS485ADRMATCH: ADRMATCH Mask     */

/* -------------------------------  USART3_RS485DLY  ------------------------------ */
#define USART3_RS485DLY_DLY_Pos               0                                                       /*!< USART3 RS485DLY: DLY Position           */
#define USART3_RS485DLY_DLY_Msk               (0x000000ffUL << USART3_RS485DLY_DLY_Pos)               /*!< USART3 RS485DLY: DLY Mask               */

/* -------------------------------  USART3_SYNCCTRL  ------------------------------ */
#define USART3_SYNCCTRL_SYNC_Pos              0                                                       /*!< USART3 SYNCCTRL: SYNC Position          */
#define USART3_SYNCCTRL_SYNC_Msk              (0x01UL << USART3_SYNCCTRL_SYNC_Pos)                    /*!< USART3 SYNCCTRL: SYNC Mask              */
#define USART3_SYNCCTRL_CSRC_Pos              1                                                       /*!< USART3 SYNCCTRL: CSRC Position          */
#define USART3_SYNCCTRL_CSRC_Msk              (0x01UL << USART3_SYNCCTRL_CSRC_Pos)                    /*!< USART3 SYNCCTRL: CSRC Mask              */
#define USART3_SYNCCTRL_FES_Pos               2                                                       /*!< USART3 SYNCCTRL: FES Position           */
#define USART3_SYNCCTRL_FES_Msk               (0x01UL << USART3_SYNCCTRL_FES_Pos)                     /*!< USART3 SYNCCTRL: FES Mask               */
#define USART3_SYNCCTRL_TSBYPASS_Pos          3                                                       /*!< USART3 SYNCCTRL: TSBYPASS Position      */
#define USART3_SYNCCTRL_TSBYPASS_Msk          (0x01UL << USART3_SYNCCTRL_TSBYPASS_Pos)                /*!< USART3 SYNCCTRL: TSBYPASS Mask          */
#define USART3_SYNCCTRL_CSCEN_Pos             4                                                       /*!< USART3 SYNCCTRL: CSCEN Position         */
#define USART3_SYNCCTRL_CSCEN_Msk             (0x01UL << USART3_SYNCCTRL_CSCEN_Pos)                   /*!< USART3 SYNCCTRL: CSCEN Mask             */
#define USART3_SYNCCTRL_SSSDIS_Pos            5                                                       /*!< USART3 SYNCCTRL: SSSDIS Position        */
#define USART3_SYNCCTRL_SSSDIS_Msk            (0x01UL << USART3_SYNCCTRL_SSSDIS_Pos)                  /*!< USART3 SYNCCTRL: SSSDIS Mask            */
#define USART3_SYNCCTRL_CCCLR_Pos             6                                                       /*!< USART3 SYNCCTRL: CCCLR Position         */
#define USART3_SYNCCTRL_CCCLR_Msk             (0x01UL << USART3_SYNCCTRL_CCCLR_Pos)                   /*!< USART3 SYNCCTRL: CCCLR Mask             */

