MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  USART3_TER  --------------------------------- */
#define USART3_TER_TXEN_Pos                   0                                                       /*!< USART3 TER: TXEN Position               */
#define USART3_TER_TXEN_Msk                   (0x01UL << USART3_TER_TXEN_Pos)                         /*!< USART3 TER: TXEN Mask                   */


/* ================================================================================ */
/* ================         struct 'UART1' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------------  UART1_RBR  --------------------------------- */
#define UART1_RBR_RBR_Pos                     0                                                       /*!< UART1 RBR: RBR Position                 */
#define UART1_RBR_RBR_Msk                     (0x000000ffUL << UART1_RBR_RBR_Pos)                     /*!< UART1 RBR: RBR Mask                     */

/* ----------------------------------  UART1_THR  --------------------------------- */
#define UART1_THR_THR_Pos                     0                                                       /*!< UART1 THR: THR Position                 */
#define UART1_THR_THR_Msk                     (0x000000ffUL << UART1_THR_THR_Pos)                     /*!< UART1 THR: THR Mask                     */

/* ----------------------------------  UART1_DLL  --------------------------------- */
#define UART1_DLL_DLLSB_Pos                   0                                                       /*!< UART1 DLL: DLLSB Position               */
#define UART1_DLL_DLLSB_Msk                   (0x000000ffUL << UART1_DLL_DLLSB_Pos)                   /*!< UART1 DLL: DLLSB Mask                   */

/* ----------------------------------  UART1_DLM  --------------------------------- */
#define UART1_DLM_DLMSB_Pos                   0                                                       /*!< UART1 DLM: DLMSB Position               */
#define UART1_DLM_DLMSB_Msk                   (0x000000ffUL << UART1_DLM_DLMSB_Pos)                   /*!< UART1 DLM: DLMSB Mask                   */

/* ----------------------------------  UART1_IER  --------------------------------- */
#define UART1_IER_RBRIE_Pos                   0                                                       /*!< UART1 IER: RBRIE Position               */
#define UART1_IER_RBRIE_Msk                   (0x01UL << UART1_IER_RBRIE_Pos)                         /*!< UART1 IER: RBRIE Mask                   */
#define UART1_IER_THREIE_Pos                  1                                                       /*!< UART1 IER: THREIE Position              */
#define UART1_IER_THREIE_Msk                  (0x01UL << UART1_IER_THREIE_Pos)                        /*!< UART1 IER: THREIE Mask                  */
#define UART1_IER_RXIE_Pos                    2                                                       /*!< UART1 IER: RXIE Position                */
#define UART1_IER_RXIE_Msk                    (0x01UL << UART1_IER_RXIE_Pos)                          /*!< UART1 IER: RXIE Mask                    */
#define UART1_IER_MSIE_Pos                    3                                                       /*!< UART1 IER: MSIE Position                */
#define UART1_IER_MSIE_Msk                    (0x01UL << UART1_IER_MSIE_Pos)                          /*!< UART1 IER: MSIE Mask                    */
#define UART1_IER_CTSIE_Pos                   7                                                       /*!< UART1 IER: CTSIE Position               */
#define UART1_IER_CTSIE_Msk                   (0x01UL << UART1_IER_CTSIE_Pos)                         /*!< UART1 IER: CTSIE Mask                   */
#define UART1_IER_ABEOIE_Pos                  8                                                       /*!< UART1 IER: ABEOIE Position              */
#define UART1_IER_ABEOIE_Msk                  (0x01UL << UART1_IER_ABEOIE_Pos)                        /*!< UART1 IER: ABEOIE Mask                  */
#define UART1_IER_ABTOIE_Pos                  9                                                       /*!< UART1 IER: ABTOIE Position              */
#define UART1_IER_ABTOIE_Msk                  (0x01UL << UART1_IER_ABTOIE_Pos)                        /*!< UART1 IER: ABTOIE Mask                  */

/* ----------------------------------  UART1_IIR  --------------------------------- */
#define UART1_IIR_INTSTATUS_Pos               0                                                       /*!< UART1 IIR: INTSTATUS Position           */
#define UART1_IIR_INTSTATUS_Msk               (0x01UL << UART1_IIR_INTSTATUS_Pos)                     /*!< UART1 IIR: INTSTATUS Mask               */
#define UART1_IIR_INTID_Pos                   1                                                       /*!< UART1 IIR: INTID Position               */
#define UART1_IIR_INTID_Msk                   (0x07UL << UART1_IIR_INTID_Pos)                         /*!< UART1 IIR: INTID Mask                   */
#define UART1_IIR_FIFOENABLE_Pos              6                                                       /*!< UART1 IIR: FIFOENABLE Position          */
#define UART1_IIR_FIFOENABLE_Msk              (0x03UL << UART1_IIR_FIFOENABLE_Pos)                    /*!< UART1 IIR: FIFOENABLE Mask              */
#define UART1_IIR_ABEOINT_Pos                 8                                                       /*!< UART1 IIR: ABEOINT Position             */
#define UART1_IIR_ABEOINT_Msk                 (0x01UL << UART1_IIR_ABEOINT_Pos)                       /*!< UART1 IIR: ABEOINT Mask                 */
#define UART1_IIR_ABTOINT_Pos                 9                                                       /*!< UART1 IIR: ABTOINT Position             */
#define UART1_IIR_ABTOINT_Msk                 (0x01UL << UART1_IIR_ABTOINT_Pos)                       /*!< UART1 IIR: ABTOINT Mask                 */

/* ----------------------------------  UART1_FCR  --------------------------------- */
#define UART1_FCR_FIFOEN_Pos                  0                                                       /*!< UART1 FCR: FIFOEN Position              */
#define UART1_FCR_FIFOEN_Msk                  (0x01UL << UART1_FCR_FIFOEN_Pos)                        /*!< UART1 FCR: FIFOEN Mask                  */
#define UART1_FCR_RXFIFORES_Pos               1                                                       /*!< UART1 FCR: RXFIFORES Position           */
#define UART1_FCR_RXFIFORES_Msk               (0x01UL << UART1_FCR_RXFIFORES_Pos)                     /*!< UART1 FCR: RXFIFORES Mask               */
#define UART1_FCR_TXFIFORES_Pos               2                                                       /*!< UART1 FCR: TXFIFORES Position           */
#define UART1_FCR_TXFIFORES_Msk               (0x01UL << UART1_FCR_TXFIFORES_Pos)                     /*!< UART1 FCR: TXFIFORES Mask               */
#define UART1_FCR_DMAMODE_Pos                 3                                                       /*!< UART1 FCR: DMAMODE Position             */
#define UART1_FCR_DMAMODE_Msk                 (0x01UL << UART1_FCR_DMAMODE_Pos)                       /*!< UART1 FCR: DMAMODE Mask                 */
#define UART1_FCR_RXTRIGLVL_Pos               6                                                       /*!< UART1 FCR: RXTRIGLVL Position           */
#define UART1_FCR_RXTRIGLVL_Msk               (0x03UL << UART1_FCR_RXTRIGLVL_Pos)                     /*!< UART1 FCR: RXTRIGLVL Mask               */

/* ----------------------------------  UART1_LCR  --------------------------------- */
#define UART1_LCR_WLS_Pos                     0                                                       /*!< UART1 LCR: WLS Position                 */
#define UART1_LCR_WLS_Msk                     (0x03UL << UART1_LCR_WLS_Pos)                           /*!< UART1 LCR: WLS Mask                     */
#define UART1_LCR_SBS_Pos                     2                                                       /*!< UART1 LCR: SBS Position                 */
#define UART1_LCR_SBS_Msk                     (0x01UL << UART1_LCR_SBS_Pos)                           /*!< UART1 LCR: SBS Mask                     */
#define UART1_LCR_PE_Pos                      3                                                       /*!< UART1 LCR: PE Position                  */
#define UART1_LCR_PE_Msk                      (0x01UL << UART1_LCR_PE_Pos)                            /*!< UART1 LCR: PE Mask                      */
#define UART1_LCR_PS_Pos                      4                                                       /*!< UART1 LCR: PS Position                  */
#define UART1_LCR_PS_Msk                      (0x03UL << UART1_LCR_PS_Pos)                            /*!< UART1 LCR: PS Mask                      */
#define UART1_LCR_BC_Pos                      6                                                       /*!< UART1 LCR: BC Position                  */
#define UART1_LCR_BC_Msk                      (0x01UL << UART1_LCR_BC_Pos)                            /*!< UART1 LCR: BC Mask                      */
#define UART1_LCR_DLAB_Pos                    7                                                       /*!< UART1 LCR: DLAB Position                */
#define UART1_LCR_DLAB_Msk                    (0x01UL << UART1_LCR_DLAB_Pos)                          /*!< UART1 LCR: DLAB Mask                    */

/* ----------------------------------  UART1_MCR  --------------------------------- */
#define UART1_MCR_DTRCTRL_Pos                 0                                                       /*!< UART1 MCR: DTRCTRL Position             */
#define UART1_MCR_DTRCTRL_Msk                 (0x01UL << UART1_MCR_DTRCTRL_Pos)                       /*!< UART1 MCR: DTRCTRL Mask                 */
#define UART1_MCR_RTSCTRL_Pos                 1                                                       /*!< UART1 MCR: RTSCTRL Position             */
#define UART1_MCR_RTSCTRL_Msk                 (0x01UL << UART1_MCR_RTSCTRL_Pos)                       /*!< UART1 MCR: RTSCTRL Mask                 */
#define UART1_MCR_LMS_Pos                     4                                                       /*!< UART1 MCR: LMS Position                 */
#define UART1_MCR_LMS_Msk                     (0x01UL << UART1_MCR_LMS_Pos)                           /*!< UART1 MCR: LMS Mask                     */
#define UART1_MCR_RTSEN_Pos                   6                                                       /*!< UART1 MCR: RTSEN Position               */
#define UART1_MCR_RTSEN_Msk                   (0x01UL << UART1_MCR_RTSEN_Pos)                         /*!< UART1 MCR: RTSEN Mask                   */
#define UART1_MCR_CTSEN_Pos                   7                                                       /*!< UART1 MCR: CTSEN Position               */
#define UART1_MCR_CTSEN_Msk                   (0x01UL << UART1_MCR_CTSEN_Pos)                         /*!< UART1 MCR: CTSEN Mask                   */

