MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ----------------------------------  UART1_LSR  --------------------------------- */
#define UART1_LSR_RDR_Pos                     0                                                       /*!< UART1 LSR: RDR Position                 */
#define UART1_LSR_RDR_Msk                     (0x01UL << UART1_LSR_RDR_Pos)                           /*!< UART1 LSR: RDR Mask                     */
#define UART1_LSR_OE_Pos                      1                                                       /*!< UART1 LSR: OE Position                  */
#define UART1_LSR_OE_Msk                      (0x01UL << UART1_LSR_OE_Pos)                            /*!< UART1 LSR: OE Mask                      */
#define UART1_LSR_PE_Pos                      2                                                       /*!< UART1 LSR: PE Position                  */
#define UART1_LSR_PE_Msk                      (0x01UL << UART1_LSR_PE_Pos)                            /*!< UART1 LSR: PE Mask                      */
#define UART1_LSR_FE_Pos                      3                                                       /*!< UART1 LSR: FE Position                  */
#define UART1_LSR_FE_Msk                      (0x01UL << UART1_LSR_FE_Pos)                            /*!< UART1 LSR: FE Mask                      */
#define UART1_LSR_BI_Pos                      4                                                       /*!< UART1 LSR: BI Position                  */
#define UART1_LSR_BI_Msk                      (0x01UL << UART1_LSR_BI_Pos)                            /*!< UART1 LSR: BI Mask                      */
#define UART1_LSR_THRE_Pos                    5                                                       /*!< UART1 LSR: THRE Position                */
#define UART1_LSR_THRE_Msk                    (0x01UL << UART1_LSR_THRE_Pos)                          /*!< UART1 LSR: THRE Mask                    */
#define UART1_LSR_TEMT_Pos                    6                                                       /*!< UART1 LSR: TEMT Position                */
#define UART1_LSR_TEMT_Msk                    (0x01UL << UART1_LSR_TEMT_Pos)                          /*!< UART1 LSR: TEMT Mask                    */
#define UART1_LSR_RXFE_Pos                    7                                                       /*!< UART1 LSR: RXFE Position                */
#define UART1_LSR_RXFE_Msk                    (0x01UL << UART1_LSR_RXFE_Pos)                          /*!< UART1 LSR: RXFE Mask                    */

/* ----------------------------------  UART1_MSR  --------------------------------- */
#define UART1_MSR_DCTS_Pos                    0                                                       /*!< UART1 MSR: DCTS Position                */
#define UART1_MSR_DCTS_Msk                    (0x01UL << UART1_MSR_DCTS_Pos)                          /*!< UART1 MSR: DCTS Mask                    */
#define UART1_MSR_DDSR_Pos                    1                                                       /*!< UART1 MSR: DDSR Position                */
#define UART1_MSR_DDSR_Msk                    (0x01UL << UART1_MSR_DDSR_Pos)                          /*!< UART1 MSR: DDSR Mask                    */
#define UART1_MSR_TERI_Pos                    2                                                       /*!< UART1 MSR: TERI Position                */
#define UART1_MSR_TERI_Msk                    (0x01UL << UART1_MSR_TERI_Pos)                          /*!< UART1 MSR: TERI Mask                    */
#define UART1_MSR_DDCD_Pos                    3                                                       /*!< UART1 MSR: DDCD Position                */
#define UART1_MSR_DDCD_Msk                    (0x01UL << UART1_MSR_DDCD_Pos)                          /*!< UART1 MSR: DDCD Mask                    */
#define UART1_MSR_CTS_Pos                     4                                                       /*!< UART1 MSR: CTS Position                 */
#define UART1_MSR_CTS_Msk                     (0x01UL << UART1_MSR_CTS_Pos)                           /*!< UART1 MSR: CTS Mask                     */
#define UART1_MSR_DSR_Pos                     5                                                       /*!< UART1 MSR: DSR Position                 */
#define UART1_MSR_DSR_Msk                     (0x01UL << UART1_MSR_DSR_Pos)                           /*!< UART1 MSR: DSR Mask                     */
#define UART1_MSR_RI_Pos                      6                                                       /*!< UART1 MSR: RI Position                  */
#define UART1_MSR_RI_Msk                      (0x01UL << UART1_MSR_RI_Pos)                            /*!< UART1 MSR: RI Mask                      */
#define UART1_MSR_DCD_Pos                     7                                                       /*!< UART1 MSR: DCD Position                 */
#define UART1_MSR_DCD_Msk                     (0x01UL << UART1_MSR_DCD_Pos)                           /*!< UART1 MSR: DCD Mask                     */

/* ----------------------------------  UART1_SCR  --------------------------------- */
#define UART1_SCR_Pad_Pos                     0                                                       /*!< UART1 SCR: Pad Position                 */
#define UART1_SCR_Pad_Msk                     (0x000000ffUL << UART1_SCR_Pad_Pos)                     /*!< UART1 SCR: Pad Mask                     */

/* ----------------------------------  UART1_ACR  --------------------------------- */
#define UART1_ACR_START_Pos                   0                                                       /*!< UART1 ACR: START Position               */
#define UART1_ACR_START_Msk                   (0x01UL << UART1_ACR_START_Pos)                         /*!< UART1 ACR: START Mask                   */
#define UART1_ACR_MODE_Pos                    1                                                       /*!< UART1 ACR: MODE Position                */
#define UART1_ACR_MODE_Msk                    (0x01UL << UART1_ACR_MODE_Pos)                          /*!< UART1 ACR: MODE Mask                    */
#define UART1_ACR_AUTORESTART_Pos             2                                                       /*!< UART1 ACR: AUTORESTART Position         */
#define UART1_ACR_AUTORESTART_Msk             (0x01UL << UART1_ACR_AUTORESTART_Pos)                   /*!< UART1 ACR: AUTORESTART Mask             */
#define UART1_ACR_ABEOINTCLR_Pos              8                                                       /*!< UART1 ACR: ABEOINTCLR Position          */
#define UART1_ACR_ABEOINTCLR_Msk              (0x01UL << UART1_ACR_ABEOINTCLR_Pos)                    /*!< UART1 ACR: ABEOINTCLR Mask              */
#define UART1_ACR_ABTOINTCLR_Pos              9                                                       /*!< UART1 ACR: ABTOINTCLR Position          */
#define UART1_ACR_ABTOINTCLR_Msk              (0x01UL << UART1_ACR_ABTOINTCLR_Pos)                    /*!< UART1 ACR: ABTOINTCLR Mask              */

/* ----------------------------------  UART1_FDR  --------------------------------- */
#define UART1_FDR_DIVADDVAL_Pos               0                                                       /*!< UART1 FDR: DIVADDVAL Position           */
#define UART1_FDR_DIVADDVAL_Msk               (0x0fUL << UART1_FDR_DIVADDVAL_Pos)                     /*!< UART1 FDR: DIVADDVAL Mask               */
#define UART1_FDR_MULVAL_Pos                  4                                                       /*!< UART1 FDR: MULVAL Position              */
#define UART1_FDR_MULVAL_Msk                  (0x0fUL << UART1_FDR_MULVAL_Pos)                        /*!< UART1 FDR: MULVAL Mask                  */

/* -------------------------------  UART1_RS485CTRL  ------------------------------ */
#define UART1_RS485CTRL_NMMEN_Pos             0                                                       /*!< UART1 RS485CTRL: NMMEN Position         */
#define UART1_RS485CTRL_NMMEN_Msk             (0x01UL << UART1_RS485CTRL_NMMEN_Pos)                   /*!< UART1 RS485CTRL: NMMEN Mask             */
#define UART1_RS485CTRL_RXDIS_Pos             1                                                       /*!< UART1 RS485CTRL: RXDIS Position         */
#define UART1_RS485CTRL_RXDIS_Msk             (0x01UL << UART1_RS485CTRL_RXDIS_Pos)                   /*!< UART1 RS485CTRL: RXDIS Mask             */
#define UART1_RS485CTRL_AADEN_Pos             2                                                       /*!< UART1 RS485CTRL: AADEN Position         */
#define UART1_RS485CTRL_AADEN_Msk             (0x01UL << UART1_RS485CTRL_AADEN_Pos)                   /*!< UART1 RS485CTRL: AADEN Mask             */
#define UART1_RS485CTRL_SEL_Pos               3                                                       /*!< UART1 RS485CTRL: SEL Position           */
#define UART1_RS485CTRL_SEL_Msk               (0x01UL << UART1_RS485CTRL_SEL_Pos)                     /*!< UART1 RS485CTRL: SEL Mask               */
#define UART1_RS485CTRL_DCTRL_Pos             4                                                       /*!< UART1 RS485CTRL: DCTRL Position         */
#define UART1_RS485CTRL_DCTRL_Msk             (0x01UL << UART1_RS485CTRL_DCTRL_Pos)                   /*!< UART1 RS485CTRL: DCTRL Mask             */
#define UART1_RS485CTRL_OINV_Pos              5                                                       /*!< UART1 RS485CTRL: OINV Position          */
#define UART1_RS485CTRL_OINV_Msk              (0x01UL << UART1_RS485CTRL_OINV_Pos)                    /*!< UART1 RS485CTRL: OINV Mask              */

