MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ----------------------------------  SSPn_RIS  ---------------------------------- */
#define SSPn_RIS_RORRIS_Pos                   0                                                       /*!< SSPn RIS: RORRIS Position               */
#define SSPn_RIS_RORRIS_Msk                   (0x01UL << SSPn_RIS_RORRIS_Pos)                         /*!< SSPn RIS: RORRIS Mask                   */
#define SSPn_RIS_RTRIS_Pos                    1                                                       /*!< SSPn RIS: RTRIS Position                */
#define SSPn_RIS_RTRIS_Msk                    (0x01UL << SSPn_RIS_RTRIS_Pos)                          /*!< SSPn RIS: RTRIS Mask                    */
#define SSPn_RIS_RXRIS_Pos                    2                                                       /*!< SSPn RIS: RXRIS Position                */
#define SSPn_RIS_RXRIS_Msk                    (0x01UL << SSPn_RIS_RXRIS_Pos)                          /*!< SSPn RIS: RXRIS Mask                    */
#define SSPn_RIS_TXRIS_Pos                    3                                                       /*!< SSPn RIS: TXRIS Position                */
#define SSPn_RIS_TXRIS_Msk                    (0x01UL << SSPn_RIS_TXRIS_Pos)                          /*!< SSPn RIS: TXRIS Mask                    */

/* ----------------------------------  SSPn_MIS  ---------------------------------- */
#define SSPn_MIS_RORMIS_Pos                   0                                                       /*!< SSPn MIS: RORMIS Position               */
#define SSPn_MIS_RORMIS_Msk                   (0x01UL << SSPn_MIS_RORMIS_Pos)                         /*!< SSPn MIS: RORMIS Mask                   */
#define SSPn_MIS_RTMIS_Pos                    1                                                       /*!< SSPn MIS: RTMIS Position                */
#define SSPn_MIS_RTMIS_Msk                    (0x01UL << SSPn_MIS_RTMIS_Pos)                          /*!< SSPn MIS: RTMIS Mask                    */
#define SSPn_MIS_RXMIS_Pos                    2                                                       /*!< SSPn MIS: RXMIS Position                */
#define SSPn_MIS_RXMIS_Msk                    (0x01UL << SSPn_MIS_RXMIS_Pos)                          /*!< SSPn MIS: RXMIS Mask                    */
#define SSPn_MIS_TXMIS_Pos                    3                                                       /*!< SSPn MIS: TXMIS Position                */
#define SSPn_MIS_TXMIS_Msk                    (0x01UL << SSPn_MIS_TXMIS_Pos)                          /*!< SSPn MIS: TXMIS Mask                    */

/* ----------------------------------  SSPn_ICR  ---------------------------------- */
#define SSPn_ICR_RORIC_Pos                    0                                                       /*!< SSPn ICR: RORIC Position                */
#define SSPn_ICR_RORIC_Msk                    (0x01UL << SSPn_ICR_RORIC_Pos)                          /*!< SSPn ICR: RORIC Mask                    */
#define SSPn_ICR_RTIC_Pos                     1                                                       /*!< SSPn ICR: RTIC Position                 */
#define SSPn_ICR_RTIC_Msk                     (0x01UL << SSPn_ICR_RTIC_Pos)                           /*!< SSPn ICR: RTIC Mask                     */

/* ---------------------------------  SSPn_DMACR  --------------------------------- */
#define SSPn_DMACR_RXDMAE_Pos                 0                                                       /*!< SSPn DMACR: RXDMAE Position             */
#define SSPn_DMACR_RXDMAE_Msk                 (0x01UL << SSPn_DMACR_RXDMAE_Pos)                       /*!< SSPn DMACR: RXDMAE Mask                 */
#define SSPn_DMACR_TXDMAE_Pos                 1                                                       /*!< SSPn DMACR: TXDMAE Position             */
#define SSPn_DMACR_TXDMAE_Msk                 (0x01UL << SSPn_DMACR_TXDMAE_Pos)                       /*!< SSPn DMACR: TXDMAE Mask                 */


/* ================================================================================ */
/* ================          struct 'SSP0' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------------  SSP0_CR0  ---------------------------------- */
#define SSP0_CR0_DSS_Pos                      0                                                       /*!< SSP0 CR0: DSS Position                  */
#define SSP0_CR0_DSS_Msk                      (0x0fUL << SSP0_CR0_DSS_Pos)                            /*!< SSP0 CR0: DSS Mask                      */
#define SSP0_CR0_FRF_Pos                      4                                                       /*!< SSP0 CR0: FRF Position                  */
#define SSP0_CR0_FRF_Msk                      (0x03UL << SSP0_CR0_FRF_Pos)                            /*!< SSP0 CR0: FRF Mask                      */
#define SSP0_CR0_CPOL_Pos                     6                                                       /*!< SSP0 CR0: CPOL Position                 */
#define SSP0_CR0_CPOL_Msk                     (0x01UL << SSP0_CR0_CPOL_Pos)                           /*!< SSP0 CR0: CPOL Mask                     */
#define SSP0_CR0_CPHA_Pos                     7                                                       /*!< SSP0 CR0: CPHA Position                 */
#define SSP0_CR0_CPHA_Msk                     (0x01UL << SSP0_CR0_CPHA_Pos)                           /*!< SSP0 CR0: CPHA Mask                     */
#define SSP0_CR0_SCR_Pos                      8                                                       /*!< SSP0 CR0: SCR Position                  */
#define SSP0_CR0_SCR_Msk                      (0x000000ffUL << SSP0_CR0_SCR_Pos)                      /*!< SSP0 CR0: SCR Mask                      */

/* ----------------------------------  SSP0_CR1  ---------------------------------- */
#define SSP0_CR1_LBM_Pos                      0                                                       /*!< SSP0 CR1: LBM Position                  */
#define SSP0_CR1_LBM_Msk                      (0x01UL << SSP0_CR1_LBM_Pos)                            /*!< SSP0 CR1: LBM Mask                      */
#define SSP0_CR1_SSE_Pos                      1                                                       /*!< SSP0 CR1: SSE Position                  */
#define SSP0_CR1_SSE_Msk                      (0x01UL << SSP0_CR1_SSE_Pos)                            /*!< SSP0 CR1: SSE Mask                      */
#define SSP0_CR1_MS_Pos                       2                                                       /*!< SSP0 CR1: MS Position                   */
#define SSP0_CR1_MS_Msk                       (0x01UL << SSP0_CR1_MS_Pos)                             /*!< SSP0 CR1: MS Mask                       */
#define SSP0_CR1_SOD_Pos                      3                                                       /*!< SSP0 CR1: SOD Position                  */
#define SSP0_CR1_SOD_Msk                      (0x01UL << SSP0_CR1_SOD_Pos)                            /*!< SSP0 CR1: SOD Mask                      */

/* -----------------------------------  SSP0_DR  ---------------------------------- */
#define SSP0_DR_DATA_Pos                      0                                                       /*!< SSP0 DR: DATA Position                  */
#define SSP0_DR_DATA_Msk                      (0x0000ffffUL << SSP0_DR_DATA_Pos)                      /*!< SSP0 DR: DATA Mask                      */

/* -----------------------------------  SSP0_SR  ---------------------------------- */
#define SSP0_SR_TFE_Pos                       0                                                       /*!< SSP0 SR: TFE Position                   */
#define SSP0_SR_TFE_Msk                       (0x01UL << SSP0_SR_TFE_Pos)                             /*!< SSP0 SR: TFE Mask                       */
#define SSP0_SR_TNF_Pos                       1                                                       /*!< SSP0 SR: TNF Position                   */
#define SSP0_SR_TNF_Msk                       (0x01UL << SSP0_SR_TNF_Pos)                             /*!< SSP0 SR: TNF Mask                       */
#define SSP0_SR_RNE_Pos                       2                                                       /*!< SSP0 SR: RNE Position                   */
#define SSP0_SR_RNE_Msk                       (0x01UL << SSP0_SR_RNE_Pos)                             /*!< SSP0 SR: RNE Mask                       */
#define SSP0_SR_RFF_Pos                       3                                                       /*!< SSP0 SR: RFF Position                   */
#define SSP0_SR_RFF_Msk                       (0x01UL << SSP0_SR_RFF_Pos)                             /*!< SSP0 SR: RFF Mask                       */
#define SSP0_SR_BSY_Pos                       4                                                       /*!< SSP0 SR: BSY Position                   */
#define SSP0_SR_BSY_Msk                       (0x01UL << SSP0_SR_BSY_Pos)                             /*!< SSP0 SR: BSY Mask                       */

/* ----------------------------------  SSP0_CPSR  --------------------------------- */
#define SSP0_CPSR_CPSDVSR_Pos                 0                                                       /*!< SSP0 CPSR: CPSDVSR Position             */
#define SSP0_CPSR_CPSDVSR_Msk                 (0x000000ffUL << SSP0_CPSR_CPSDVSR_Pos)                 /*!< SSP0 CPSR: CPSDVSR Mask                 */

/* ----------------------------------  SSP0_IMSC  --------------------------------- */
#define SSP0_IMSC_RORIM_Pos                   0                                                       /*!< SSP0 IMSC: RORIM Position               */
#define SSP0_IMSC_RORIM_Msk                   (0x01UL << SSP0_IMSC_RORIM_Pos)                         /*!< SSP0 IMSC: RORIM Mask                   */
#define SSP0_IMSC_RTIM_Pos                    1                                                       /*!< SSP0 IMSC: RTIM Position                */
#define SSP0_IMSC_RTIM_Msk                    (0x01UL << SSP0_IMSC_RTIM_Pos)                          /*!< SSP0 IMSC: RTIM Mask                    */
#define SSP0_IMSC_RXIM_Pos                    2                                                       /*!< SSP0 IMSC: RXIM Position                */
#define SSP0_IMSC_RXIM_Msk                    (0x01UL << SSP0_IMSC_RXIM_Pos)                          /*!< SSP0 IMSC: RXIM Mask                    */
#define SSP0_IMSC_TXIM_Pos                    3                                                       /*!< SSP0 IMSC: TXIM Position                */
#define SSP0_IMSC_TXIM_Msk                    (0x01UL << SSP0_IMSC_TXIM_Pos)                          /*!< SSP0 IMSC: TXIM Mask                    */

