MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  TIMER0_CR0  --------------------------------- */
#define TIMER0_CR0_CAP_Pos                    0                                                       /*!< TIMER0 CR0: CAP Position                */
#define TIMER0_CR0_CAP_Msk                    (0xffffffffUL << TIMER0_CR0_CAP_Pos)                    /*!< TIMER0 CR0: CAP Mask                    */

/* ---------------------------------  TIMER0_CR1  --------------------------------- */
#define TIMER0_CR1_CAP_Pos                    0                                                       /*!< TIMER0 CR1: CAP Position                */
#define TIMER0_CR1_CAP_Msk                    (0xffffffffUL << TIMER0_CR1_CAP_Pos)                    /*!< TIMER0 CR1: CAP Mask                    */

/* ---------------------------------  TIMER0_CR2  --------------------------------- */
#define TIMER0_CR2_CAP_Pos                    0                                                       /*!< TIMER0 CR2: CAP Position                */
#define TIMER0_CR2_CAP_Msk                    (0xffffffffUL << TIMER0_CR2_CAP_Pos)                    /*!< TIMER0 CR2: CAP Mask                    */

/* ---------------------------------  TIMER0_CR3  --------------------------------- */
#define TIMER0_CR3_CAP_Pos                    0                                                       /*!< TIMER0 CR3: CAP Position                */
#define TIMER0_CR3_CAP_Msk                    (0xffffffffUL << TIMER0_CR3_CAP_Pos)                    /*!< TIMER0 CR3: CAP Mask                    */

/* ---------------------------------  TIMER0_EMR  --------------------------------- */
#define TIMER0_EMR_EM0_Pos                    0                                                       /*!< TIMER0 EMR: EM0 Position                */
#define TIMER0_EMR_EM0_Msk                    (0x01UL << TIMER0_EMR_EM0_Pos)                          /*!< TIMER0 EMR: EM0 Mask                    */
#define TIMER0_EMR_EM1_Pos                    1                                                       /*!< TIMER0 EMR: EM1 Position                */
#define TIMER0_EMR_EM1_Msk                    (0x01UL << TIMER0_EMR_EM1_Pos)                          /*!< TIMER0 EMR: EM1 Mask                    */
#define TIMER0_EMR_EM2_Pos                    2                                                       /*!< TIMER0 EMR: EM2 Position                */
#define TIMER0_EMR_EM2_Msk                    (0x01UL << TIMER0_EMR_EM2_Pos)                          /*!< TIMER0 EMR: EM2 Mask                    */
#define TIMER0_EMR_EM3_Pos                    3                                                       /*!< TIMER0 EMR: EM3 Position                */
#define TIMER0_EMR_EM3_Msk                    (0x01UL << TIMER0_EMR_EM3_Pos)                          /*!< TIMER0 EMR: EM3 Mask                    */
#define TIMER0_EMR_EMC0_Pos                   4                                                       /*!< TIMER0 EMR: EMC0 Position               */
#define TIMER0_EMR_EMC0_Msk                   (0x03UL << TIMER0_EMR_EMC0_Pos)                         /*!< TIMER0 EMR: EMC0 Mask                   */
#define TIMER0_EMR_EMC1_Pos                   6                                                       /*!< TIMER0 EMR: EMC1 Position               */
#define TIMER0_EMR_EMC1_Msk                   (0x03UL << TIMER0_EMR_EMC1_Pos)                         /*!< TIMER0 EMR: EMC1 Mask                   */
#define TIMER0_EMR_EMC2_Pos                   8                                                       /*!< TIMER0 EMR: EMC2 Position               */
#define TIMER0_EMR_EMC2_Msk                   (0x03UL << TIMER0_EMR_EMC2_Pos)                         /*!< TIMER0 EMR: EMC2 Mask                   */
#define TIMER0_EMR_EMC3_Pos                   10                                                      /*!< TIMER0 EMR: EMC3 Position               */
#define TIMER0_EMR_EMC3_Msk                   (0x03UL << TIMER0_EMR_EMC3_Pos)                         /*!< TIMER0 EMR: EMC3 Mask                   */

/* ---------------------------------  TIMER0_CTCR  -------------------------------- */
#define TIMER0_CTCR_CTMODE_Pos                0                                                       /*!< TIMER0 CTCR: CTMODE Position            */
#define TIMER0_CTCR_CTMODE_Msk                (0x03UL << TIMER0_CTCR_CTMODE_Pos)                      /*!< TIMER0 CTCR: CTMODE Mask                */
#define TIMER0_CTCR_CINSEL_Pos                2                                                       /*!< TIMER0 CTCR: CINSEL Position            */
#define TIMER0_CTCR_CINSEL_Msk                (0x03UL << TIMER0_CTCR_CINSEL_Pos)                      /*!< TIMER0 CTCR: CINSEL Mask                */


/* ================================================================================ */
/* ================         struct 'TIMER1' Position & Mask        ================ */
/* ================================================================================ */


/* ----------------------------------  TIMER1_IR  --------------------------------- */
#define TIMER1_IR_MR0INT_Pos                  0                                                       /*!< TIMER1 IR: MR0INT Position              */
#define TIMER1_IR_MR0INT_Msk                  (0x01UL << TIMER1_IR_MR0INT_Pos)                        /*!< TIMER1 IR: MR0INT Mask                  */
#define TIMER1_IR_MR1INT_Pos                  1                                                       /*!< TIMER1 IR: MR1INT Position              */
#define TIMER1_IR_MR1INT_Msk                  (0x01UL << TIMER1_IR_MR1INT_Pos)                        /*!< TIMER1 IR: MR1INT Mask                  */
#define TIMER1_IR_MR2INT_Pos                  2                                                       /*!< TIMER1 IR: MR2INT Position              */
#define TIMER1_IR_MR2INT_Msk                  (0x01UL << TIMER1_IR_MR2INT_Pos)                        /*!< TIMER1 IR: MR2INT Mask                  */
#define TIMER1_IR_MR3INT_Pos                  3                                                       /*!< TIMER1 IR: MR3INT Position              */
#define TIMER1_IR_MR3INT_Msk                  (0x01UL << TIMER1_IR_MR3INT_Pos)                        /*!< TIMER1 IR: MR3INT Mask                  */
#define TIMER1_IR_CR0INT_Pos                  4                                                       /*!< TIMER1 IR: CR0INT Position              */
#define TIMER1_IR_CR0INT_Msk                  (0x01UL << TIMER1_IR_CR0INT_Pos)                        /*!< TIMER1 IR: CR0INT Mask                  */
#define TIMER1_IR_CR1INT_Pos                  5                                                       /*!< TIMER1 IR: CR1INT Position              */
#define TIMER1_IR_CR1INT_Msk                  (0x01UL << TIMER1_IR_CR1INT_Pos)                        /*!< TIMER1 IR: CR1INT Mask                  */
#define TIMER1_IR_CR2INT_Pos                  6                                                       /*!< TIMER1 IR: CR2INT Position              */
#define TIMER1_IR_CR2INT_Msk                  (0x01UL << TIMER1_IR_CR2INT_Pos)                        /*!< TIMER1 IR: CR2INT Mask                  */
#define TIMER1_IR_CR3INT_Pos                  7                                                       /*!< TIMER1 IR: CR3INT Position              */
#define TIMER1_IR_CR3INT_Msk                  (0x01UL << TIMER1_IR_CR3INT_Pos)                        /*!< TIMER1 IR: CR3INT Mask                  */

