MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  TIMER1_TCR  --------------------------------- */
#define TIMER1_TCR_CEN_Pos                    0                                                       /*!< TIMER1 TCR: CEN Position                */
#define TIMER1_TCR_CEN_Msk                    (0x01UL << TIMER1_TCR_CEN_Pos)                          /*!< TIMER1 TCR: CEN Mask                    */
#define TIMER1_TCR_CRST_Pos                   1                                                       /*!< TIMER1 TCR: CRST Position               */
#define TIMER1_TCR_CRST_Msk                   (0x01UL << TIMER1_TCR_CRST_Pos)                         /*!< TIMER1 TCR: CRST Mask                   */

/* ----------------------------------  TIMER1_TC  --------------------------------- */
#define TIMER1_TC_TC_Pos                      0                                                       /*!< TIMER1 TC: TC Position                  */
#define TIMER1_TC_TC_Msk                      (0xffffffffUL << TIMER1_TC_TC_Pos)                      /*!< TIMER1 TC: TC Mask                      */

/* ----------------------------------  TIMER1_PR  --------------------------------- */
#define TIMER1_PR_PM_Pos                      0                                                       /*!< TIMER1 PR: PM Position                  */
#define TIMER1_PR_PM_Msk                      (0xffffffffUL << TIMER1_PR_PM_Pos)                      /*!< TIMER1 PR: PM Mask                      */

/* ----------------------------------  TIMER1_PC  --------------------------------- */
#define TIMER1_PC_PC_Pos                      0                                                       /*!< TIMER1 PC: PC Position                  */
#define TIMER1_PC_PC_Msk                      (0xffffffffUL << TIMER1_PC_PC_Pos)                      /*!< TIMER1 PC: PC Mask                      */

/* ---------------------------------  TIMER1_MCR  --------------------------------- */
#define TIMER1_MCR_MR0I_Pos                   0                                                       /*!< TIMER1 MCR: MR0I Position               */
#define TIMER1_MCR_MR0I_Msk                   (0x01UL << TIMER1_MCR_MR0I_Pos)                         /*!< TIMER1 MCR: MR0I Mask                   */
#define TIMER1_MCR_MR0R_Pos                   1                                                       /*!< TIMER1 MCR: MR0R Position               */
#define TIMER1_MCR_MR0R_Msk                   (0x01UL << TIMER1_MCR_MR0R_Pos)                         /*!< TIMER1 MCR: MR0R Mask                   */
#define TIMER1_MCR_MR0S_Pos                   2                                                       /*!< TIMER1 MCR: MR0S Position               */
#define TIMER1_MCR_MR0S_Msk                   (0x01UL << TIMER1_MCR_MR0S_Pos)                         /*!< TIMER1 MCR: MR0S Mask                   */
#define TIMER1_MCR_MR1I_Pos                   3                                                       /*!< TIMER1 MCR: MR1I Position               */
#define TIMER1_MCR_MR1I_Msk                   (0x01UL << TIMER1_MCR_MR1I_Pos)                         /*!< TIMER1 MCR: MR1I Mask                   */
#define TIMER1_MCR_MR1R_Pos                   4                                                       /*!< TIMER1 MCR: MR1R Position               */
#define TIMER1_MCR_MR1R_Msk                   (0x01UL << TIMER1_MCR_MR1R_Pos)                         /*!< TIMER1 MCR: MR1R Mask                   */
#define TIMER1_MCR_MR1S_Pos                   5                                                       /*!< TIMER1 MCR: MR1S Position               */
#define TIMER1_MCR_MR1S_Msk                   (0x01UL << TIMER1_MCR_MR1S_Pos)                         /*!< TIMER1 MCR: MR1S Mask                   */
#define TIMER1_MCR_MR2I_Pos                   6                                                       /*!< TIMER1 MCR: MR2I Position               */
#define TIMER1_MCR_MR2I_Msk                   (0x01UL << TIMER1_MCR_MR2I_Pos)                         /*!< TIMER1 MCR: MR2I Mask                   */
#define TIMER1_MCR_MR2R_Pos                   7                                                       /*!< TIMER1 MCR: MR2R Position               */
#define TIMER1_MCR_MR2R_Msk                   (0x01UL << TIMER1_MCR_MR2R_Pos)                         /*!< TIMER1 MCR: MR2R Mask                   */
#define TIMER1_MCR_MR2S_Pos                   8                                                       /*!< TIMER1 MCR: MR2S Position               */
#define TIMER1_MCR_MR2S_Msk                   (0x01UL << TIMER1_MCR_MR2S_Pos)                         /*!< TIMER1 MCR: MR2S Mask                   */
#define TIMER1_MCR_MR3I_Pos                   9                                                       /*!< TIMER1 MCR: MR3I Position               */
#define TIMER1_MCR_MR3I_Msk                   (0x01UL << TIMER1_MCR_MR3I_Pos)                         /*!< TIMER1 MCR: MR3I Mask                   */
#define TIMER1_MCR_MR3R_Pos                   10                                                      /*!< TIMER1 MCR: MR3R Position               */
#define TIMER1_MCR_MR3R_Msk                   (0x01UL << TIMER1_MCR_MR3R_Pos)                         /*!< TIMER1 MCR: MR3R Mask                   */
#define TIMER1_MCR_MR3S_Pos                   11                                                      /*!< TIMER1 MCR: MR3S Position               */
#define TIMER1_MCR_MR3S_Msk                   (0x01UL << TIMER1_MCR_MR3S_Pos)                         /*!< TIMER1 MCR: MR3S Mask                   */

/* ---------------------------------  TIMER1_MR0  --------------------------------- */
#define TIMER1_MR0_MATCH_Pos                  0                                                       /*!< TIMER1 MR0: MATCH Position              */
#define TIMER1_MR0_MATCH_Msk                  (0xffffffffUL << TIMER1_MR0_MATCH_Pos)                  /*!< TIMER1 MR0: MATCH Mask                  */

/* ---------------------------------  TIMER1_MR1  --------------------------------- */
#define TIMER1_MR1_MATCH_Pos                  0                                                       /*!< TIMER1 MR1: MATCH Position              */
#define TIMER1_MR1_MATCH_Msk                  (0xffffffffUL << TIMER1_MR1_MATCH_Pos)                  /*!< TIMER1 MR1: MATCH Mask                  */

