MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  TIMER1_MR2  --------------------------------- */
#define TIMER1_MR2_MATCH_Pos                  0                                                       /*!< TIMER1 MR2: MATCH Position              */
#define TIMER1_MR2_MATCH_Msk                  (0xffffffffUL << TIMER1_MR2_MATCH_Pos)                  /*!< TIMER1 MR2: MATCH Mask                  */

/* ---------------------------------  TIMER1_MR3  --------------------------------- */
#define TIMER1_MR3_MATCH_Pos                  0                                                       /*!< TIMER1 MR3: MATCH Position              */
#define TIMER1_MR3_MATCH_Msk                  (0xffffffffUL << TIMER1_MR3_MATCH_Pos)                  /*!< TIMER1 MR3: MATCH Mask                  */

/* ---------------------------------  TIMER1_CCR  --------------------------------- */
#define TIMER1_CCR_CAP0RE_Pos                 0                                                       /*!< TIMER1 CCR: CAP0RE Position             */
#define TIMER1_CCR_CAP0RE_Msk                 (0x01UL << TIMER1_CCR_CAP0RE_Pos)                       /*!< TIMER1 CCR: CAP0RE Mask                 */
#define TIMER1_CCR_CAP0FE_Pos                 1                                                       /*!< TIMER1 CCR: CAP0FE Position             */
#define TIMER1_CCR_CAP0FE_Msk                 (0x01UL << TIMER1_CCR_CAP0FE_Pos)                       /*!< TIMER1 CCR: CAP0FE Mask                 */
#define TIMER1_CCR_CAP0I_Pos                  2                                                       /*!< TIMER1 CCR: CAP0I Position              */
#define TIMER1_CCR_CAP0I_Msk                  (0x01UL << TIMER1_CCR_CAP0I_Pos)                        /*!< TIMER1 CCR: CAP0I Mask                  */
#define TIMER1_CCR_CAP1RE_Pos                 3                                                       /*!< TIMER1 CCR: CAP1RE Position             */
#define TIMER1_CCR_CAP1RE_Msk                 (0x01UL << TIMER1_CCR_CAP1RE_Pos)                       /*!< TIMER1 CCR: CAP1RE Mask                 */
#define TIMER1_CCR_CAP1FE_Pos                 4                                                       /*!< TIMER1 CCR: CAP1FE Position             */
#define TIMER1_CCR_CAP1FE_Msk                 (0x01UL << TIMER1_CCR_CAP1FE_Pos)                       /*!< TIMER1 CCR: CAP1FE Mask                 */
#define TIMER1_CCR_CAP1I_Pos                  5                                                       /*!< TIMER1 CCR: CAP1I Position              */
#define TIMER1_CCR_CAP1I_Msk                  (0x01UL << TIMER1_CCR_CAP1I_Pos)                        /*!< TIMER1 CCR: CAP1I Mask                  */
#define TIMER1_CCR_CAP2RE_Pos                 6                                                       /*!< TIMER1 CCR: CAP2RE Position             */
#define TIMER1_CCR_CAP2RE_Msk                 (0x01UL << TIMER1_CCR_CAP2RE_Pos)                       /*!< TIMER1 CCR: CAP2RE Mask                 */
#define TIMER1_CCR_CAP2FE_Pos                 7                                                       /*!< TIMER1 CCR: CAP2FE Position             */
#define TIMER1_CCR_CAP2FE_Msk                 (0x01UL << TIMER1_CCR_CAP2FE_Pos)                       /*!< TIMER1 CCR: CAP2FE Mask                 */
#define TIMER1_CCR_CAP2I_Pos                  8                                                       /*!< TIMER1 CCR: CAP2I Position              */
#define TIMER1_CCR_CAP2I_Msk                  (0x01UL << TIMER1_CCR_CAP2I_Pos)                        /*!< TIMER1 CCR: CAP2I Mask                  */
#define TIMER1_CCR_CAP3RE_Pos                 9                                                       /*!< TIMER1 CCR: CAP3RE Position             */
#define TIMER1_CCR_CAP3RE_Msk                 (0x01UL << TIMER1_CCR_CAP3RE_Pos)                       /*!< TIMER1 CCR: CAP3RE Mask                 */
#define TIMER1_CCR_CAP3FE_Pos                 10                                                      /*!< TIMER1 CCR: CAP3FE Position             */
#define TIMER1_CCR_CAP3FE_Msk                 (0x01UL << TIMER1_CCR_CAP3FE_Pos)                       /*!< TIMER1 CCR: CAP3FE Mask                 */
#define TIMER1_CCR_CAP3I_Pos                  11                                                      /*!< TIMER1 CCR: CAP3I Position              */
#define TIMER1_CCR_CAP3I_Msk                  (0x01UL << TIMER1_CCR_CAP3I_Pos)                        /*!< TIMER1 CCR: CAP3I Mask                  */

/* ---------------------------------  TIMER1_CR0  --------------------------------- */
#define TIMER1_CR0_CAP_Pos                    0                                                       /*!< TIMER1 CR0: CAP Position                */
#define TIMER1_CR0_CAP_Msk                    (0xffffffffUL << TIMER1_CR0_CAP_Pos)                    /*!< TIMER1 CR0: CAP Mask                    */

/* ---------------------------------  TIMER1_CR1  --------------------------------- */
#define TIMER1_CR1_CAP_Pos                    0                                                       /*!< TIMER1 CR1: CAP Position                */
#define TIMER1_CR1_CAP_Msk                    (0xffffffffUL << TIMER1_CR1_CAP_Pos)                    /*!< TIMER1 CR1: CAP Mask                    */

/* ---------------------------------  TIMER1_CR2  --------------------------------- */
#define TIMER1_CR2_CAP_Pos                    0                                                       /*!< TIMER1 CR2: CAP Position                */
#define TIMER1_CR2_CAP_Msk                    (0xffffffffUL << TIMER1_CR2_CAP_Pos)                    /*!< TIMER1 CR2: CAP Mask                    */

/* ---------------------------------  TIMER1_CR3  --------------------------------- */
#define TIMER1_CR3_CAP_Pos                    0                                                       /*!< TIMER1 CR3: CAP Position                */
#define TIMER1_CR3_CAP_Msk                    (0xffffffffUL << TIMER1_CR3_CAP_Pos)                    /*!< TIMER1 CR3: CAP Mask                    */

/* ---------------------------------  TIMER1_EMR  --------------------------------- */
#define TIMER1_EMR_EM0_Pos                    0                                                       /*!< TIMER1 EMR: EM0 Position                */
#define TIMER1_EMR_EM0_Msk                    (0x01UL << TIMER1_EMR_EM0_Pos)                          /*!< TIMER1 EMR: EM0 Mask                    */
#define TIMER1_EMR_EM1_Pos                    1                                                       /*!< TIMER1 EMR: EM1 Position                */
#define TIMER1_EMR_EM1_Msk                    (0x01UL << TIMER1_EMR_EM1_Pos)                          /*!< TIMER1 EMR: EM1 Mask                    */
#define TIMER1_EMR_EM2_Pos                    2                                                       /*!< TIMER1 EMR: EM2 Position                */
#define TIMER1_EMR_EM2_Msk                    (0x01UL << TIMER1_EMR_EM2_Pos)                          /*!< TIMER1 EMR: EM2 Mask                    */
#define TIMER1_EMR_EM3_Pos                    3                                                       /*!< TIMER1 EMR: EM3 Position                */
#define TIMER1_EMR_EM3_Msk                    (0x01UL << TIMER1_EMR_EM3_Pos)                          /*!< TIMER1 EMR: EM3 Mask                    */
#define TIMER1_EMR_EMC0_Pos                   4                                                       /*!< TIMER1 EMR: EMC0 Position               */
#define TIMER1_EMR_EMC0_Msk                   (0x03UL << TIMER1_EMR_EMC0_Pos)                         /*!< TIMER1 EMR: EMC0 Mask                   */
#define TIMER1_EMR_EMC1_Pos                   6                                                       /*!< TIMER1 EMR: EMC1 Position               */
#define TIMER1_EMR_EMC1_Msk                   (0x03UL << TIMER1_EMR_EMC1_Pos)                         /*!< TIMER1 EMR: EMC1 Mask                   */
#define TIMER1_EMR_EMC2_Pos                   8                                                       /*!< TIMER1 EMR: EMC2 Position               */
#define TIMER1_EMR_EMC2_Msk                   (0x03UL << TIMER1_EMR_EMC2_Pos)                         /*!< TIMER1 EMR: EMC2 Mask                   */
#define TIMER1_EMR_EMC3_Pos                   10                                                      /*!< TIMER1 EMR: EMC3 Position               */
#define TIMER1_EMR_EMC3_Msk                   (0x03UL << TIMER1_EMR_EMC3_Pos)                         /*!< TIMER1 EMR: EMC3 Mask                   */

/* ---------------------------------  TIMER1_CTCR  -------------------------------- */
#define TIMER1_CTCR_CTMODE_Pos                0                                                       /*!< TIMER1 CTCR: CTMODE Position            */
#define TIMER1_CTCR_CTMODE_Msk                (0x03UL << TIMER1_CTCR_CTMODE_Pos)                      /*!< TIMER1 CTCR: CTMODE Mask                */
#define TIMER1_CTCR_CINSEL_Pos                2                                                       /*!< TIMER1 CTCR: CINSEL Position            */
#define TIMER1_CTCR_CINSEL_Msk                (0x03UL << TIMER1_CTCR_CINSEL_Pos)                      /*!< TIMER1 CTCR: CINSEL Mask                */


/* ================================================================================ */
/* ================         struct 'TIMER2' Position & Mask        ================ */
/* ================================================================================ */


