MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ----------------------------------  TIMER2_IR  --------------------------------- */
#define TIMER2_IR_MR0INT_Pos                  0                                                       /*!< TIMER2 IR: MR0INT Position              */
#define TIMER2_IR_MR0INT_Msk                  (0x01UL << TIMER2_IR_MR0INT_Pos)                        /*!< TIMER2 IR: MR0INT Mask                  */
#define TIMER2_IR_MR1INT_Pos                  1                                                       /*!< TIMER2 IR: MR1INT Position              */
#define TIMER2_IR_MR1INT_Msk                  (0x01UL << TIMER2_IR_MR1INT_Pos)                        /*!< TIMER2 IR: MR1INT Mask                  */
#define TIMER2_IR_MR2INT_Pos                  2                                                       /*!< TIMER2 IR: MR2INT Position              */
#define TIMER2_IR_MR2INT_Msk                  (0x01UL << TIMER2_IR_MR2INT_Pos)                        /*!< TIMER2 IR: MR2INT Mask                  */
#define TIMER2_IR_MR3INT_Pos                  3                                                       /*!< TIMER2 IR: MR3INT Position              */
#define TIMER2_IR_MR3INT_Msk                  (0x01UL << TIMER2_IR_MR3INT_Pos)                        /*!< TIMER2 IR: MR3INT Mask                  */
#define TIMER2_IR_CR0INT_Pos                  4                                                       /*!< TIMER2 IR: CR0INT Position              */
#define TIMER2_IR_CR0INT_Msk                  (0x01UL << TIMER2_IR_CR0INT_Pos)                        /*!< TIMER2 IR: CR0INT Mask                  */
#define TIMER2_IR_CR1INT_Pos                  5                                                       /*!< TIMER2 IR: CR1INT Position              */
#define TIMER2_IR_CR1INT_Msk                  (0x01UL << TIMER2_IR_CR1INT_Pos)                        /*!< TIMER2 IR: CR1INT Mask                  */
#define TIMER2_IR_CR2INT_Pos                  6                                                       /*!< TIMER2 IR: CR2INT Position              */
#define TIMER2_IR_CR2INT_Msk                  (0x01UL << TIMER2_IR_CR2INT_Pos)                        /*!< TIMER2 IR: CR2INT Mask                  */
#define TIMER2_IR_CR3INT_Pos                  7                                                       /*!< TIMER2 IR: CR3INT Position              */
#define TIMER2_IR_CR3INT_Msk                  (0x01UL << TIMER2_IR_CR3INT_Pos)                        /*!< TIMER2 IR: CR3INT Mask                  */

/* ---------------------------------  TIMER2_TCR  --------------------------------- */
#define TIMER2_TCR_CEN_Pos                    0                                                       /*!< TIMER2 TCR: CEN Position                */
#define TIMER2_TCR_CEN_Msk                    (0x01UL << TIMER2_TCR_CEN_Pos)                          /*!< TIMER2 TCR: CEN Mask                    */
#define TIMER2_TCR_CRST_Pos                   1                                                       /*!< TIMER2 TCR: CRST Position               */
#define TIMER2_TCR_CRST_Msk                   (0x01UL << TIMER2_TCR_CRST_Pos)                         /*!< TIMER2 TCR: CRST Mask                   */

/* ----------------------------------  TIMER2_TC  --------------------------------- */
#define TIMER2_TC_TC_Pos                      0                                                       /*!< TIMER2 TC: TC Position                  */
#define TIMER2_TC_TC_Msk                      (0xffffffffUL << TIMER2_TC_TC_Pos)                      /*!< TIMER2 TC: TC Mask                      */

/* ----------------------------------  TIMER2_PR  --------------------------------- */
#define TIMER2_PR_PM_Pos                      0                                                       /*!< TIMER2 PR: PM Position                  */
#define TIMER2_PR_PM_Msk                      (0xffffffffUL << TIMER2_PR_PM_Pos)                      /*!< TIMER2 PR: PM Mask                      */

/* ----------------------------------  TIMER2_PC  --------------------------------- */
#define TIMER2_PC_PC_Pos                      0                                                       /*!< TIMER2 PC: PC Position                  */
#define TIMER2_PC_PC_Msk                      (0xffffffffUL << TIMER2_PC_PC_Pos)                      /*!< TIMER2 PC: PC Mask                      */

/* ---------------------------------  TIMER2_MCR  --------------------------------- */
#define TIMER2_MCR_MR0I_Pos                   0                                                       /*!< TIMER2 MCR: MR0I Position               */
#define TIMER2_MCR_MR0I_Msk                   (0x01UL << TIMER2_MCR_MR0I_Pos)                         /*!< TIMER2 MCR: MR0I Mask                   */
#define TIMER2_MCR_MR0R_Pos                   1                                                       /*!< TIMER2 MCR: MR0R Position               */
#define TIMER2_MCR_MR0R_Msk                   (0x01UL << TIMER2_MCR_MR0R_Pos)                         /*!< TIMER2 MCR: MR0R Mask                   */
#define TIMER2_MCR_MR0S_Pos                   2                                                       /*!< TIMER2 MCR: MR0S Position               */
#define TIMER2_MCR_MR0S_Msk                   (0x01UL << TIMER2_MCR_MR0S_Pos)                         /*!< TIMER2 MCR: MR0S Mask                   */
#define TIMER2_MCR_MR1I_Pos                   3                                                       /*!< TIMER2 MCR: MR1I Position               */
#define TIMER2_MCR_MR1I_Msk                   (0x01UL << TIMER2_MCR_MR1I_Pos)                         /*!< TIMER2 MCR: MR1I Mask                   */
#define TIMER2_MCR_MR1R_Pos                   4                                                       /*!< TIMER2 MCR: MR1R Position               */
#define TIMER2_MCR_MR1R_Msk                   (0x01UL << TIMER2_MCR_MR1R_Pos)                         /*!< TIMER2 MCR: MR1R Mask                   */
#define TIMER2_MCR_MR1S_Pos                   5                                                       /*!< TIMER2 MCR: MR1S Position               */
#define TIMER2_MCR_MR1S_Msk                   (0x01UL << TIMER2_MCR_MR1S_Pos)                         /*!< TIMER2 MCR: MR1S Mask                   */
#define TIMER2_MCR_MR2I_Pos                   6                                                       /*!< TIMER2 MCR: MR2I Position               */
#define TIMER2_MCR_MR2I_Msk                   (0x01UL << TIMER2_MCR_MR2I_Pos)                         /*!< TIMER2 MCR: MR2I Mask                   */
#define TIMER2_MCR_MR2R_Pos                   7                                                       /*!< TIMER2 MCR: MR2R Position               */
#define TIMER2_MCR_MR2R_Msk                   (0x01UL << TIMER2_MCR_MR2R_Pos)                         /*!< TIMER2 MCR: MR2R Mask                   */
#define TIMER2_MCR_MR2S_Pos                   8                                                       /*!< TIMER2 MCR: MR2S Position               */
#define TIMER2_MCR_MR2S_Msk                   (0x01UL << TIMER2_MCR_MR2S_Pos)                         /*!< TIMER2 MCR: MR2S Mask                   */
#define TIMER2_MCR_MR3I_Pos                   9                                                       /*!< TIMER2 MCR: MR3I Position               */
#define TIMER2_MCR_MR3I_Msk                   (0x01UL << TIMER2_MCR_MR3I_Pos)                         /*!< TIMER2 MCR: MR3I Mask                   */
#define TIMER2_MCR_MR3R_Pos                   10                                                      /*!< TIMER2 MCR: MR3R Position               */
#define TIMER2_MCR_MR3R_Msk                   (0x01UL << TIMER2_MCR_MR3R_Pos)                         /*!< TIMER2 MCR: MR3R Mask                   */
#define TIMER2_MCR_MR3S_Pos                   11                                                      /*!< TIMER2 MCR: MR3S Position               */
#define TIMER2_MCR_MR3S_Msk                   (0x01UL << TIMER2_MCR_MR3S_Pos)                         /*!< TIMER2 MCR: MR3S Mask                   */

/* ---------------------------------  TIMER2_MR0  --------------------------------- */
#define TIMER2_MR0_MATCH_Pos                  0                                                       /*!< TIMER2 MR0: MATCH Position              */
#define TIMER2_MR0_MATCH_Msk                  (0xffffffffUL << TIMER2_MR0_MATCH_Pos)                  /*!< TIMER2 MR0: MATCH Mask                  */

/* ---------------------------------  TIMER2_MR1  --------------------------------- */
#define TIMER2_MR1_MATCH_Pos                  0                                                       /*!< TIMER2 MR1: MATCH Position              */
#define TIMER2_MR1_MATCH_Msk                  (0xffffffffUL << TIMER2_MR1_MATCH_Pos)                  /*!< TIMER2 MR1: MATCH Mask                  */

/* ---------------------------------  TIMER2_MR2  --------------------------------- */
#define TIMER2_MR2_MATCH_Pos                  0                                                       /*!< TIMER2 MR2: MATCH Position              */
#define TIMER2_MR2_MATCH_Msk                  (0xffffffffUL << TIMER2_MR2_MATCH_Pos)                  /*!< TIMER2 MR2: MATCH Mask                  */

