MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  TIMER3_CR1  --------------------------------- */
#define TIMER3_CR1_CAP_Pos                    0                                                       /*!< TIMER3 CR1: CAP Position                */
#define TIMER3_CR1_CAP_Msk                    (0xffffffffUL << TIMER3_CR1_CAP_Pos)                    /*!< TIMER3 CR1: CAP Mask                    */

/* ---------------------------------  TIMER3_CR2  --------------------------------- */
#define TIMER3_CR2_CAP_Pos                    0                                                       /*!< TIMER3 CR2: CAP Position                */
#define TIMER3_CR2_CAP_Msk                    (0xffffffffUL << TIMER3_CR2_CAP_Pos)                    /*!< TIMER3 CR2: CAP Mask                    */

/* ---------------------------------  TIMER3_CR3  --------------------------------- */
#define TIMER3_CR3_CAP_Pos                    0                                                       /*!< TIMER3 CR3: CAP Position                */
#define TIMER3_CR3_CAP_Msk                    (0xffffffffUL << TIMER3_CR3_CAP_Pos)                    /*!< TIMER3 CR3: CAP Mask                    */

/* ---------------------------------  TIMER3_EMR  --------------------------------- */
#define TIMER3_EMR_EM0_Pos                    0                                                       /*!< TIMER3 EMR: EM0 Position                */
#define TIMER3_EMR_EM0_Msk                    (0x01UL << TIMER3_EMR_EM0_Pos)                          /*!< TIMER3 EMR: EM0 Mask                    */
#define TIMER3_EMR_EM1_Pos                    1                                                       /*!< TIMER3 EMR: EM1 Position                */
#define TIMER3_EMR_EM1_Msk                    (0x01UL << TIMER3_EMR_EM1_Pos)                          /*!< TIMER3 EMR: EM1 Mask                    */
#define TIMER3_EMR_EM2_Pos                    2                                                       /*!< TIMER3 EMR: EM2 Position                */
#define TIMER3_EMR_EM2_Msk                    (0x01UL << TIMER3_EMR_EM2_Pos)                          /*!< TIMER3 EMR: EM2 Mask                    */
#define TIMER3_EMR_EM3_Pos                    3                                                       /*!< TIMER3 EMR: EM3 Position                */
#define TIMER3_EMR_EM3_Msk                    (0x01UL << TIMER3_EMR_EM3_Pos)                          /*!< TIMER3 EMR: EM3 Mask                    */
#define TIMER3_EMR_EMC0_Pos                   4                                                       /*!< TIMER3 EMR: EMC0 Position               */
#define TIMER3_EMR_EMC0_Msk                   (0x03UL << TIMER3_EMR_EMC0_Pos)                         /*!< TIMER3 EMR: EMC0 Mask                   */
#define TIMER3_EMR_EMC1_Pos                   6                                                       /*!< TIMER3 EMR: EMC1 Position               */
#define TIMER3_EMR_EMC1_Msk                   (0x03UL << TIMER3_EMR_EMC1_Pos)                         /*!< TIMER3 EMR: EMC1 Mask                   */
#define TIMER3_EMR_EMC2_Pos                   8                                                       /*!< TIMER3 EMR: EMC2 Position               */
#define TIMER3_EMR_EMC2_Msk                   (0x03UL << TIMER3_EMR_EMC2_Pos)                         /*!< TIMER3 EMR: EMC2 Mask                   */
#define TIMER3_EMR_EMC3_Pos                   10                                                      /*!< TIMER3 EMR: EMC3 Position               */
#define TIMER3_EMR_EMC3_Msk                   (0x03UL << TIMER3_EMR_EMC3_Pos)                         /*!< TIMER3 EMR: EMC3 Mask                   */

/* ---------------------------------  TIMER3_CTCR  -------------------------------- */
#define TIMER3_CTCR_CTMODE_Pos                0                                                       /*!< TIMER3 CTCR: CTMODE Position            */
#define TIMER3_CTCR_CTMODE_Msk                (0x03UL << TIMER3_CTCR_CTMODE_Pos)                      /*!< TIMER3 CTCR: CTMODE Mask                */
#define TIMER3_CTCR_CINSEL_Pos                2                                                       /*!< TIMER3 CTCR: CINSEL Position            */
#define TIMER3_CTCR_CINSEL_Msk                (0x03UL << TIMER3_CTCR_CINSEL_Pos)                      /*!< TIMER3 CTCR: CINSEL Mask                */


/* ================================================================================ */
/* ================          struct 'SCU' Position & Mask          ================ */
/* ================================================================================ */


/* ---------------------------------  SCU_SFSP0_0  -------------------------------- */
#define SCU_SFSP0_0_MODE_Pos                  0                                                       /*!< SCU SFSP0_0: MODE Position              */
#define SCU_SFSP0_0_MODE_Msk                  (0x07UL << SCU_SFSP0_0_MODE_Pos)                        /*!< SCU SFSP0_0: MODE Mask                  */
#define SCU_SFSP0_0_EPD_Pos                   3                                                       /*!< SCU SFSP0_0: EPD Position               */
#define SCU_SFSP0_0_EPD_Msk                   (0x01UL << SCU_SFSP0_0_EPD_Pos)                         /*!< SCU SFSP0_0: EPD Mask                   */
#define SCU_SFSP0_0_EPUN_Pos                  4                                                       /*!< SCU SFSP0_0: EPUN Position              */
#define SCU_SFSP0_0_EPUN_Msk                  (0x01UL << SCU_SFSP0_0_EPUN_Pos)                        /*!< SCU SFSP0_0: EPUN Mask                  */
#define SCU_SFSP0_0_EHS_Pos                   5                                                       /*!< SCU SFSP0_0: EHS Position               */
#define SCU_SFSP0_0_EHS_Msk                   (0x01UL << SCU_SFSP0_0_EHS_Pos)                         /*!< SCU SFSP0_0: EHS Mask                   */
#define SCU_SFSP0_0_EZI_Pos                   6                                                       /*!< SCU SFSP0_0: EZI Position               */
#define SCU_SFSP0_0_EZI_Msk                   (0x01UL << SCU_SFSP0_0_EZI_Pos)                         /*!< SCU SFSP0_0: EZI Mask                   */
#define SCU_SFSP0_0_ZIF_Pos                   7                                                       /*!< SCU SFSP0_0: ZIF Position               */
#define SCU_SFSP0_0_ZIF_Msk                   (0x01UL << SCU_SFSP0_0_ZIF_Pos)                         /*!< SCU SFSP0_0: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP0_1  -------------------------------- */
#define SCU_SFSP0_1_MODE_Pos                  0                                                       /*!< SCU SFSP0_1: MODE Position              */
#define SCU_SFSP0_1_MODE_Msk                  (0x07UL << SCU_SFSP0_1_MODE_Pos)                        /*!< SCU SFSP0_1: MODE Mask                  */
#define SCU_SFSP0_1_EPD_Pos                   3                                                       /*!< SCU SFSP0_1: EPD Position               */
#define SCU_SFSP0_1_EPD_Msk                   (0x01UL << SCU_SFSP0_1_EPD_Pos)                         /*!< SCU SFSP0_1: EPD Mask                   */
#define SCU_SFSP0_1_EPUN_Pos                  4                                                       /*!< SCU SFSP0_1: EPUN Position              */
#define SCU_SFSP0_1_EPUN_Msk                  (0x01UL << SCU_SFSP0_1_EPUN_Pos)                        /*!< SCU SFSP0_1: EPUN Mask                  */
#define SCU_SFSP0_1_EHS_Pos                   5                                                       /*!< SCU SFSP0_1: EHS Position               */
#define SCU_SFSP0_1_EHS_Msk                   (0x01UL << SCU_SFSP0_1_EHS_Pos)                         /*!< SCU SFSP0_1: EHS Mask                   */
#define SCU_SFSP0_1_EZI_Pos                   6                                                       /*!< SCU SFSP0_1: EZI Position               */
#define SCU_SFSP0_1_EZI_Msk                   (0x01UL << SCU_SFSP0_1_EZI_Pos)                         /*!< SCU SFSP0_1: EZI Mask                   */
#define SCU_SFSP0_1_ZIF_Pos                   7                                                       /*!< SCU SFSP0_1: ZIF Position               */
#define SCU_SFSP0_1_ZIF_Msk                   (0x01UL << SCU_SFSP0_1_ZIF_Pos)                         /*!< SCU SFSP0_1: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP1_0  -------------------------------- */
#define SCU_SFSP1_0_MODE_Pos                  0                                                       /*!< SCU SFSP1_0: MODE Position              */
#define SCU_SFSP1_0_MODE_Msk                  (0x07UL << SCU_SFSP1_0_MODE_Pos)                        /*!< SCU SFSP1_0: MODE Mask                  */
#define SCU_SFSP1_0_EPD_Pos                   3                                                       /*!< SCU SFSP1_0: EPD Position               */
#define SCU_SFSP1_0_EPD_Msk                   (0x01UL << SCU_SFSP1_0_EPD_Pos)                         /*!< SCU SFSP1_0: EPD Mask                   */
#define SCU_SFSP1_0_EPUN_Pos                  4                                                       /*!< SCU SFSP1_0: EPUN Position              */
#define SCU_SFSP1_0_EPUN_Msk                  (0x01UL << SCU_SFSP1_0_EPUN_Pos)                        /*!< SCU SFSP1_0: EPUN Mask                  */
#define SCU_SFSP1_0_EHS_Pos                   5                                                       /*!< SCU SFSP1_0: EHS Position               */
#define SCU_SFSP1_0_EHS_Msk                   (0x01UL << SCU_SFSP1_0_EHS_Pos)                         /*!< SCU SFSP1_0: EHS Mask                   */
#define SCU_SFSP1_0_EZI_Pos                   6                                                       /*!< SCU SFSP1_0: EZI Position               */
#define SCU_SFSP1_0_EZI_Msk                   (0x01UL << SCU_SFSP1_0_EZI_Pos)                         /*!< SCU SFSP1_0: EZI Mask                   */
#define SCU_SFSP1_0_ZIF_Pos                   7                                                       /*!< SCU SFSP1_0: ZIF Position               */
#define SCU_SFSP1_0_ZIF_Msk                   (0x01UL << SCU_SFSP1_0_ZIF_Pos)                         /*!< SCU SFSP1_0: ZIF Mask                   */

