MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  SCU_SFSP1_6  -------------------------------- */
#define SCU_SFSP1_6_MODE_Pos                  0                                                       /*!< SCU SFSP1_6: MODE Position              */
#define SCU_SFSP1_6_MODE_Msk                  (0x07UL << SCU_SFSP1_6_MODE_Pos)                        /*!< SCU SFSP1_6: MODE Mask                  */
#define SCU_SFSP1_6_EPD_Pos                   3                                                       /*!< SCU SFSP1_6: EPD Position               */
#define SCU_SFSP1_6_EPD_Msk                   (0x01UL << SCU_SFSP1_6_EPD_Pos)                         /*!< SCU SFSP1_6: EPD Mask                   */
#define SCU_SFSP1_6_EPUN_Pos                  4                                                       /*!< SCU SFSP1_6: EPUN Position              */
#define SCU_SFSP1_6_EPUN_Msk                  (0x01UL << SCU_SFSP1_6_EPUN_Pos)                        /*!< SCU SFSP1_6: EPUN Mask                  */
#define SCU_SFSP1_6_EHS_Pos                   5                                                       /*!< SCU SFSP1_6: EHS Position               */
#define SCU_SFSP1_6_EHS_Msk                   (0x01UL << SCU_SFSP1_6_EHS_Pos)                         /*!< SCU SFSP1_6: EHS Mask                   */
#define SCU_SFSP1_6_EZI_Pos                   6                                                       /*!< SCU SFSP1_6: EZI Position               */
#define SCU_SFSP1_6_EZI_Msk                   (0x01UL << SCU_SFSP1_6_EZI_Pos)                         /*!< SCU SFSP1_6: EZI Mask                   */
#define SCU_SFSP1_6_ZIF_Pos                   7                                                       /*!< SCU SFSP1_6: ZIF Position               */
#define SCU_SFSP1_6_ZIF_Msk                   (0x01UL << SCU_SFSP1_6_ZIF_Pos)                         /*!< SCU SFSP1_6: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP1_7  -------------------------------- */
#define SCU_SFSP1_7_MODE_Pos                  0                                                       /*!< SCU SFSP1_7: MODE Position              */
#define SCU_SFSP1_7_MODE_Msk                  (0x07UL << SCU_SFSP1_7_MODE_Pos)                        /*!< SCU SFSP1_7: MODE Mask                  */
#define SCU_SFSP1_7_EPD_Pos                   3                                                       /*!< SCU SFSP1_7: EPD Position               */
#define SCU_SFSP1_7_EPD_Msk                   (0x01UL << SCU_SFSP1_7_EPD_Pos)                         /*!< SCU SFSP1_7: EPD Mask                   */
#define SCU_SFSP1_7_EPUN_Pos                  4                                                       /*!< SCU SFSP1_7: EPUN Position              */
#define SCU_SFSP1_7_EPUN_Msk                  (0x01UL << SCU_SFSP1_7_EPUN_Pos)                        /*!< SCU SFSP1_7: EPUN Mask                  */
#define SCU_SFSP1_7_EHS_Pos                   5                                                       /*!< SCU SFSP1_7: EHS Position               */
#define SCU_SFSP1_7_EHS_Msk                   (0x01UL << SCU_SFSP1_7_EHS_Pos)                         /*!< SCU SFSP1_7: EHS Mask                   */
#define SCU_SFSP1_7_EZI_Pos                   6                                                       /*!< SCU SFSP1_7: EZI Position               */
#define SCU_SFSP1_7_EZI_Msk                   (0x01UL << SCU_SFSP1_7_EZI_Pos)                         /*!< SCU SFSP1_7: EZI Mask                   */
#define SCU_SFSP1_7_ZIF_Pos                   7                                                       /*!< SCU SFSP1_7: ZIF Position               */
#define SCU_SFSP1_7_ZIF_Msk                   (0x01UL << SCU_SFSP1_7_ZIF_Pos)                         /*!< SCU SFSP1_7: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP1_8  -------------------------------- */
#define SCU_SFSP1_8_MODE_Pos                  0                                                       /*!< SCU SFSP1_8: MODE Position              */
#define SCU_SFSP1_8_MODE_Msk                  (0x07UL << SCU_SFSP1_8_MODE_Pos)                        /*!< SCU SFSP1_8: MODE Mask                  */
#define SCU_SFSP1_8_EPD_Pos                   3                                                       /*!< SCU SFSP1_8: EPD Position               */
#define SCU_SFSP1_8_EPD_Msk                   (0x01UL << SCU_SFSP1_8_EPD_Pos)                         /*!< SCU SFSP1_8: EPD Mask                   */
#define SCU_SFSP1_8_EPUN_Pos                  4                                                       /*!< SCU SFSP1_8: EPUN Position              */
#define SCU_SFSP1_8_EPUN_Msk                  (0x01UL << SCU_SFSP1_8_EPUN_Pos)                        /*!< SCU SFSP1_8: EPUN Mask                  */
#define SCU_SFSP1_8_EHS_Pos                   5                                                       /*!< SCU SFSP1_8: EHS Position               */
#define SCU_SFSP1_8_EHS_Msk                   (0x01UL << SCU_SFSP1_8_EHS_Pos)                         /*!< SCU SFSP1_8: EHS Mask                   */
#define SCU_SFSP1_8_EZI_Pos                   6                                                       /*!< SCU SFSP1_8: EZI Position               */
#define SCU_SFSP1_8_EZI_Msk                   (0x01UL << SCU_SFSP1_8_EZI_Pos)                         /*!< SCU SFSP1_8: EZI Mask                   */
#define SCU_SFSP1_8_ZIF_Pos                   7                                                       /*!< SCU SFSP1_8: ZIF Position               */
#define SCU_SFSP1_8_ZIF_Msk                   (0x01UL << SCU_SFSP1_8_ZIF_Pos)                         /*!< SCU SFSP1_8: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP1_9  -------------------------------- */
#define SCU_SFSP1_9_MODE_Pos                  0                                                       /*!< SCU SFSP1_9: MODE Position              */
#define SCU_SFSP1_9_MODE_Msk                  (0x07UL << SCU_SFSP1_9_MODE_Pos)                        /*!< SCU SFSP1_9: MODE Mask                  */
#define SCU_SFSP1_9_EPD_Pos                   3                                                       /*!< SCU SFSP1_9: EPD Position               */
#define SCU_SFSP1_9_EPD_Msk                   (0x01UL << SCU_SFSP1_9_EPD_Pos)                         /*!< SCU SFSP1_9: EPD Mask                   */
#define SCU_SFSP1_9_EPUN_Pos                  4                                                       /*!< SCU SFSP1_9: EPUN Position              */
#define SCU_SFSP1_9_EPUN_Msk                  (0x01UL << SCU_SFSP1_9_EPUN_Pos)                        /*!< SCU SFSP1_9: EPUN Mask                  */
#define SCU_SFSP1_9_EHS_Pos                   5                                                       /*!< SCU SFSP1_9: EHS Position               */
#define SCU_SFSP1_9_EHS_Msk                   (0x01UL << SCU_SFSP1_9_EHS_Pos)                         /*!< SCU SFSP1_9: EHS Mask                   */
#define SCU_SFSP1_9_EZI_Pos                   6                                                       /*!< SCU SFSP1_9: EZI Position               */
#define SCU_SFSP1_9_EZI_Msk                   (0x01UL << SCU_SFSP1_9_EZI_Pos)                         /*!< SCU SFSP1_9: EZI Mask                   */
#define SCU_SFSP1_9_ZIF_Pos                   7                                                       /*!< SCU SFSP1_9: ZIF Position               */
#define SCU_SFSP1_9_ZIF_Msk                   (0x01UL << SCU_SFSP1_9_ZIF_Pos)                         /*!< SCU SFSP1_9: ZIF Mask                   */

/* --------------------------------  SCU_SFSP1_10  -------------------------------- */
#define SCU_SFSP1_10_MODE_Pos                 0                                                       /*!< SCU SFSP1_10: MODE Position             */
#define SCU_SFSP1_10_MODE_Msk                 (0x07UL << SCU_SFSP1_10_MODE_Pos)                       /*!< SCU SFSP1_10: MODE Mask                 */
#define SCU_SFSP1_10_EPD_Pos                  3                                                       /*!< SCU SFSP1_10: EPD Position              */
#define SCU_SFSP1_10_EPD_Msk                  (0x01UL << SCU_SFSP1_10_EPD_Pos)                        /*!< SCU SFSP1_10: EPD Mask                  */
#define SCU_SFSP1_10_EPUN_Pos                 4                                                       /*!< SCU SFSP1_10: EPUN Position             */
#define SCU_SFSP1_10_EPUN_Msk                 (0x01UL << SCU_SFSP1_10_EPUN_Pos)                       /*!< SCU SFSP1_10: EPUN Mask                 */
#define SCU_SFSP1_10_EHS_Pos                  5                                                       /*!< SCU SFSP1_10: EHS Position              */
#define SCU_SFSP1_10_EHS_Msk                  (0x01UL << SCU_SFSP1_10_EHS_Pos)                        /*!< SCU SFSP1_10: EHS Mask                  */
#define SCU_SFSP1_10_EZI_Pos                  6                                                       /*!< SCU SFSP1_10: EZI Position              */
#define SCU_SFSP1_10_EZI_Msk                  (0x01UL << SCU_SFSP1_10_EZI_Pos)                        /*!< SCU SFSP1_10: EZI Mask                  */
#define SCU_SFSP1_10_ZIF_Pos                  7                                                       /*!< SCU SFSP1_10: ZIF Position              */
#define SCU_SFSP1_10_ZIF_Msk                  (0x01UL << SCU_SFSP1_10_ZIF_Pos)                        /*!< SCU SFSP1_10: ZIF Mask                  */

/* --------------------------------  SCU_SFSP1_11  -------------------------------- */
#define SCU_SFSP1_11_MODE_Pos                 0                                                       /*!< SCU SFSP1_11: MODE Position             */
#define SCU_SFSP1_11_MODE_Msk                 (0x07UL << SCU_SFSP1_11_MODE_Pos)                       /*!< SCU SFSP1_11: MODE Mask                 */
#define SCU_SFSP1_11_EPD_Pos                  3                                                       /*!< SCU SFSP1_11: EPD Position              */
#define SCU_SFSP1_11_EPD_Msk                  (0x01UL << SCU_SFSP1_11_EPD_Pos)                        /*!< SCU SFSP1_11: EPD Mask                  */
#define SCU_SFSP1_11_EPUN_Pos                 4                                                       /*!< SCU SFSP1_11: EPUN Position             */
#define SCU_SFSP1_11_EPUN_Msk                 (0x01UL << SCU_SFSP1_11_EPUN_Pos)                       /*!< SCU SFSP1_11: EPUN Mask                 */
#define SCU_SFSP1_11_EHS_Pos                  5                                                       /*!< SCU SFSP1_11: EHS Position              */
#define SCU_SFSP1_11_EHS_Msk                  (0x01UL << SCU_SFSP1_11_EHS_Pos)                        /*!< SCU SFSP1_11: EHS Mask                  */
#define SCU_SFSP1_11_EZI_Pos                  6                                                       /*!< SCU SFSP1_11: EZI Position              */
#define SCU_SFSP1_11_EZI_Msk                  (0x01UL << SCU_SFSP1_11_EZI_Pos)                        /*!< SCU SFSP1_11: EZI Mask                  */
#define SCU_SFSP1_11_ZIF_Pos                  7                                                       /*!< SCU SFSP1_11: ZIF Position              */
#define SCU_SFSP1_11_ZIF_Msk                  (0x01UL << SCU_SFSP1_11_ZIF_Pos)                        /*!< SCU SFSP1_11: ZIF Mask                  */

