MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  SCU_SFSP3_5  -------------------------------- */
#define SCU_SFSP3_5_MODE_Pos                  0                                                       /*!< SCU SFSP3_5: MODE Position              */
#define SCU_SFSP3_5_MODE_Msk                  (0x07UL << SCU_SFSP3_5_MODE_Pos)                        /*!< SCU SFSP3_5: MODE Mask                  */
#define SCU_SFSP3_5_EPD_Pos                   3                                                       /*!< SCU SFSP3_5: EPD Position               */
#define SCU_SFSP3_5_EPD_Msk                   (0x01UL << SCU_SFSP3_5_EPD_Pos)                         /*!< SCU SFSP3_5: EPD Mask                   */
#define SCU_SFSP3_5_EPUN_Pos                  4                                                       /*!< SCU SFSP3_5: EPUN Position              */
#define SCU_SFSP3_5_EPUN_Msk                  (0x01UL << SCU_SFSP3_5_EPUN_Pos)                        /*!< SCU SFSP3_5: EPUN Mask                  */
#define SCU_SFSP3_5_EHS_Pos                   5                                                       /*!< SCU SFSP3_5: EHS Position               */
#define SCU_SFSP3_5_EHS_Msk                   (0x01UL << SCU_SFSP3_5_EHS_Pos)                         /*!< SCU SFSP3_5: EHS Mask                   */
#define SCU_SFSP3_5_EZI_Pos                   6                                                       /*!< SCU SFSP3_5: EZI Position               */
#define SCU_SFSP3_5_EZI_Msk                   (0x01UL << SCU_SFSP3_5_EZI_Pos)                         /*!< SCU SFSP3_5: EZI Mask                   */
#define SCU_SFSP3_5_ZIF_Pos                   7                                                       /*!< SCU SFSP3_5: ZIF Position               */
#define SCU_SFSP3_5_ZIF_Msk                   (0x01UL << SCU_SFSP3_5_ZIF_Pos)                         /*!< SCU SFSP3_5: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP3_6  -------------------------------- */
#define SCU_SFSP3_6_MODE_Pos                  0                                                       /*!< SCU SFSP3_6: MODE Position              */
#define SCU_SFSP3_6_MODE_Msk                  (0x07UL << SCU_SFSP3_6_MODE_Pos)                        /*!< SCU SFSP3_6: MODE Mask                  */
#define SCU_SFSP3_6_EPD_Pos                   3                                                       /*!< SCU SFSP3_6: EPD Position               */
#define SCU_SFSP3_6_EPD_Msk                   (0x01UL << SCU_SFSP3_6_EPD_Pos)                         /*!< SCU SFSP3_6: EPD Mask                   */
#define SCU_SFSP3_6_EPUN_Pos                  4                                                       /*!< SCU SFSP3_6: EPUN Position              */
#define SCU_SFSP3_6_EPUN_Msk                  (0x01UL << SCU_SFSP3_6_EPUN_Pos)                        /*!< SCU SFSP3_6: EPUN Mask                  */
#define SCU_SFSP3_6_EHS_Pos                   5                                                       /*!< SCU SFSP3_6: EHS Position               */
#define SCU_SFSP3_6_EHS_Msk                   (0x01UL << SCU_SFSP3_6_EHS_Pos)                         /*!< SCU SFSP3_6: EHS Mask                   */
#define SCU_SFSP3_6_EZI_Pos                   6                                                       /*!< SCU SFSP3_6: EZI Position               */
#define SCU_SFSP3_6_EZI_Msk                   (0x01UL << SCU_SFSP3_6_EZI_Pos)                         /*!< SCU SFSP3_6: EZI Mask                   */
#define SCU_SFSP3_6_ZIF_Pos                   7                                                       /*!< SCU SFSP3_6: ZIF Position               */
#define SCU_SFSP3_6_ZIF_Msk                   (0x01UL << SCU_SFSP3_6_ZIF_Pos)                         /*!< SCU SFSP3_6: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP3_7  -------------------------------- */
#define SCU_SFSP3_7_MODE_Pos                  0                                                       /*!< SCU SFSP3_7: MODE Position              */
#define SCU_SFSP3_7_MODE_Msk                  (0x07UL << SCU_SFSP3_7_MODE_Pos)                        /*!< SCU SFSP3_7: MODE Mask                  */
#define SCU_SFSP3_7_EPD_Pos                   3                                                       /*!< SCU SFSP3_7: EPD Position               */
#define SCU_SFSP3_7_EPD_Msk                   (0x01UL << SCU_SFSP3_7_EPD_Pos)                         /*!< SCU SFSP3_7: EPD Mask                   */
#define SCU_SFSP3_7_EPUN_Pos                  4                                                       /*!< SCU SFSP3_7: EPUN Position              */
#define SCU_SFSP3_7_EPUN_Msk                  (0x01UL << SCU_SFSP3_7_EPUN_Pos)                        /*!< SCU SFSP3_7: EPUN Mask                  */
#define SCU_SFSP3_7_EHS_Pos                   5                                                       /*!< SCU SFSP3_7: EHS Position               */
#define SCU_SFSP3_7_EHS_Msk                   (0x01UL << SCU_SFSP3_7_EHS_Pos)                         /*!< SCU SFSP3_7: EHS Mask                   */
#define SCU_SFSP3_7_EZI_Pos                   6                                                       /*!< SCU SFSP3_7: EZI Position               */
#define SCU_SFSP3_7_EZI_Msk                   (0x01UL << SCU_SFSP3_7_EZI_Pos)                         /*!< SCU SFSP3_7: EZI Mask                   */
#define SCU_SFSP3_7_ZIF_Pos                   7                                                       /*!< SCU SFSP3_7: ZIF Position               */
#define SCU_SFSP3_7_ZIF_Msk                   (0x01UL << SCU_SFSP3_7_ZIF_Pos)                         /*!< SCU SFSP3_7: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP3_8  -------------------------------- */
#define SCU_SFSP3_8_MODE_Pos                  0                                                       /*!< SCU SFSP3_8: MODE Position              */
#define SCU_SFSP3_8_MODE_Msk                  (0x07UL << SCU_SFSP3_8_MODE_Pos)                        /*!< SCU SFSP3_8: MODE Mask                  */
#define SCU_SFSP3_8_EPD_Pos                   3                                                       /*!< SCU SFSP3_8: EPD Position               */
#define SCU_SFSP3_8_EPD_Msk                   (0x01UL << SCU_SFSP3_8_EPD_Pos)                         /*!< SCU SFSP3_8: EPD Mask                   */
#define SCU_SFSP3_8_EPUN_Pos                  4                                                       /*!< SCU SFSP3_8: EPUN Position              */
#define SCU_SFSP3_8_EPUN_Msk                  (0x01UL << SCU_SFSP3_8_EPUN_Pos)                        /*!< SCU SFSP3_8: EPUN Mask                  */
#define SCU_SFSP3_8_EHS_Pos                   5                                                       /*!< SCU SFSP3_8: EHS Position               */
#define SCU_SFSP3_8_EHS_Msk                   (0x01UL << SCU_SFSP3_8_EHS_Pos)                         /*!< SCU SFSP3_8: EHS Mask                   */
#define SCU_SFSP3_8_EZI_Pos                   6                                                       /*!< SCU SFSP3_8: EZI Position               */
#define SCU_SFSP3_8_EZI_Msk                   (0x01UL << SCU_SFSP3_8_EZI_Pos)                         /*!< SCU SFSP3_8: EZI Mask                   */
#define SCU_SFSP3_8_ZIF_Pos                   7                                                       /*!< SCU SFSP3_8: ZIF Position               */
#define SCU_SFSP3_8_ZIF_Msk                   (0x01UL << SCU_SFSP3_8_ZIF_Pos)                         /*!< SCU SFSP3_8: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP4_0  -------------------------------- */
#define SCU_SFSP4_0_MODE_Pos                  0                                                       /*!< SCU SFSP4_0: MODE Position              */
#define SCU_SFSP4_0_MODE_Msk                  (0x07UL << SCU_SFSP4_0_MODE_Pos)                        /*!< SCU SFSP4_0: MODE Mask                  */
#define SCU_SFSP4_0_EPD_Pos                   3                                                       /*!< SCU SFSP4_0: EPD Position               */
#define SCU_SFSP4_0_EPD_Msk                   (0x01UL << SCU_SFSP4_0_EPD_Pos)                         /*!< SCU SFSP4_0: EPD Mask                   */
#define SCU_SFSP4_0_EPUN_Pos                  4                                                       /*!< SCU SFSP4_0: EPUN Position              */
#define SCU_SFSP4_0_EPUN_Msk                  (0x01UL << SCU_SFSP4_0_EPUN_Pos)                        /*!< SCU SFSP4_0: EPUN Mask                  */
#define SCU_SFSP4_0_EHS_Pos                   5                                                       /*!< SCU SFSP4_0: EHS Position               */
#define SCU_SFSP4_0_EHS_Msk                   (0x01UL << SCU_SFSP4_0_EHS_Pos)                         /*!< SCU SFSP4_0: EHS Mask                   */
#define SCU_SFSP4_0_EZI_Pos                   6                                                       /*!< SCU SFSP4_0: EZI Position               */
#define SCU_SFSP4_0_EZI_Msk                   (0x01UL << SCU_SFSP4_0_EZI_Pos)                         /*!< SCU SFSP4_0: EZI Mask                   */
#define SCU_SFSP4_0_ZIF_Pos                   7                                                       /*!< SCU SFSP4_0: ZIF Position               */
#define SCU_SFSP4_0_ZIF_Msk                   (0x01UL << SCU_SFSP4_0_ZIF_Pos)                         /*!< SCU SFSP4_0: ZIF Mask                   */

