MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  SCU_SFSP4_6  -------------------------------- */
#define SCU_SFSP4_6_MODE_Pos                  0                                                       /*!< SCU SFSP4_6: MODE Position              */
#define SCU_SFSP4_6_MODE_Msk                  (0x07UL << SCU_SFSP4_6_MODE_Pos)                        /*!< SCU SFSP4_6: MODE Mask                  */
#define SCU_SFSP4_6_EPD_Pos                   3                                                       /*!< SCU SFSP4_6: EPD Position               */
#define SCU_SFSP4_6_EPD_Msk                   (0x01UL << SCU_SFSP4_6_EPD_Pos)                         /*!< SCU SFSP4_6: EPD Mask                   */
#define SCU_SFSP4_6_EPUN_Pos                  4                                                       /*!< SCU SFSP4_6: EPUN Position              */
#define SCU_SFSP4_6_EPUN_Msk                  (0x01UL << SCU_SFSP4_6_EPUN_Pos)                        /*!< SCU SFSP4_6: EPUN Mask                  */
#define SCU_SFSP4_6_EHS_Pos                   5                                                       /*!< SCU SFSP4_6: EHS Position               */
#define SCU_SFSP4_6_EHS_Msk                   (0x01UL << SCU_SFSP4_6_EHS_Pos)                         /*!< SCU SFSP4_6: EHS Mask                   */
#define SCU_SFSP4_6_EZI_Pos                   6                                                       /*!< SCU SFSP4_6: EZI Position               */
#define SCU_SFSP4_6_EZI_Msk                   (0x01UL << SCU_SFSP4_6_EZI_Pos)                         /*!< SCU SFSP4_6: EZI Mask                   */
#define SCU_SFSP4_6_ZIF_Pos                   7                                                       /*!< SCU SFSP4_6: ZIF Position               */
#define SCU_SFSP4_6_ZIF_Msk                   (0x01UL << SCU_SFSP4_6_ZIF_Pos)                         /*!< SCU SFSP4_6: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP4_7  -------------------------------- */
#define SCU_SFSP4_7_MODE_Pos                  0                                                       /*!< SCU SFSP4_7: MODE Position              */
#define SCU_SFSP4_7_MODE_Msk                  (0x07UL << SCU_SFSP4_7_MODE_Pos)                        /*!< SCU SFSP4_7: MODE Mask                  */
#define SCU_SFSP4_7_EPD_Pos                   3                                                       /*!< SCU SFSP4_7: EPD Position               */
#define SCU_SFSP4_7_EPD_Msk                   (0x01UL << SCU_SFSP4_7_EPD_Pos)                         /*!< SCU SFSP4_7: EPD Mask                   */
#define SCU_SFSP4_7_EPUN_Pos                  4                                                       /*!< SCU SFSP4_7: EPUN Position              */
#define SCU_SFSP4_7_EPUN_Msk                  (0x01UL << SCU_SFSP4_7_EPUN_Pos)                        /*!< SCU SFSP4_7: EPUN Mask                  */
#define SCU_SFSP4_7_EHS_Pos                   5                                                       /*!< SCU SFSP4_7: EHS Position               */
#define SCU_SFSP4_7_EHS_Msk                   (0x01UL << SCU_SFSP4_7_EHS_Pos)                         /*!< SCU SFSP4_7: EHS Mask                   */
#define SCU_SFSP4_7_EZI_Pos                   6                                                       /*!< SCU SFSP4_7: EZI Position               */
#define SCU_SFSP4_7_EZI_Msk                   (0x01UL << SCU_SFSP4_7_EZI_Pos)                         /*!< SCU SFSP4_7: EZI Mask                   */
#define SCU_SFSP4_7_ZIF_Pos                   7                                                       /*!< SCU SFSP4_7: ZIF Position               */
#define SCU_SFSP4_7_ZIF_Msk                   (0x01UL << SCU_SFSP4_7_ZIF_Pos)                         /*!< SCU SFSP4_7: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP4_8  -------------------------------- */
#define SCU_SFSP4_8_MODE_Pos                  0                                                       /*!< SCU SFSP4_8: MODE Position              */
#define SCU_SFSP4_8_MODE_Msk                  (0x07UL << SCU_SFSP4_8_MODE_Pos)                        /*!< SCU SFSP4_8: MODE Mask                  */
#define SCU_SFSP4_8_EPD_Pos                   3                                                       /*!< SCU SFSP4_8: EPD Position               */
#define SCU_SFSP4_8_EPD_Msk                   (0x01UL << SCU_SFSP4_8_EPD_Pos)                         /*!< SCU SFSP4_8: EPD Mask                   */
#define SCU_SFSP4_8_EPUN_Pos                  4                                                       /*!< SCU SFSP4_8: EPUN Position              */
#define SCU_SFSP4_8_EPUN_Msk                  (0x01UL << SCU_SFSP4_8_EPUN_Pos)                        /*!< SCU SFSP4_8: EPUN Mask                  */
#define SCU_SFSP4_8_EHS_Pos                   5                                                       /*!< SCU SFSP4_8: EHS Position               */
#define SCU_SFSP4_8_EHS_Msk                   (0x01UL << SCU_SFSP4_8_EHS_Pos)                         /*!< SCU SFSP4_8: EHS Mask                   */
#define SCU_SFSP4_8_EZI_Pos                   6                                                       /*!< SCU SFSP4_8: EZI Position               */
#define SCU_SFSP4_8_EZI_Msk                   (0x01UL << SCU_SFSP4_8_EZI_Pos)                         /*!< SCU SFSP4_8: EZI Mask                   */
#define SCU_SFSP4_8_ZIF_Pos                   7                                                       /*!< SCU SFSP4_8: ZIF Position               */
#define SCU_SFSP4_8_ZIF_Msk                   (0x01UL << SCU_SFSP4_8_ZIF_Pos)                         /*!< SCU SFSP4_8: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP4_9  -------------------------------- */
#define SCU_SFSP4_9_MODE_Pos                  0                                                       /*!< SCU SFSP4_9: MODE Position              */
#define SCU_SFSP4_9_MODE_Msk                  (0x07UL << SCU_SFSP4_9_MODE_Pos)                        /*!< SCU SFSP4_9: MODE Mask                  */
#define SCU_SFSP4_9_EPD_Pos                   3                                                       /*!< SCU SFSP4_9: EPD Position               */
#define SCU_SFSP4_9_EPD_Msk                   (0x01UL << SCU_SFSP4_9_EPD_Pos)                         /*!< SCU SFSP4_9: EPD Mask                   */
#define SCU_SFSP4_9_EPUN_Pos                  4                                                       /*!< SCU SFSP4_9: EPUN Position              */
#define SCU_SFSP4_9_EPUN_Msk                  (0x01UL << SCU_SFSP4_9_EPUN_Pos)                        /*!< SCU SFSP4_9: EPUN Mask                  */
#define SCU_SFSP4_9_EHS_Pos                   5                                                       /*!< SCU SFSP4_9: EHS Position               */
#define SCU_SFSP4_9_EHS_Msk                   (0x01UL << SCU_SFSP4_9_EHS_Pos)                         /*!< SCU SFSP4_9: EHS Mask                   */
#define SCU_SFSP4_9_EZI_Pos                   6                                                       /*!< SCU SFSP4_9: EZI Position               */
#define SCU_SFSP4_9_EZI_Msk                   (0x01UL << SCU_SFSP4_9_EZI_Pos)                         /*!< SCU SFSP4_9: EZI Mask                   */
#define SCU_SFSP4_9_ZIF_Pos                   7                                                       /*!< SCU SFSP4_9: ZIF Position               */
#define SCU_SFSP4_9_ZIF_Msk                   (0x01UL << SCU_SFSP4_9_ZIF_Pos)                         /*!< SCU SFSP4_9: ZIF Mask                   */

/* --------------------------------  SCU_SFSP4_10  -------------------------------- */
#define SCU_SFSP4_10_MODE_Pos                 0                                                       /*!< SCU SFSP4_10: MODE Position             */
#define SCU_SFSP4_10_MODE_Msk                 (0x07UL << SCU_SFSP4_10_MODE_Pos)                       /*!< SCU SFSP4_10: MODE Mask                 */
#define SCU_SFSP4_10_EPD_Pos                  3                                                       /*!< SCU SFSP4_10: EPD Position              */
#define SCU_SFSP4_10_EPD_Msk                  (0x01UL << SCU_SFSP4_10_EPD_Pos)                        /*!< SCU SFSP4_10: EPD Mask                  */
#define SCU_SFSP4_10_EPUN_Pos                 4                                                       /*!< SCU SFSP4_10: EPUN Position             */
#define SCU_SFSP4_10_EPUN_Msk                 (0x01UL << SCU_SFSP4_10_EPUN_Pos)                       /*!< SCU SFSP4_10: EPUN Mask                 */
#define SCU_SFSP4_10_EHS_Pos                  5                                                       /*!< SCU SFSP4_10: EHS Position              */
#define SCU_SFSP4_10_EHS_Msk                  (0x01UL << SCU_SFSP4_10_EHS_Pos)                        /*!< SCU SFSP4_10: EHS Mask                  */
#define SCU_SFSP4_10_EZI_Pos                  6                                                       /*!< SCU SFSP4_10: EZI Position              */
#define SCU_SFSP4_10_EZI_Msk                  (0x01UL << SCU_SFSP4_10_EZI_Pos)                        /*!< SCU SFSP4_10: EZI Mask                  */
#define SCU_SFSP4_10_ZIF_Pos                  7                                                       /*!< SCU SFSP4_10: ZIF Position              */
#define SCU_SFSP4_10_ZIF_Msk                  (0x01UL << SCU_SFSP4_10_ZIF_Pos)                        /*!< SCU SFSP4_10: ZIF Mask                  */

/* ---------------------------------  SCU_SFSP5_0  -------------------------------- */
#define SCU_SFSP5_0_MODE_Pos                  0                                                       /*!< SCU SFSP5_0: MODE Position              */
#define SCU_SFSP5_0_MODE_Msk                  (0x07UL << SCU_SFSP5_0_MODE_Pos)                        /*!< SCU SFSP5_0: MODE Mask                  */
#define SCU_SFSP5_0_EPD_Pos                   3                                                       /*!< SCU SFSP5_0: EPD Position               */
#define SCU_SFSP5_0_EPD_Msk                   (0x01UL << SCU_SFSP5_0_EPD_Pos)                         /*!< SCU SFSP5_0: EPD Mask                   */
#define SCU_SFSP5_0_EPUN_Pos                  4                                                       /*!< SCU SFSP5_0: EPUN Position              */
#define SCU_SFSP5_0_EPUN_Msk                  (0x01UL << SCU_SFSP5_0_EPUN_Pos)                        /*!< SCU SFSP5_0: EPUN Mask                  */
#define SCU_SFSP5_0_EHS_Pos                   5                                                       /*!< SCU SFSP5_0: EHS Position               */
#define SCU_SFSP5_0_EHS_Msk                   (0x01UL << SCU_SFSP5_0_EHS_Pos)                         /*!< SCU SFSP5_0: EHS Mask                   */
#define SCU_SFSP5_0_EZI_Pos                   6                                                       /*!< SCU SFSP5_0: EZI Position               */
#define SCU_SFSP5_0_EZI_Msk                   (0x01UL << SCU_SFSP5_0_EZI_Pos)                         /*!< SCU SFSP5_0: EZI Mask                   */
#define SCU_SFSP5_0_ZIF_Pos                   7                                                       /*!< SCU SFSP5_0: ZIF Position               */
#define SCU_SFSP5_0_ZIF_Msk                   (0x01UL << SCU_SFSP5_0_ZIF_Pos)                         /*!< SCU SFSP5_0: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP5_1  -------------------------------- */
#define SCU_SFSP5_1_MODE_Pos                  0                                                       /*!< SCU SFSP5_1: MODE Position              */
#define SCU_SFSP5_1_MODE_Msk                  (0x07UL << SCU_SFSP5_1_MODE_Pos)                        /*!< SCU SFSP5_1: MODE Mask                  */
#define SCU_SFSP5_1_EPD_Pos                   3                                                       /*!< SCU SFSP5_1: EPD Position               */
#define SCU_SFSP5_1_EPD_Msk                   (0x01UL << SCU_SFSP5_1_EPD_Pos)                         /*!< SCU SFSP5_1: EPD Mask                   */
#define SCU_SFSP5_1_EPUN_Pos                  4                                                       /*!< SCU SFSP5_1: EPUN Position              */
#define SCU_SFSP5_1_EPUN_Msk                  (0x01UL << SCU_SFSP5_1_EPUN_Pos)                        /*!< SCU SFSP5_1: EPUN Mask                  */
#define SCU_SFSP5_1_EHS_Pos                   5                                                       /*!< SCU SFSP5_1: EHS Position               */
#define SCU_SFSP5_1_EHS_Msk                   (0x01UL << SCU_SFSP5_1_EHS_Pos)                         /*!< SCU SFSP5_1: EHS Mask                   */
#define SCU_SFSP5_1_EZI_Pos                   6                                                       /*!< SCU SFSP5_1: EZI Position               */
#define SCU_SFSP5_1_EZI_Msk                   (0x01UL << SCU_SFSP5_1_EZI_Pos)                         /*!< SCU SFSP5_1: EZI Mask                   */
#define SCU_SFSP5_1_ZIF_Pos                   7                                                       /*!< SCU SFSP5_1: ZIF Position               */
#define SCU_SFSP5_1_ZIF_Msk                   (0x01UL << SCU_SFSP5_1_ZIF_Pos)                         /*!< SCU SFSP5_1: ZIF Mask                   */

