MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  SCU_SFSP6_2  -------------------------------- */
#define SCU_SFSP6_2_MODE_Pos                  0                                                       /*!< SCU SFSP6_2: MODE Position              */
#define SCU_SFSP6_2_MODE_Msk                  (0x07UL << SCU_SFSP6_2_MODE_Pos)                        /*!< SCU SFSP6_2: MODE Mask                  */
#define SCU_SFSP6_2_EPD_Pos                   3                                                       /*!< SCU SFSP6_2: EPD Position               */
#define SCU_SFSP6_2_EPD_Msk                   (0x01UL << SCU_SFSP6_2_EPD_Pos)                         /*!< SCU SFSP6_2: EPD Mask                   */
#define SCU_SFSP6_2_EPUN_Pos                  4                                                       /*!< SCU SFSP6_2: EPUN Position              */
#define SCU_SFSP6_2_EPUN_Msk                  (0x01UL << SCU_SFSP6_2_EPUN_Pos)                        /*!< SCU SFSP6_2: EPUN Mask                  */
#define SCU_SFSP6_2_EHS_Pos                   5                                                       /*!< SCU SFSP6_2: EHS Position               */
#define SCU_SFSP6_2_EHS_Msk                   (0x01UL << SCU_SFSP6_2_EHS_Pos)                         /*!< SCU SFSP6_2: EHS Mask                   */
#define SCU_SFSP6_2_EZI_Pos                   6                                                       /*!< SCU SFSP6_2: EZI Position               */
#define SCU_SFSP6_2_EZI_Msk                   (0x01UL << SCU_SFSP6_2_EZI_Pos)                         /*!< SCU SFSP6_2: EZI Mask                   */
#define SCU_SFSP6_2_ZIF_Pos                   7                                                       /*!< SCU SFSP6_2: ZIF Position               */
#define SCU_SFSP6_2_ZIF_Msk                   (0x01UL << SCU_SFSP6_2_ZIF_Pos)                         /*!< SCU SFSP6_2: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP6_3  -------------------------------- */
#define SCU_SFSP6_3_MODE_Pos                  0                                                       /*!< SCU SFSP6_3: MODE Position              */
#define SCU_SFSP6_3_MODE_Msk                  (0x07UL << SCU_SFSP6_3_MODE_Pos)                        /*!< SCU SFSP6_3: MODE Mask                  */
#define SCU_SFSP6_3_EPD_Pos                   3                                                       /*!< SCU SFSP6_3: EPD Position               */
#define SCU_SFSP6_3_EPD_Msk                   (0x01UL << SCU_SFSP6_3_EPD_Pos)                         /*!< SCU SFSP6_3: EPD Mask                   */
#define SCU_SFSP6_3_EPUN_Pos                  4                                                       /*!< SCU SFSP6_3: EPUN Position              */
#define SCU_SFSP6_3_EPUN_Msk                  (0x01UL << SCU_SFSP6_3_EPUN_Pos)                        /*!< SCU SFSP6_3: EPUN Mask                  */
#define SCU_SFSP6_3_EHS_Pos                   5                                                       /*!< SCU SFSP6_3: EHS Position               */
#define SCU_SFSP6_3_EHS_Msk                   (0x01UL << SCU_SFSP6_3_EHS_Pos)                         /*!< SCU SFSP6_3: EHS Mask                   */
#define SCU_SFSP6_3_EZI_Pos                   6                                                       /*!< SCU SFSP6_3: EZI Position               */
#define SCU_SFSP6_3_EZI_Msk                   (0x01UL << SCU_SFSP6_3_EZI_Pos)                         /*!< SCU SFSP6_3: EZI Mask                   */
#define SCU_SFSP6_3_ZIF_Pos                   7                                                       /*!< SCU SFSP6_3: ZIF Position               */
#define SCU_SFSP6_3_ZIF_Msk                   (0x01UL << SCU_SFSP6_3_ZIF_Pos)                         /*!< SCU SFSP6_3: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP6_4  -------------------------------- */
#define SCU_SFSP6_4_MODE_Pos                  0                                                       /*!< SCU SFSP6_4: MODE Position              */
#define SCU_SFSP6_4_MODE_Msk                  (0x07UL << SCU_SFSP6_4_MODE_Pos)                        /*!< SCU SFSP6_4: MODE Mask                  */
#define SCU_SFSP6_4_EPD_Pos                   3                                                       /*!< SCU SFSP6_4: EPD Position               */
#define SCU_SFSP6_4_EPD_Msk                   (0x01UL << SCU_SFSP6_4_EPD_Pos)                         /*!< SCU SFSP6_4: EPD Mask                   */
#define SCU_SFSP6_4_EPUN_Pos                  4                                                       /*!< SCU SFSP6_4: EPUN Position              */
#define SCU_SFSP6_4_EPUN_Msk                  (0x01UL << SCU_SFSP6_4_EPUN_Pos)                        /*!< SCU SFSP6_4: EPUN Mask                  */
#define SCU_SFSP6_4_EHS_Pos                   5                                                       /*!< SCU SFSP6_4: EHS Position               */
#define SCU_SFSP6_4_EHS_Msk                   (0x01UL << SCU_SFSP6_4_EHS_Pos)                         /*!< SCU SFSP6_4: EHS Mask                   */
#define SCU_SFSP6_4_EZI_Pos                   6                                                       /*!< SCU SFSP6_4: EZI Position               */
#define SCU_SFSP6_4_EZI_Msk                   (0x01UL << SCU_SFSP6_4_EZI_Pos)                         /*!< SCU SFSP6_4: EZI Mask                   */
#define SCU_SFSP6_4_ZIF_Pos                   7                                                       /*!< SCU SFSP6_4: ZIF Position               */
#define SCU_SFSP6_4_ZIF_Msk                   (0x01UL << SCU_SFSP6_4_ZIF_Pos)                         /*!< SCU SFSP6_4: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP6_5  -------------------------------- */
#define SCU_SFSP6_5_MODE_Pos                  0                                                       /*!< SCU SFSP6_5: MODE Position              */
#define SCU_SFSP6_5_MODE_Msk                  (0x07UL << SCU_SFSP6_5_MODE_Pos)                        /*!< SCU SFSP6_5: MODE Mask                  */
#define SCU_SFSP6_5_EPD_Pos                   3                                                       /*!< SCU SFSP6_5: EPD Position               */
#define SCU_SFSP6_5_EPD_Msk                   (0x01UL << SCU_SFSP6_5_EPD_Pos)                         /*!< SCU SFSP6_5: EPD Mask                   */
#define SCU_SFSP6_5_EPUN_Pos                  4                                                       /*!< SCU SFSP6_5: EPUN Position              */
#define SCU_SFSP6_5_EPUN_Msk                  (0x01UL << SCU_SFSP6_5_EPUN_Pos)                        /*!< SCU SFSP6_5: EPUN Mask                  */
#define SCU_SFSP6_5_EHS_Pos                   5                                                       /*!< SCU SFSP6_5: EHS Position               */
#define SCU_SFSP6_5_EHS_Msk                   (0x01UL << SCU_SFSP6_5_EHS_Pos)                         /*!< SCU SFSP6_5: EHS Mask                   */
#define SCU_SFSP6_5_EZI_Pos                   6                                                       /*!< SCU SFSP6_5: EZI Position               */
#define SCU_SFSP6_5_EZI_Msk                   (0x01UL << SCU_SFSP6_5_EZI_Pos)                         /*!< SCU SFSP6_5: EZI Mask                   */
#define SCU_SFSP6_5_ZIF_Pos                   7                                                       /*!< SCU SFSP6_5: ZIF Position               */
#define SCU_SFSP6_5_ZIF_Msk                   (0x01UL << SCU_SFSP6_5_ZIF_Pos)                         /*!< SCU SFSP6_5: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP6_6  -------------------------------- */
#define SCU_SFSP6_6_MODE_Pos                  0                                                       /*!< SCU SFSP6_6: MODE Position              */
#define SCU_SFSP6_6_MODE_Msk                  (0x07UL << SCU_SFSP6_6_MODE_Pos)                        /*!< SCU SFSP6_6: MODE Mask                  */
#define SCU_SFSP6_6_EPD_Pos                   3                                                       /*!< SCU SFSP6_6: EPD Position               */
#define SCU_SFSP6_6_EPD_Msk                   (0x01UL << SCU_SFSP6_6_EPD_Pos)                         /*!< SCU SFSP6_6: EPD Mask                   */
#define SCU_SFSP6_6_EPUN_Pos                  4                                                       /*!< SCU SFSP6_6: EPUN Position              */
#define SCU_SFSP6_6_EPUN_Msk                  (0x01UL << SCU_SFSP6_6_EPUN_Pos)                        /*!< SCU SFSP6_6: EPUN Mask                  */
#define SCU_SFSP6_6_EHS_Pos                   5                                                       /*!< SCU SFSP6_6: EHS Position               */
#define SCU_SFSP6_6_EHS_Msk                   (0x01UL << SCU_SFSP6_6_EHS_Pos)                         /*!< SCU SFSP6_6: EHS Mask                   */
#define SCU_SFSP6_6_EZI_Pos                   6                                                       /*!< SCU SFSP6_6: EZI Position               */
#define SCU_SFSP6_6_EZI_Msk                   (0x01UL << SCU_SFSP6_6_EZI_Pos)                         /*!< SCU SFSP6_6: EZI Mask                   */
#define SCU_SFSP6_6_ZIF_Pos                   7                                                       /*!< SCU SFSP6_6: ZIF Position               */
#define SCU_SFSP6_6_ZIF_Msk                   (0x01UL << SCU_SFSP6_6_ZIF_Pos)                         /*!< SCU SFSP6_6: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP6_7  -------------------------------- */
#define SCU_SFSP6_7_MODE_Pos                  0                                                       /*!< SCU SFSP6_7: MODE Position              */
#define SCU_SFSP6_7_MODE_Msk                  (0x07UL << SCU_SFSP6_7_MODE_Pos)                        /*!< SCU SFSP6_7: MODE Mask                  */
#define SCU_SFSP6_7_EPD_Pos                   3                                                       /*!< SCU SFSP6_7: EPD Position               */
#define SCU_SFSP6_7_EPD_Msk                   (0x01UL << SCU_SFSP6_7_EPD_Pos)                         /*!< SCU SFSP6_7: EPD Mask                   */
#define SCU_SFSP6_7_EPUN_Pos                  4                                                       /*!< SCU SFSP6_7: EPUN Position              */
#define SCU_SFSP6_7_EPUN_Msk                  (0x01UL << SCU_SFSP6_7_EPUN_Pos)                        /*!< SCU SFSP6_7: EPUN Mask                  */
#define SCU_SFSP6_7_EHS_Pos                   5                                                       /*!< SCU SFSP6_7: EHS Position               */
#define SCU_SFSP6_7_EHS_Msk                   (0x01UL << SCU_SFSP6_7_EHS_Pos)                         /*!< SCU SFSP6_7: EHS Mask                   */
#define SCU_SFSP6_7_EZI_Pos                   6                                                       /*!< SCU SFSP6_7: EZI Position               */
#define SCU_SFSP6_7_EZI_Msk                   (0x01UL << SCU_SFSP6_7_EZI_Pos)                         /*!< SCU SFSP6_7: EZI Mask                   */
#define SCU_SFSP6_7_ZIF_Pos                   7                                                       /*!< SCU SFSP6_7: ZIF Position               */
#define SCU_SFSP6_7_ZIF_Msk                   (0x01UL << SCU_SFSP6_7_ZIF_Pos)                         /*!< SCU SFSP6_7: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP6_8  -------------------------------- */
#define SCU_SFSP6_8_MODE_Pos                  0                                                       /*!< SCU SFSP6_8: MODE Position              */
#define SCU_SFSP6_8_MODE_Msk                  (0x07UL << SCU_SFSP6_8_MODE_Pos)                        /*!< SCU SFSP6_8: MODE Mask                  */
#define SCU_SFSP6_8_EPD_Pos                   3                                                       /*!< SCU SFSP6_8: EPD Position               */
#define SCU_SFSP6_8_EPD_Msk                   (0x01UL << SCU_SFSP6_8_EPD_Pos)                         /*!< SCU SFSP6_8: EPD Mask                   */
#define SCU_SFSP6_8_EPUN_Pos                  4                                                       /*!< SCU SFSP6_8: EPUN Position              */
#define SCU_SFSP6_8_EPUN_Msk                  (0x01UL << SCU_SFSP6_8_EPUN_Pos)                        /*!< SCU SFSP6_8: EPUN Mask                  */
#define SCU_SFSP6_8_EHS_Pos                   5                                                       /*!< SCU SFSP6_8: EHS Position               */
#define SCU_SFSP6_8_EHS_Msk                   (0x01UL << SCU_SFSP6_8_EHS_Pos)                         /*!< SCU SFSP6_8: EHS Mask                   */
#define SCU_SFSP6_8_EZI_Pos                   6                                                       /*!< SCU SFSP6_8: EZI Position               */
#define SCU_SFSP6_8_EZI_Msk                   (0x01UL << SCU_SFSP6_8_EZI_Pos)                         /*!< SCU SFSP6_8: EZI Mask                   */
#define SCU_SFSP6_8_ZIF_Pos                   7                                                       /*!< SCU SFSP6_8: ZIF Position               */
#define SCU_SFSP6_8_ZIF_Msk                   (0x01UL << SCU_SFSP6_8_ZIF_Pos)                         /*!< SCU SFSP6_8: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP6_9  -------------------------------- */
#define SCU_SFSP6_9_MODE_Pos                  0                                                       /*!< SCU SFSP6_9: MODE Position              */
#define SCU_SFSP6_9_MODE_Msk                  (0x07UL << SCU_SFSP6_9_MODE_Pos)                        /*!< SCU SFSP6_9: MODE Mask                  */
#define SCU_SFSP6_9_EPD_Pos                   3                                                       /*!< SCU SFSP6_9: EPD Position               */
#define SCU_SFSP6_9_EPD_Msk                   (0x01UL << SCU_SFSP6_9_EPD_Pos)                         /*!< SCU SFSP6_9: EPD Mask                   */
#define SCU_SFSP6_9_EPUN_Pos                  4                                                       /*!< SCU SFSP6_9: EPUN Position              */
#define SCU_SFSP6_9_EPUN_Msk                  (0x01UL << SCU_SFSP6_9_EPUN_Pos)                        /*!< SCU SFSP6_9: EPUN Mask                  */
#define SCU_SFSP6_9_EHS_Pos                   5                                                       /*!< SCU SFSP6_9: EHS Position               */
#define SCU_SFSP6_9_EHS_Msk                   (0x01UL << SCU_SFSP6_9_EHS_Pos)                         /*!< SCU SFSP6_9: EHS Mask                   */
#define SCU_SFSP6_9_EZI_Pos                   6                                                       /*!< SCU SFSP6_9: EZI Position               */
#define SCU_SFSP6_9_EZI_Msk                   (0x01UL << SCU_SFSP6_9_EZI_Pos)                         /*!< SCU SFSP6_9: EZI Mask                   */
#define SCU_SFSP6_9_ZIF_Pos                   7                                                       /*!< SCU SFSP6_9: ZIF Position               */
#define SCU_SFSP6_9_ZIF_Msk                   (0x01UL << SCU_SFSP6_9_ZIF_Pos)                         /*!< SCU SFSP6_9: ZIF Mask                   */

/* --------------------------------  SCU_SFSP6_10  -------------------------------- */
#define SCU_SFSP6_10_MODE_Pos                 0                                                       /*!< SCU SFSP6_10: MODE Position             */
#define SCU_SFSP6_10_MODE_Msk                 (0x07UL << SCU_SFSP6_10_MODE_Pos)                       /*!< SCU SFSP6_10: MODE Mask                 */
#define SCU_SFSP6_10_EPD_Pos                  3                                                       /*!< SCU SFSP6_10: EPD Position              */
#define SCU_SFSP6_10_EPD_Msk                  (0x01UL << SCU_SFSP6_10_EPD_Pos)                        /*!< SCU SFSP6_10: EPD Mask                  */
#define SCU_SFSP6_10_EPUN_Pos                 4                                                       /*!< SCU SFSP6_10: EPUN Position             */
#define SCU_SFSP6_10_EPUN_Msk                 (0x01UL << SCU_SFSP6_10_EPUN_Pos)                       /*!< SCU SFSP6_10: EPUN Mask                 */
#define SCU_SFSP6_10_EHS_Pos                  5                                                       /*!< SCU SFSP6_10: EHS Position              */
#define SCU_SFSP6_10_EHS_Msk                  (0x01UL << SCU_SFSP6_10_EHS_Pos)                        /*!< SCU SFSP6_10: EHS Mask                  */
#define SCU_SFSP6_10_EZI_Pos                  6                                                       /*!< SCU SFSP6_10: EZI Position              */
#define SCU_SFSP6_10_EZI_Msk                  (0x01UL << SCU_SFSP6_10_EZI_Pos)                        /*!< SCU SFSP6_10: EZI Mask                  */
#define SCU_SFSP6_10_ZIF_Pos                  7                                                       /*!< SCU SFSP6_10: ZIF Position              */
#define SCU_SFSP6_10_ZIF_Msk                  (0x01UL << SCU_SFSP6_10_ZIF_Pos)                        /*!< SCU SFSP6_10: ZIF Mask                  */

/* --------------------------------  SCU_SFSP6_11  -------------------------------- */
#define SCU_SFSP6_11_MODE_Pos                 0                                                       /*!< SCU SFSP6_11: MODE Position             */
#define SCU_SFSP6_11_MODE_Msk                 (0x07UL << SCU_SFSP6_11_MODE_Pos)                       /*!< SCU SFSP6_11: MODE Mask                 */
#define SCU_SFSP6_11_EPD_Pos                  3                                                       /*!< SCU SFSP6_11: EPD Position              */
#define SCU_SFSP6_11_EPD_Msk                  (0x01UL << SCU_SFSP6_11_EPD_Pos)                        /*!< SCU SFSP6_11: EPD Mask                  */
#define SCU_SFSP6_11_EPUN_Pos                 4                                                       /*!< SCU SFSP6_11: EPUN Position             */
#define SCU_SFSP6_11_EPUN_Msk                 (0x01UL << SCU_SFSP6_11_EPUN_Pos)                       /*!< SCU SFSP6_11: EPUN Mask                 */
#define SCU_SFSP6_11_EHS_Pos                  5                                                       /*!< SCU SFSP6_11: EHS Position              */
#define SCU_SFSP6_11_EHS_Msk                  (0x01UL << SCU_SFSP6_11_EHS_Pos)                        /*!< SCU SFSP6_11: EHS Mask                  */
#define SCU_SFSP6_11_EZI_Pos                  6                                                       /*!< SCU SFSP6_11: EZI Position              */
#define SCU_SFSP6_11_EZI_Msk                  (0x01UL << SCU_SFSP6_11_EZI_Pos)                        /*!< SCU SFSP6_11: EZI Mask                  */
#define SCU_SFSP6_11_ZIF_Pos                  7                                                       /*!< SCU SFSP6_11: ZIF Position              */
#define SCU_SFSP6_11_ZIF_Msk                  (0x01UL << SCU_SFSP6_11_ZIF_Pos)                        /*!< SCU SFSP6_11: ZIF Mask                  */

