MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  SCU_SFSP9_2  -------------------------------- */
#define SCU_SFSP9_2_MODE_Pos                  0                                                       /*!< SCU SFSP9_2: MODE Position              */
#define SCU_SFSP9_2_MODE_Msk                  (0x07UL << SCU_SFSP9_2_MODE_Pos)                        /*!< SCU SFSP9_2: MODE Mask                  */
#define SCU_SFSP9_2_EPD_Pos                   3                                                       /*!< SCU SFSP9_2: EPD Position               */
#define SCU_SFSP9_2_EPD_Msk                   (0x01UL << SCU_SFSP9_2_EPD_Pos)                         /*!< SCU SFSP9_2: EPD Mask                   */
#define SCU_SFSP9_2_EPUN_Pos                  4                                                       /*!< SCU SFSP9_2: EPUN Position              */
#define SCU_SFSP9_2_EPUN_Msk                  (0x01UL << SCU_SFSP9_2_EPUN_Pos)                        /*!< SCU SFSP9_2: EPUN Mask                  */
#define SCU_SFSP9_2_EHS_Pos                   5                                                       /*!< SCU SFSP9_2: EHS Position               */
#define SCU_SFSP9_2_EHS_Msk                   (0x01UL << SCU_SFSP9_2_EHS_Pos)                         /*!< SCU SFSP9_2: EHS Mask                   */
#define SCU_SFSP9_2_EZI_Pos                   6                                                       /*!< SCU SFSP9_2: EZI Position               */
#define SCU_SFSP9_2_EZI_Msk                   (0x01UL << SCU_SFSP9_2_EZI_Pos)                         /*!< SCU SFSP9_2: EZI Mask                   */
#define SCU_SFSP9_2_EHD_Pos                   8                                                       /*!< SCU SFSP9_2: EHD Position               */
#define SCU_SFSP9_2_EHD_Msk                   (0x03UL << SCU_SFSP9_2_EHD_Pos)                         /*!< SCU SFSP9_2: EHD Mask                   */

/* ---------------------------------  SCU_SFSP9_3  -------------------------------- */
#define SCU_SFSP9_3_MODE_Pos                  0                                                       /*!< SCU SFSP9_3: MODE Position              */
#define SCU_SFSP9_3_MODE_Msk                  (0x07UL << SCU_SFSP9_3_MODE_Pos)                        /*!< SCU SFSP9_3: MODE Mask                  */
#define SCU_SFSP9_3_EPD_Pos                   3                                                       /*!< SCU SFSP9_3: EPD Position               */
#define SCU_SFSP9_3_EPD_Msk                   (0x01UL << SCU_SFSP9_3_EPD_Pos)                         /*!< SCU SFSP9_3: EPD Mask                   */
#define SCU_SFSP9_3_EPUN_Pos                  4                                                       /*!< SCU SFSP9_3: EPUN Position              */
#define SCU_SFSP9_3_EPUN_Msk                  (0x01UL << SCU_SFSP9_3_EPUN_Pos)                        /*!< SCU SFSP9_3: EPUN Mask                  */
#define SCU_SFSP9_3_EHS_Pos                   5                                                       /*!< SCU SFSP9_3: EHS Position               */
#define SCU_SFSP9_3_EHS_Msk                   (0x01UL << SCU_SFSP9_3_EHS_Pos)                         /*!< SCU SFSP9_3: EHS Mask                   */
#define SCU_SFSP9_3_EZI_Pos                   6                                                       /*!< SCU SFSP9_3: EZI Position               */
#define SCU_SFSP9_3_EZI_Msk                   (0x01UL << SCU_SFSP9_3_EZI_Pos)                         /*!< SCU SFSP9_3: EZI Mask                   */
#define SCU_SFSP9_3_EHD_Pos                   8                                                       /*!< SCU SFSP9_3: EHD Position               */
#define SCU_SFSP9_3_EHD_Msk                   (0x03UL << SCU_SFSP9_3_EHD_Pos)                         /*!< SCU SFSP9_3: EHD Mask                   */

/* ---------------------------------  SCU_SFSP9_4  -------------------------------- */
#define SCU_SFSP9_4_MODE_Pos                  0                                                       /*!< SCU SFSP9_4: MODE Position              */
#define SCU_SFSP9_4_MODE_Msk                  (0x07UL << SCU_SFSP9_4_MODE_Pos)                        /*!< SCU SFSP9_4: MODE Mask                  */
#define SCU_SFSP9_4_EPD_Pos                   3                                                       /*!< SCU SFSP9_4: EPD Position               */
#define SCU_SFSP9_4_EPD_Msk                   (0x01UL << SCU_SFSP9_4_EPD_Pos)                         /*!< SCU SFSP9_4: EPD Mask                   */
#define SCU_SFSP9_4_EPUN_Pos                  4                                                       /*!< SCU SFSP9_4: EPUN Position              */
#define SCU_SFSP9_4_EPUN_Msk                  (0x01UL << SCU_SFSP9_4_EPUN_Pos)                        /*!< SCU SFSP9_4: EPUN Mask                  */
#define SCU_SFSP9_4_EHS_Pos                   5                                                       /*!< SCU SFSP9_4: EHS Position               */
#define SCU_SFSP9_4_EHS_Msk                   (0x01UL << SCU_SFSP9_4_EHS_Pos)                         /*!< SCU SFSP9_4: EHS Mask                   */
#define SCU_SFSP9_4_EZI_Pos                   6                                                       /*!< SCU SFSP9_4: EZI Position               */
#define SCU_SFSP9_4_EZI_Msk                   (0x01UL << SCU_SFSP9_4_EZI_Pos)                         /*!< SCU SFSP9_4: EZI Mask                   */
#define SCU_SFSP9_4_EHD_Pos                   8                                                       /*!< SCU SFSP9_4: EHD Position               */
#define SCU_SFSP9_4_EHD_Msk                   (0x03UL << SCU_SFSP9_4_EHD_Pos)                         /*!< SCU SFSP9_4: EHD Mask                   */

/* ---------------------------------  SCU_SFSP9_5  -------------------------------- */
#define SCU_SFSP9_5_MODE_Pos                  0                                                       /*!< SCU SFSP9_5: MODE Position              */
#define SCU_SFSP9_5_MODE_Msk                  (0x07UL << SCU_SFSP9_5_MODE_Pos)                        /*!< SCU SFSP9_5: MODE Mask                  */
#define SCU_SFSP9_5_EPD_Pos                   3                                                       /*!< SCU SFSP9_5: EPD Position               */
#define SCU_SFSP9_5_EPD_Msk                   (0x01UL << SCU_SFSP9_5_EPD_Pos)                         /*!< SCU SFSP9_5: EPD Mask                   */
#define SCU_SFSP9_5_EPUN_Pos                  4                                                       /*!< SCU SFSP9_5: EPUN Position              */
#define SCU_SFSP9_5_EPUN_Msk                  (0x01UL << SCU_SFSP9_5_EPUN_Pos)                        /*!< SCU SFSP9_5: EPUN Mask                  */
#define SCU_SFSP9_5_EHS_Pos                   5                                                       /*!< SCU SFSP9_5: EHS Position               */
#define SCU_SFSP9_5_EHS_Msk                   (0x01UL << SCU_SFSP9_5_EHS_Pos)                         /*!< SCU SFSP9_5: EHS Mask                   */
#define SCU_SFSP9_5_EZI_Pos                   6                                                       /*!< SCU SFSP9_5: EZI Position               */
#define SCU_SFSP9_5_EZI_Msk                   (0x01UL << SCU_SFSP9_5_EZI_Pos)                         /*!< SCU SFSP9_5: EZI Mask                   */
#define SCU_SFSP9_5_EHD_Pos                   8                                                       /*!< SCU SFSP9_5: EHD Position               */
#define SCU_SFSP9_5_EHD_Msk                   (0x03UL << SCU_SFSP9_5_EHD_Pos)                         /*!< SCU SFSP9_5: EHD Mask                   */

/* ---------------------------------  SCU_SFSP9_6  -------------------------------- */
#define SCU_SFSP9_6_MODE_Pos                  0                                                       /*!< SCU SFSP9_6: MODE Position              */
#define SCU_SFSP9_6_MODE_Msk                  (0x07UL << SCU_SFSP9_6_MODE_Pos)                        /*!< SCU SFSP9_6: MODE Mask                  */
#define SCU_SFSP9_6_EPD_Pos                   3                                                       /*!< SCU SFSP9_6: EPD Position               */
#define SCU_SFSP9_6_EPD_Msk                   (0x01UL << SCU_SFSP9_6_EPD_Pos)                         /*!< SCU SFSP9_6: EPD Mask                   */
#define SCU_SFSP9_6_EPUN_Pos                  4                                                       /*!< SCU SFSP9_6: EPUN Position              */
#define SCU_SFSP9_6_EPUN_Msk                  (0x01UL << SCU_SFSP9_6_EPUN_Pos)                        /*!< SCU SFSP9_6: EPUN Mask                  */
#define SCU_SFSP9_6_EHS_Pos                   5                                                       /*!< SCU SFSP9_6: EHS Position               */
#define SCU_SFSP9_6_EHS_Msk                   (0x01UL << SCU_SFSP9_6_EHS_Pos)                         /*!< SCU SFSP9_6: EHS Mask                   */
#define SCU_SFSP9_6_EZI_Pos                   6                                                       /*!< SCU SFSP9_6: EZI Position               */
#define SCU_SFSP9_6_EZI_Msk                   (0x01UL << SCU_SFSP9_6_EZI_Pos)                         /*!< SCU SFSP9_6: EZI Mask                   */
#define SCU_SFSP9_6_EHD_Pos                   8                                                       /*!< SCU SFSP9_6: EHD Position               */
#define SCU_SFSP9_6_EHD_Msk                   (0x03UL << SCU_SFSP9_6_EHD_Pos)                         /*!< SCU SFSP9_6: EHD Mask                   */

/* ---------------------------------  SCU_SFSPA_0  -------------------------------- */
#define SCU_SFSPA_0_MODE_Pos                  0                                                       /*!< SCU SFSPA_0: MODE Position              */
#define SCU_SFSPA_0_MODE_Msk                  (0x07UL << SCU_SFSPA_0_MODE_Pos)                        /*!< SCU SFSPA_0: MODE Mask                  */
#define SCU_SFSPA_0_EPD_Pos                   3                                                       /*!< SCU SFSPA_0: EPD Position               */
#define SCU_SFSPA_0_EPD_Msk                   (0x01UL << SCU_SFSPA_0_EPD_Pos)                         /*!< SCU SFSPA_0: EPD Mask                   */
#define SCU_SFSPA_0_EPUN_Pos                  4                                                       /*!< SCU SFSPA_0: EPUN Position              */
#define SCU_SFSPA_0_EPUN_Msk                  (0x01UL << SCU_SFSPA_0_EPUN_Pos)                        /*!< SCU SFSPA_0: EPUN Mask                  */
#define SCU_SFSPA_0_EHS_Pos                   5                                                       /*!< SCU SFSPA_0: EHS Position               */
#define SCU_SFSPA_0_EHS_Msk                   (0x01UL << SCU_SFSPA_0_EHS_Pos)                         /*!< SCU SFSPA_0: EHS Mask                   */
#define SCU_SFSPA_0_EZI_Pos                   6                                                       /*!< SCU SFSPA_0: EZI Position               */
#define SCU_SFSPA_0_EZI_Msk                   (0x01UL << SCU_SFSPA_0_EZI_Pos)                         /*!< SCU SFSPA_0: EZI Mask                   */
#define SCU_SFSPA_0_ZIF_Pos                   7                                                       /*!< SCU SFSPA_0: ZIF Position               */
#define SCU_SFSPA_0_ZIF_Msk                   (0x01UL << SCU_SFSPA_0_ZIF_Pos)                         /*!< SCU SFSPA_0: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPA_1  -------------------------------- */
#define SCU_SFSPA_1_MODE_Pos                  0                                                       /*!< SCU SFSPA_1: MODE Position              */
#define SCU_SFSPA_1_MODE_Msk                  (0x07UL << SCU_SFSPA_1_MODE_Pos)                        /*!< SCU SFSPA_1: MODE Mask                  */
#define SCU_SFSPA_1_EPD_Pos                   3                                                       /*!< SCU SFSPA_1: EPD Position               */
#define SCU_SFSPA_1_EPD_Msk                   (0x01UL << SCU_SFSPA_1_EPD_Pos)                         /*!< SCU SFSPA_1: EPD Mask                   */
#define SCU_SFSPA_1_EPUN_Pos                  4                                                       /*!< SCU SFSPA_1: EPUN Position              */
#define SCU_SFSPA_1_EPUN_Msk                  (0x01UL << SCU_SFSPA_1_EPUN_Pos)                        /*!< SCU SFSPA_1: EPUN Mask                  */
#define SCU_SFSPA_1_EZI_Pos                   6                                                       /*!< SCU SFSPA_1: EZI Position               */
#define SCU_SFSPA_1_EZI_Msk                   (0x01UL << SCU_SFSPA_1_EZI_Pos)                         /*!< SCU SFSPA_1: EZI Mask                   */
#define SCU_SFSPA_1_ZIF_Pos                   7                                                       /*!< SCU SFSPA_1: ZIF Position               */
#define SCU_SFSPA_1_ZIF_Msk                   (0x01UL << SCU_SFSPA_1_ZIF_Pos)                         /*!< SCU SFSPA_1: ZIF Mask                   */
#define SCU_SFSPA_1_EHD_Pos                   8                                                       /*!< SCU SFSPA_1: EHD Position               */
#define SCU_SFSPA_1_EHD_Msk                   (0x03UL << SCU_SFSPA_1_EHD_Pos)                         /*!< SCU SFSPA_1: EHD Mask                   */

/* ---------------------------------  SCU_SFSPA_2  -------------------------------- */
#define SCU_SFSPA_2_MODE_Pos                  0                                                       /*!< SCU SFSPA_2: MODE Position              */
#define SCU_SFSPA_2_MODE_Msk                  (0x07UL << SCU_SFSPA_2_MODE_Pos)                        /*!< SCU SFSPA_2: MODE Mask                  */
#define SCU_SFSPA_2_EPD_Pos                   3                                                       /*!< SCU SFSPA_2: EPD Position               */
#define SCU_SFSPA_2_EPD_Msk                   (0x01UL << SCU_SFSPA_2_EPD_Pos)                         /*!< SCU SFSPA_2: EPD Mask                   */
#define SCU_SFSPA_2_EPUN_Pos                  4                                                       /*!< SCU SFSPA_2: EPUN Position              */
#define SCU_SFSPA_2_EPUN_Msk                  (0x01UL << SCU_SFSPA_2_EPUN_Pos)                        /*!< SCU SFSPA_2: EPUN Mask                  */
#define SCU_SFSPA_2_EZI_Pos                   6                                                       /*!< SCU SFSPA_2: EZI Position               */
#define SCU_SFSPA_2_EZI_Msk                   (0x01UL << SCU_SFSPA_2_EZI_Pos)                         /*!< SCU SFSPA_2: EZI Mask                   */
#define SCU_SFSPA_2_ZIF_Pos                   7                                                       /*!< SCU SFSPA_2: ZIF Position               */
#define SCU_SFSPA_2_ZIF_Msk                   (0x01UL << SCU_SFSPA_2_ZIF_Pos)                         /*!< SCU SFSPA_2: ZIF Mask                   */
#define SCU_SFSPA_2_EHD_Pos                   8                                                       /*!< SCU SFSPA_2: EHD Position               */
#define SCU_SFSPA_2_EHD_Msk                   (0x03UL << SCU_SFSPA_2_EHD_Pos)                         /*!< SCU SFSPA_2: EHD Mask                   */

