MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  SCU_SFSPB_3  -------------------------------- */
#define SCU_SFSPB_3_MODE_Pos                  0                                                       /*!< SCU SFSPB_3: MODE Position              */
#define SCU_SFSPB_3_MODE_Msk                  (0x07UL << SCU_SFSPB_3_MODE_Pos)                        /*!< SCU SFSPB_3: MODE Mask                  */
#define SCU_SFSPB_3_EPD_Pos                   3                                                       /*!< SCU SFSPB_3: EPD Position               */
#define SCU_SFSPB_3_EPD_Msk                   (0x01UL << SCU_SFSPB_3_EPD_Pos)                         /*!< SCU SFSPB_3: EPD Mask                   */
#define SCU_SFSPB_3_EPUN_Pos                  4                                                       /*!< SCU SFSPB_3: EPUN Position              */
#define SCU_SFSPB_3_EPUN_Msk                  (0x01UL << SCU_SFSPB_3_EPUN_Pos)                        /*!< SCU SFSPB_3: EPUN Mask                  */
#define SCU_SFSPB_3_EHS_Pos                   5                                                       /*!< SCU SFSPB_3: EHS Position               */
#define SCU_SFSPB_3_EHS_Msk                   (0x01UL << SCU_SFSPB_3_EHS_Pos)                         /*!< SCU SFSPB_3: EHS Mask                   */
#define SCU_SFSPB_3_EZI_Pos                   6                                                       /*!< SCU SFSPB_3: EZI Position               */
#define SCU_SFSPB_3_EZI_Msk                   (0x01UL << SCU_SFSPB_3_EZI_Pos)                         /*!< SCU SFSPB_3: EZI Mask                   */
#define SCU_SFSPB_3_ZIF_Pos                   7                                                       /*!< SCU SFSPB_3: ZIF Position               */
#define SCU_SFSPB_3_ZIF_Msk                   (0x01UL << SCU_SFSPB_3_ZIF_Pos)                         /*!< SCU SFSPB_3: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPB_4  -------------------------------- */
#define SCU_SFSPB_4_MODE_Pos                  0                                                       /*!< SCU SFSPB_4: MODE Position              */
#define SCU_SFSPB_4_MODE_Msk                  (0x07UL << SCU_SFSPB_4_MODE_Pos)                        /*!< SCU SFSPB_4: MODE Mask                  */
#define SCU_SFSPB_4_EPD_Pos                   3                                                       /*!< SCU SFSPB_4: EPD Position               */
#define SCU_SFSPB_4_EPD_Msk                   (0x01UL << SCU_SFSPB_4_EPD_Pos)                         /*!< SCU SFSPB_4: EPD Mask                   */
#define SCU_SFSPB_4_EPUN_Pos                  4                                                       /*!< SCU SFSPB_4: EPUN Position              */
#define SCU_SFSPB_4_EPUN_Msk                  (0x01UL << SCU_SFSPB_4_EPUN_Pos)                        /*!< SCU SFSPB_4: EPUN Mask                  */
#define SCU_SFSPB_4_EHS_Pos                   5                                                       /*!< SCU SFSPB_4: EHS Position               */
#define SCU_SFSPB_4_EHS_Msk                   (0x01UL << SCU_SFSPB_4_EHS_Pos)                         /*!< SCU SFSPB_4: EHS Mask                   */
#define SCU_SFSPB_4_EZI_Pos                   6                                                       /*!< SCU SFSPB_4: EZI Position               */
#define SCU_SFSPB_4_EZI_Msk                   (0x01UL << SCU_SFSPB_4_EZI_Pos)                         /*!< SCU SFSPB_4: EZI Mask                   */
#define SCU_SFSPB_4_ZIF_Pos                   7                                                       /*!< SCU SFSPB_4: ZIF Position               */
#define SCU_SFSPB_4_ZIF_Msk                   (0x01UL << SCU_SFSPB_4_ZIF_Pos)                         /*!< SCU SFSPB_4: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPB_5  -------------------------------- */
#define SCU_SFSPB_5_MODE_Pos                  0                                                       /*!< SCU SFSPB_5: MODE Position              */
#define SCU_SFSPB_5_MODE_Msk                  (0x07UL << SCU_SFSPB_5_MODE_Pos)                        /*!< SCU SFSPB_5: MODE Mask                  */
#define SCU_SFSPB_5_EPD_Pos                   3                                                       /*!< SCU SFSPB_5: EPD Position               */
#define SCU_SFSPB_5_EPD_Msk                   (0x01UL << SCU_SFSPB_5_EPD_Pos)                         /*!< SCU SFSPB_5: EPD Mask                   */
#define SCU_SFSPB_5_EPUN_Pos                  4                                                       /*!< SCU SFSPB_5: EPUN Position              */
#define SCU_SFSPB_5_EPUN_Msk                  (0x01UL << SCU_SFSPB_5_EPUN_Pos)                        /*!< SCU SFSPB_5: EPUN Mask                  */
#define SCU_SFSPB_5_EHS_Pos                   5                                                       /*!< SCU SFSPB_5: EHS Position               */
#define SCU_SFSPB_5_EHS_Msk                   (0x01UL << SCU_SFSPB_5_EHS_Pos)                         /*!< SCU SFSPB_5: EHS Mask                   */
#define SCU_SFSPB_5_EZI_Pos                   6                                                       /*!< SCU SFSPB_5: EZI Position               */
#define SCU_SFSPB_5_EZI_Msk                   (0x01UL << SCU_SFSPB_5_EZI_Pos)                         /*!< SCU SFSPB_5: EZI Mask                   */
#define SCU_SFSPB_5_ZIF_Pos                   7                                                       /*!< SCU SFSPB_5: ZIF Position               */
#define SCU_SFSPB_5_ZIF_Msk                   (0x01UL << SCU_SFSPB_5_ZIF_Pos)                         /*!< SCU SFSPB_5: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPB_6  -------------------------------- */
#define SCU_SFSPB_6_MODE_Pos                  0                                                       /*!< SCU SFSPB_6: MODE Position              */
#define SCU_SFSPB_6_MODE_Msk                  (0x07UL << SCU_SFSPB_6_MODE_Pos)                        /*!< SCU SFSPB_6: MODE Mask                  */
#define SCU_SFSPB_6_EPD_Pos                   3                                                       /*!< SCU SFSPB_6: EPD Position               */
#define SCU_SFSPB_6_EPD_Msk                   (0x01UL << SCU_SFSPB_6_EPD_Pos)                         /*!< SCU SFSPB_6: EPD Mask                   */
#define SCU_SFSPB_6_EPUN_Pos                  4                                                       /*!< SCU SFSPB_6: EPUN Position              */
#define SCU_SFSPB_6_EPUN_Msk                  (0x01UL << SCU_SFSPB_6_EPUN_Pos)                        /*!< SCU SFSPB_6: EPUN Mask                  */
#define SCU_SFSPB_6_EHS_Pos                   5                                                       /*!< SCU SFSPB_6: EHS Position               */
#define SCU_SFSPB_6_EHS_Msk                   (0x01UL << SCU_SFSPB_6_EHS_Pos)                         /*!< SCU SFSPB_6: EHS Mask                   */
#define SCU_SFSPB_6_EZI_Pos                   6                                                       /*!< SCU SFSPB_6: EZI Position               */
#define SCU_SFSPB_6_EZI_Msk                   (0x01UL << SCU_SFSPB_6_EZI_Pos)                         /*!< SCU SFSPB_6: EZI Mask                   */
#define SCU_SFSPB_6_ZIF_Pos                   7                                                       /*!< SCU SFSPB_6: ZIF Position               */
#define SCU_SFSPB_6_ZIF_Msk                   (0x01UL << SCU_SFSPB_6_ZIF_Pos)                         /*!< SCU SFSPB_6: ZIF Mask                   */

