MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  SCU_SFSPC_0  -------------------------------- */
#define SCU_SFSPC_0_MODE_Pos                  0                                                       /*!< SCU SFSPC_0: MODE Position              */
#define SCU_SFSPC_0_MODE_Msk                  (0x07UL << SCU_SFSPC_0_MODE_Pos)                        /*!< SCU SFSPC_0: MODE Mask                  */
#define SCU_SFSPC_0_EPD_Pos                   3                                                       /*!< SCU SFSPC_0: EPD Position               */
#define SCU_SFSPC_0_EPD_Msk                   (0x01UL << SCU_SFSPC_0_EPD_Pos)                         /*!< SCU SFSPC_0: EPD Mask                   */
#define SCU_SFSPC_0_EPUN_Pos                  4                                                       /*!< SCU SFSPC_0: EPUN Position              */
#define SCU_SFSPC_0_EPUN_Msk                  (0x01UL << SCU_SFSPC_0_EPUN_Pos)                        /*!< SCU SFSPC_0: EPUN Mask                  */
#define SCU_SFSPC_0_EHS_Pos                   5                                                       /*!< SCU SFSPC_0: EHS Position               */
#define SCU_SFSPC_0_EHS_Msk                   (0x01UL << SCU_SFSPC_0_EHS_Pos)                         /*!< SCU SFSPC_0: EHS Mask                   */
#define SCU_SFSPC_0_EZI_Pos                   6                                                       /*!< SCU SFSPC_0: EZI Position               */
#define SCU_SFSPC_0_EZI_Msk                   (0x01UL << SCU_SFSPC_0_EZI_Pos)                         /*!< SCU SFSPC_0: EZI Mask                   */
#define SCU_SFSPC_0_ZIF_Pos                   7                                                       /*!< SCU SFSPC_0: ZIF Position               */
#define SCU_SFSPC_0_ZIF_Msk                   (0x01UL << SCU_SFSPC_0_ZIF_Pos)                         /*!< SCU SFSPC_0: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPC_1  -------------------------------- */
#define SCU_SFSPC_1_MODE_Pos                  0                                                       /*!< SCU SFSPC_1: MODE Position              */
#define SCU_SFSPC_1_MODE_Msk                  (0x07UL << SCU_SFSPC_1_MODE_Pos)                        /*!< SCU SFSPC_1: MODE Mask                  */
#define SCU_SFSPC_1_EPD_Pos                   3                                                       /*!< SCU SFSPC_1: EPD Position               */
#define SCU_SFSPC_1_EPD_Msk                   (0x01UL << SCU_SFSPC_1_EPD_Pos)                         /*!< SCU SFSPC_1: EPD Mask                   */
#define SCU_SFSPC_1_EPUN_Pos                  4                                                       /*!< SCU SFSPC_1: EPUN Position              */
#define SCU_SFSPC_1_EPUN_Msk                  (0x01UL << SCU_SFSPC_1_EPUN_Pos)                        /*!< SCU SFSPC_1: EPUN Mask                  */
#define SCU_SFSPC_1_EHS_Pos                   5                                                       /*!< SCU SFSPC_1: EHS Position               */
#define SCU_SFSPC_1_EHS_Msk                   (0x01UL << SCU_SFSPC_1_EHS_Pos)                         /*!< SCU SFSPC_1: EHS Mask                   */
#define SCU_SFSPC_1_EZI_Pos                   6                                                       /*!< SCU SFSPC_1: EZI Position               */
#define SCU_SFSPC_1_EZI_Msk                   (0x01UL << SCU_SFSPC_1_EZI_Pos)                         /*!< SCU SFSPC_1: EZI Mask                   */
#define SCU_SFSPC_1_ZIF_Pos                   7                                                       /*!< SCU SFSPC_1: ZIF Position               */
#define SCU_SFSPC_1_ZIF_Msk                   (0x01UL << SCU_SFSPC_1_ZIF_Pos)                         /*!< SCU SFSPC_1: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPC_2  -------------------------------- */
#define SCU_SFSPC_2_MODE_Pos                  0                                                       /*!< SCU SFSPC_2: MODE Position              */
#define SCU_SFSPC_2_MODE_Msk                  (0x07UL << SCU_SFSPC_2_MODE_Pos)                        /*!< SCU SFSPC_2: MODE Mask                  */
#define SCU_SFSPC_2_EPD_Pos                   3                                                       /*!< SCU SFSPC_2: EPD Position               */
#define SCU_SFSPC_2_EPD_Msk                   (0x01UL << SCU_SFSPC_2_EPD_Pos)                         /*!< SCU SFSPC_2: EPD Mask                   */
#define SCU_SFSPC_2_EPUN_Pos                  4                                                       /*!< SCU SFSPC_2: EPUN Position              */
#define SCU_SFSPC_2_EPUN_Msk                  (0x01UL << SCU_SFSPC_2_EPUN_Pos)                        /*!< SCU SFSPC_2: EPUN Mask                  */
#define SCU_SFSPC_2_EHS_Pos                   5                                                       /*!< SCU SFSPC_2: EHS Position               */
#define SCU_SFSPC_2_EHS_Msk                   (0x01UL << SCU_SFSPC_2_EHS_Pos)                         /*!< SCU SFSPC_2: EHS Mask                   */
#define SCU_SFSPC_2_EZI_Pos                   6                                                       /*!< SCU SFSPC_2: EZI Position               */
#define SCU_SFSPC_2_EZI_Msk                   (0x01UL << SCU_SFSPC_2_EZI_Pos)                         /*!< SCU SFSPC_2: EZI Mask                   */
#define SCU_SFSPC_2_ZIF_Pos                   7                                                       /*!< SCU SFSPC_2: ZIF Position               */
#define SCU_SFSPC_2_ZIF_Msk                   (0x01UL << SCU_SFSPC_2_ZIF_Pos)                         /*!< SCU SFSPC_2: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPC_3  -------------------------------- */
#define SCU_SFSPC_3_MODE_Pos                  0                                                       /*!< SCU SFSPC_3: MODE Position              */
#define SCU_SFSPC_3_MODE_Msk                  (0x07UL << SCU_SFSPC_3_MODE_Pos)                        /*!< SCU SFSPC_3: MODE Mask                  */
#define SCU_SFSPC_3_EPD_Pos                   3                                                       /*!< SCU SFSPC_3: EPD Position               */
#define SCU_SFSPC_3_EPD_Msk                   (0x01UL << SCU_SFSPC_3_EPD_Pos)                         /*!< SCU SFSPC_3: EPD Mask                   */
#define SCU_SFSPC_3_EPUN_Pos                  4                                                       /*!< SCU SFSPC_3: EPUN Position              */
#define SCU_SFSPC_3_EPUN_Msk                  (0x01UL << SCU_SFSPC_3_EPUN_Pos)                        /*!< SCU SFSPC_3: EPUN Mask                  */
#define SCU_SFSPC_3_EHS_Pos                   5                                                       /*!< SCU SFSPC_3: EHS Position               */
#define SCU_SFSPC_3_EHS_Msk                   (0x01UL << SCU_SFSPC_3_EHS_Pos)                         /*!< SCU SFSPC_3: EHS Mask                   */
#define SCU_SFSPC_3_EZI_Pos                   6                                                       /*!< SCU SFSPC_3: EZI Position               */
#define SCU_SFSPC_3_EZI_Msk                   (0x01UL << SCU_SFSPC_3_EZI_Pos)                         /*!< SCU SFSPC_3: EZI Mask                   */
#define SCU_SFSPC_3_ZIF_Pos                   7                                                       /*!< SCU SFSPC_3: ZIF Position               */
#define SCU_SFSPC_3_ZIF_Msk                   (0x01UL << SCU_SFSPC_3_ZIF_Pos)                         /*!< SCU SFSPC_3: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPC_4  -------------------------------- */
#define SCU_SFSPC_4_MODE_Pos                  0                                                       /*!< SCU SFSPC_4: MODE Position              */
#define SCU_SFSPC_4_MODE_Msk                  (0x07UL << SCU_SFSPC_4_MODE_Pos)                        /*!< SCU SFSPC_4: MODE Mask                  */
#define SCU_SFSPC_4_EPD_Pos                   3                                                       /*!< SCU SFSPC_4: EPD Position               */
#define SCU_SFSPC_4_EPD_Msk                   (0x01UL << SCU_SFSPC_4_EPD_Pos)                         /*!< SCU SFSPC_4: EPD Mask                   */
#define SCU_SFSPC_4_EPUN_Pos                  4                                                       /*!< SCU SFSPC_4: EPUN Position              */
#define SCU_SFSPC_4_EPUN_Msk                  (0x01UL << SCU_SFSPC_4_EPUN_Pos)                        /*!< SCU SFSPC_4: EPUN Mask                  */
#define SCU_SFSPC_4_EHS_Pos                   5                                                       /*!< SCU SFSPC_4: EHS Position               */
#define SCU_SFSPC_4_EHS_Msk                   (0x01UL << SCU_SFSPC_4_EHS_Pos)                         /*!< SCU SFSPC_4: EHS Mask                   */
#define SCU_SFSPC_4_EZI_Pos                   6                                                       /*!< SCU SFSPC_4: EZI Position               */
#define SCU_SFSPC_4_EZI_Msk                   (0x01UL << SCU_SFSPC_4_EZI_Pos)                         /*!< SCU SFSPC_4: EZI Mask                   */
#define SCU_SFSPC_4_ZIF_Pos                   7                                                       /*!< SCU SFSPC_4: ZIF Position               */
#define SCU_SFSPC_4_ZIF_Msk                   (0x01UL << SCU_SFSPC_4_ZIF_Pos)                         /*!< SCU SFSPC_4: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPC_5  -------------------------------- */
#define SCU_SFSPC_5_MODE_Pos                  0                                                       /*!< SCU SFSPC_5: MODE Position              */
#define SCU_SFSPC_5_MODE_Msk                  (0x07UL << SCU_SFSPC_5_MODE_Pos)                        /*!< SCU SFSPC_5: MODE Mask                  */
#define SCU_SFSPC_5_EPD_Pos                   3                                                       /*!< SCU SFSPC_5: EPD Position               */
#define SCU_SFSPC_5_EPD_Msk                   (0x01UL << SCU_SFSPC_5_EPD_Pos)                         /*!< SCU SFSPC_5: EPD Mask                   */
#define SCU_SFSPC_5_EPUN_Pos                  4                                                       /*!< SCU SFSPC_5: EPUN Position              */
#define SCU_SFSPC_5_EPUN_Msk                  (0x01UL << SCU_SFSPC_5_EPUN_Pos)                        /*!< SCU SFSPC_5: EPUN Mask                  */
#define SCU_SFSPC_5_EHS_Pos                   5                                                       /*!< SCU SFSPC_5: EHS Position               */
#define SCU_SFSPC_5_EHS_Msk                   (0x01UL << SCU_SFSPC_5_EHS_Pos)                         /*!< SCU SFSPC_5: EHS Mask                   */
#define SCU_SFSPC_5_EZI_Pos                   6                                                       /*!< SCU SFSPC_5: EZI Position               */
#define SCU_SFSPC_5_EZI_Msk                   (0x01UL << SCU_SFSPC_5_EZI_Pos)                         /*!< SCU SFSPC_5: EZI Mask                   */
#define SCU_SFSPC_5_ZIF_Pos                   7                                                       /*!< SCU SFSPC_5: ZIF Position               */
#define SCU_SFSPC_5_ZIF_Msk                   (0x01UL << SCU_SFSPC_5_ZIF_Pos)                         /*!< SCU SFSPC_5: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPC_6  -------------------------------- */
#define SCU_SFSPC_6_MODE_Pos                  0                                                       /*!< SCU SFSPC_6: MODE Position              */
#define SCU_SFSPC_6_MODE_Msk                  (0x07UL << SCU_SFSPC_6_MODE_Pos)                        /*!< SCU SFSPC_6: MODE Mask                  */
#define SCU_SFSPC_6_EPD_Pos                   3                                                       /*!< SCU SFSPC_6: EPD Position               */
#define SCU_SFSPC_6_EPD_Msk                   (0x01UL << SCU_SFSPC_6_EPD_Pos)                         /*!< SCU SFSPC_6: EPD Mask                   */
#define SCU_SFSPC_6_EPUN_Pos                  4                                                       /*!< SCU SFSPC_6: EPUN Position              */
#define SCU_SFSPC_6_EPUN_Msk                  (0x01UL << SCU_SFSPC_6_EPUN_Pos)                        /*!< SCU SFSPC_6: EPUN Mask                  */
#define SCU_SFSPC_6_EHS_Pos                   5                                                       /*!< SCU SFSPC_6: EHS Position               */
#define SCU_SFSPC_6_EHS_Msk                   (0x01UL << SCU_SFSPC_6_EHS_Pos)                         /*!< SCU SFSPC_6: EHS Mask                   */
#define SCU_SFSPC_6_EZI_Pos                   6                                                       /*!< SCU SFSPC_6: EZI Position               */
#define SCU_SFSPC_6_EZI_Msk                   (0x01UL << SCU_SFSPC_6_EZI_Pos)                         /*!< SCU SFSPC_6: EZI Mask                   */
#define SCU_SFSPC_6_ZIF_Pos                   7                                                       /*!< SCU SFSPC_6: ZIF Position               */
#define SCU_SFSPC_6_ZIF_Msk                   (0x01UL << SCU_SFSPC_6_ZIF_Pos)                         /*!< SCU SFSPC_6: ZIF Mask                   */

