MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* --------------------------------  SCU_SFSPD_13  -------------------------------- */
#define SCU_SFSPD_13_MODE_Pos                 0                                                       /*!< SCU SFSPD_13: MODE Position             */
#define SCU_SFSPD_13_MODE_Msk                 (0x07UL << SCU_SFSPD_13_MODE_Pos)                       /*!< SCU SFSPD_13: MODE Mask                 */
#define SCU_SFSPD_13_EPD_Pos                  3                                                       /*!< SCU SFSPD_13: EPD Position              */
#define SCU_SFSPD_13_EPD_Msk                  (0x01UL << SCU_SFSPD_13_EPD_Pos)                        /*!< SCU SFSPD_13: EPD Mask                  */
#define SCU_SFSPD_13_EPUN_Pos                 4                                                       /*!< SCU SFSPD_13: EPUN Position             */
#define SCU_SFSPD_13_EPUN_Msk                 (0x01UL << SCU_SFSPD_13_EPUN_Pos)                       /*!< SCU SFSPD_13: EPUN Mask                 */
#define SCU_SFSPD_13_EHS_Pos                  5                                                       /*!< SCU SFSPD_13: EHS Position              */
#define SCU_SFSPD_13_EHS_Msk                  (0x01UL << SCU_SFSPD_13_EHS_Pos)                        /*!< SCU SFSPD_13: EHS Mask                  */
#define SCU_SFSPD_13_EZI_Pos                  6                                                       /*!< SCU SFSPD_13: EZI Position              */
#define SCU_SFSPD_13_EZI_Msk                  (0x01UL << SCU_SFSPD_13_EZI_Pos)                        /*!< SCU SFSPD_13: EZI Mask                  */
#define SCU_SFSPD_13_ZIF_Pos                  7                                                       /*!< SCU SFSPD_13: ZIF Position              */
#define SCU_SFSPD_13_ZIF_Msk                  (0x01UL << SCU_SFSPD_13_ZIF_Pos)                        /*!< SCU SFSPD_13: ZIF Mask                  */

/* --------------------------------  SCU_SFSPD_14  -------------------------------- */
#define SCU_SFSPD_14_MODE_Pos                 0                                                       /*!< SCU SFSPD_14: MODE Position             */
#define SCU_SFSPD_14_MODE_Msk                 (0x07UL << SCU_SFSPD_14_MODE_Pos)                       /*!< SCU SFSPD_14: MODE Mask                 */
#define SCU_SFSPD_14_EPD_Pos                  3                                                       /*!< SCU SFSPD_14: EPD Position              */
#define SCU_SFSPD_14_EPD_Msk                  (0x01UL << SCU_SFSPD_14_EPD_Pos)                        /*!< SCU SFSPD_14: EPD Mask                  */
#define SCU_SFSPD_14_EPUN_Pos                 4                                                       /*!< SCU SFSPD_14: EPUN Position             */
#define SCU_SFSPD_14_EPUN_Msk                 (0x01UL << SCU_SFSPD_14_EPUN_Pos)                       /*!< SCU SFSPD_14: EPUN Mask                 */
#define SCU_SFSPD_14_EHS_Pos                  5                                                       /*!< SCU SFSPD_14: EHS Position              */
#define SCU_SFSPD_14_EHS_Msk                  (0x01UL << SCU_SFSPD_14_EHS_Pos)                        /*!< SCU SFSPD_14: EHS Mask                  */
#define SCU_SFSPD_14_EZI_Pos                  6                                                       /*!< SCU SFSPD_14: EZI Position              */
#define SCU_SFSPD_14_EZI_Msk                  (0x01UL << SCU_SFSPD_14_EZI_Pos)                        /*!< SCU SFSPD_14: EZI Mask                  */
#define SCU_SFSPD_14_ZIF_Pos                  7                                                       /*!< SCU SFSPD_14: ZIF Position              */
#define SCU_SFSPD_14_ZIF_Msk                  (0x01UL << SCU_SFSPD_14_ZIF_Pos)                        /*!< SCU SFSPD_14: ZIF Mask                  */

/* --------------------------------  SCU_SFSPD_15  -------------------------------- */
#define SCU_SFSPD_15_MODE_Pos                 0                                                       /*!< SCU SFSPD_15: MODE Position             */
#define SCU_SFSPD_15_MODE_Msk                 (0x07UL << SCU_SFSPD_15_MODE_Pos)                       /*!< SCU SFSPD_15: MODE Mask                 */
#define SCU_SFSPD_15_EPD_Pos                  3                                                       /*!< SCU SFSPD_15: EPD Position              */
#define SCU_SFSPD_15_EPD_Msk                  (0x01UL << SCU_SFSPD_15_EPD_Pos)                        /*!< SCU SFSPD_15: EPD Mask                  */
#define SCU_SFSPD_15_EPUN_Pos                 4                                                       /*!< SCU SFSPD_15: EPUN Position             */
#define SCU_SFSPD_15_EPUN_Msk                 (0x01UL << SCU_SFSPD_15_EPUN_Pos)                       /*!< SCU SFSPD_15: EPUN Mask                 */
#define SCU_SFSPD_15_EHS_Pos                  5                                                       /*!< SCU SFSPD_15: EHS Position              */
#define SCU_SFSPD_15_EHS_Msk                  (0x01UL << SCU_SFSPD_15_EHS_Pos)                        /*!< SCU SFSPD_15: EHS Mask                  */
#define SCU_SFSPD_15_EZI_Pos                  6                                                       /*!< SCU SFSPD_15: EZI Position              */
#define SCU_SFSPD_15_EZI_Msk                  (0x01UL << SCU_SFSPD_15_EZI_Pos)                        /*!< SCU SFSPD_15: EZI Mask                  */
#define SCU_SFSPD_15_ZIF_Pos                  7                                                       /*!< SCU SFSPD_15: ZIF Position              */
#define SCU_SFSPD_15_ZIF_Msk                  (0x01UL << SCU_SFSPD_15_ZIF_Pos)                        /*!< SCU SFSPD_15: ZIF Mask                  */

/* --------------------------------  SCU_SFSPD_16  -------------------------------- */
#define SCU_SFSPD_16_MODE_Pos                 0                                                       /*!< SCU SFSPD_16: MODE Position             */
#define SCU_SFSPD_16_MODE_Msk                 (0x07UL << SCU_SFSPD_16_MODE_Pos)                       /*!< SCU SFSPD_16: MODE Mask                 */
#define SCU_SFSPD_16_EPD_Pos                  3                                                       /*!< SCU SFSPD_16: EPD Position              */
#define SCU_SFSPD_16_EPD_Msk                  (0x01UL << SCU_SFSPD_16_EPD_Pos)                        /*!< SCU SFSPD_16: EPD Mask                  */
#define SCU_SFSPD_16_EPUN_Pos                 4                                                       /*!< SCU SFSPD_16: EPUN Position             */
#define SCU_SFSPD_16_EPUN_Msk                 (0x01UL << SCU_SFSPD_16_EPUN_Pos)                       /*!< SCU SFSPD_16: EPUN Mask                 */
#define SCU_SFSPD_16_EHS_Pos                  5                                                       /*!< SCU SFSPD_16: EHS Position              */
#define SCU_SFSPD_16_EHS_Msk                  (0x01UL << SCU_SFSPD_16_EHS_Pos)                        /*!< SCU SFSPD_16: EHS Mask                  */
#define SCU_SFSPD_16_EZI_Pos                  6                                                       /*!< SCU SFSPD_16: EZI Position              */
#define SCU_SFSPD_16_EZI_Msk                  (0x01UL << SCU_SFSPD_16_EZI_Pos)                        /*!< SCU SFSPD_16: EZI Mask                  */
#define SCU_SFSPD_16_ZIF_Pos                  7                                                       /*!< SCU SFSPD_16: ZIF Position              */
#define SCU_SFSPD_16_ZIF_Msk                  (0x01UL << SCU_SFSPD_16_ZIF_Pos)                        /*!< SCU SFSPD_16: ZIF Mask                  */

