MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  SCU_ENAIO2  --------------------------------- */
#define SCU_ENAIO2_DAC_Pos                    0                                                       /*!< SCU ENAIO2: DAC Position                */
#define SCU_ENAIO2_DAC_Msk                    (0x01UL << SCU_ENAIO2_DAC_Pos)                          /*!< SCU ENAIO2: DAC Mask                    */
#define SCU_ENAIO2_BG_Pos                     4                                                       /*!< SCU ENAIO2: BG Position                 */
#define SCU_ENAIO2_BG_Msk                     (0x01UL << SCU_ENAIO2_BG_Pos)                           /*!< SCU ENAIO2: BG Mask                     */

/* -------------------------------  SCU_EMCDELAYCLK  ------------------------------ */
#define SCU_EMCDELAYCLK_CLK_DELAY_Pos         0                                                       /*!< SCU EMCDELAYCLK: CLK_DELAY Position     */
#define SCU_EMCDELAYCLK_CLK_DELAY_Msk         (0x0000ffffUL << SCU_EMCDELAYCLK_CLK_DELAY_Pos)         /*!< SCU EMCDELAYCLK: CLK_DELAY Mask         */

/* ---------------------------------  SCU_SDDELAY  -------------------------------- */
#define SCU_SDDELAY_SAMPLE_DELAY_Pos          0                                                       /*!< SCU SDDELAY: SAMPLE_DELAY Position      */
#define SCU_SDDELAY_SAMPLE_DELAY_Msk          (0x0fUL << SCU_SDDELAY_SAMPLE_DELAY_Pos)                /*!< SCU SDDELAY: SAMPLE_DELAY Mask          */
#define SCU_SDDELAY_DRV_DELAY_Pos             8                                                       /*!< SCU SDDELAY: DRV_DELAY Position         */
#define SCU_SDDELAY_DRV_DELAY_Msk             (0x0fUL << SCU_SDDELAY_DRV_DELAY_Pos)                   /*!< SCU SDDELAY: DRV_DELAY Mask             */

/* --------------------------------  SCU_PINTSEL0  -------------------------------- */
#define SCU_PINTSEL0_INTPIN0_Pos              0                                                       /*!< SCU PINTSEL0: INTPIN0 Position          */
#define SCU_PINTSEL0_INTPIN0_Msk              (0x1fUL << SCU_PINTSEL0_INTPIN0_Pos)                    /*!< SCU PINTSEL0: INTPIN0 Mask              */
#define SCU_PINTSEL0_PORTSEL0_Pos             5                                                       /*!< SCU PINTSEL0: PORTSEL0 Position         */
#define SCU_PINTSEL0_PORTSEL0_Msk             (0x07UL << SCU_PINTSEL0_PORTSEL0_Pos)                   /*!< SCU PINTSEL0: PORTSEL0 Mask             */
#define SCU_PINTSEL0_INTPIN1_Pos              8                                                       /*!< SCU PINTSEL0: INTPIN1 Position          */
#define SCU_PINTSEL0_INTPIN1_Msk              (0x1fUL << SCU_PINTSEL0_INTPIN1_Pos)                    /*!< SCU PINTSEL0: INTPIN1 Mask              */
#define SCU_PINTSEL0_PORTSEL1_Pos             13                                                      /*!< SCU PINTSEL0: PORTSEL1 Position         */
#define SCU_PINTSEL0_PORTSEL1_Msk             (0x07UL << SCU_PINTSEL0_PORTSEL1_Pos)                   /*!< SCU PINTSEL0: PORTSEL1 Mask             */
#define SCU_PINTSEL0_INTPIN2_Pos              16                                                      /*!< SCU PINTSEL0: INTPIN2 Position          */
#define SCU_PINTSEL0_INTPIN2_Msk              (0x1fUL << SCU_PINTSEL0_INTPIN2_Pos)                    /*!< SCU PINTSEL0: INTPIN2 Mask              */
#define SCU_PINTSEL0_PORTSEL2_Pos             21                                                      /*!< SCU PINTSEL0: PORTSEL2 Position         */
#define SCU_PINTSEL0_PORTSEL2_Msk             (0x07UL << SCU_PINTSEL0_PORTSEL2_Pos)                   /*!< SCU PINTSEL0: PORTSEL2 Mask             */
#define SCU_PINTSEL0_INTPIN3_Pos              24                                                      /*!< SCU PINTSEL0: INTPIN3 Position          */
#define SCU_PINTSEL0_INTPIN3_Msk              (0x1fUL << SCU_PINTSEL0_INTPIN3_Pos)                    /*!< SCU PINTSEL0: INTPIN3 Mask              */
#define SCU_PINTSEL0_PORTSEL3_Pos             29                                                      /*!< SCU PINTSEL0: PORTSEL3 Position         */
#define SCU_PINTSEL0_PORTSEL3_Msk             (0x07UL << SCU_PINTSEL0_PORTSEL3_Pos)                   /*!< SCU PINTSEL0: PORTSEL3 Mask             */

/* --------------------------------  SCU_PINTSEL1  -------------------------------- */
#define SCU_PINTSEL1_INTPIN4_Pos              0                                                       /*!< SCU PINTSEL1: INTPIN4 Position          */
#define SCU_PINTSEL1_INTPIN4_Msk              (0x1fUL << SCU_PINTSEL1_INTPIN4_Pos)                    /*!< SCU PINTSEL1: INTPIN4 Mask              */
#define SCU_PINTSEL1_PORTSEL4_Pos             5                                                       /*!< SCU PINTSEL1: PORTSEL4 Position         */
#define SCU_PINTSEL1_PORTSEL4_Msk             (0x07UL << SCU_PINTSEL1_PORTSEL4_Pos)                   /*!< SCU PINTSEL1: PORTSEL4 Mask             */
#define SCU_PINTSEL1_INTPIN5_Pos              8                                                       /*!< SCU PINTSEL1: INTPIN5 Position          */
#define SCU_PINTSEL1_INTPIN5_Msk              (0x1fUL << SCU_PINTSEL1_INTPIN5_Pos)                    /*!< SCU PINTSEL1: INTPIN5 Mask              */
#define SCU_PINTSEL1_PORTSEL5_Pos             13                                                      /*!< SCU PINTSEL1: PORTSEL5 Position         */
#define SCU_PINTSEL1_PORTSEL5_Msk             (0x07UL << SCU_PINTSEL1_PORTSEL5_Pos)                   /*!< SCU PINTSEL1: PORTSEL5 Mask             */
#define SCU_PINTSEL1_INTPIN6_Pos              16                                                      /*!< SCU PINTSEL1: INTPIN6 Position          */
#define SCU_PINTSEL1_INTPIN6_Msk              (0x1fUL << SCU_PINTSEL1_INTPIN6_Pos)                    /*!< SCU PINTSEL1: INTPIN6 Mask              */
#define SCU_PINTSEL1_PORTSEL6_Pos             21                                                      /*!< SCU PINTSEL1: PORTSEL6 Position         */
#define SCU_PINTSEL1_PORTSEL6_Msk             (0x07UL << SCU_PINTSEL1_PORTSEL6_Pos)                   /*!< SCU PINTSEL1: PORTSEL6 Mask             */
#define SCU_PINTSEL1_INTPIN7_Pos              24                                                      /*!< SCU PINTSEL1: INTPIN7 Position          */
#define SCU_PINTSEL1_INTPIN7_Msk              (0x1fUL << SCU_PINTSEL1_INTPIN7_Pos)                    /*!< SCU PINTSEL1: INTPIN7 Mask              */
#define SCU_PINTSEL1_PORTSEL7_Pos             29                                                      /*!< SCU PINTSEL1: PORTSEL7 Position         */
#define SCU_PINTSEL1_PORTSEL7_Msk             (0x07UL << SCU_PINTSEL1_PORTSEL7_Pos)                   /*!< SCU PINTSEL1: PORTSEL7 Mask             */


/* ================================================================================ */
/* ================      struct 'GPIO_PIN_INT' Position & Mask     ================ */
/* ================================================================================ */


/* ------------------------------  GPIO_PIN_INT_ISEL  ----------------------------- */
#define GPIO_PIN_INT_ISEL_PMODE0_Pos          0                                                       /*!< GPIO_PIN_INT ISEL: PMODE0 Position      */
#define GPIO_PIN_INT_ISEL_PMODE0_Msk          (0x01UL << GPIO_PIN_INT_ISEL_PMODE0_Pos)                /*!< GPIO_PIN_INT ISEL: PMODE0 Mask          */
#define GPIO_PIN_INT_ISEL_PMODE1_Pos          1                                                       /*!< GPIO_PIN_INT ISEL: PMODE1 Position      */
#define GPIO_PIN_INT_ISEL_PMODE1_Msk          (0x01UL << GPIO_PIN_INT_ISEL_PMODE1_Pos)                /*!< GPIO_PIN_INT ISEL: PMODE1 Mask          */
#define GPIO_PIN_INT_ISEL_PMODE2_Pos          2                                                       /*!< GPIO_PIN_INT ISEL: PMODE2 Position      */
#define GPIO_PIN_INT_ISEL_PMODE2_Msk          (0x01UL << GPIO_PIN_INT_ISEL_PMODE2_Pos)                /*!< GPIO_PIN_INT ISEL: PMODE2 Mask          */
#define GPIO_PIN_INT_ISEL_PMODE3_Pos          3                                                       /*!< GPIO_PIN_INT ISEL: PMODE3 Position      */
#define GPIO_PIN_INT_ISEL_PMODE3_Msk          (0x01UL << GPIO_PIN_INT_ISEL_PMODE3_Pos)                /*!< GPIO_PIN_INT ISEL: PMODE3 Mask          */
#define GPIO_PIN_INT_ISEL_PMODE4_Pos          4                                                       /*!< GPIO_PIN_INT ISEL: PMODE4 Position      */
#define GPIO_PIN_INT_ISEL_PMODE4_Msk          (0x01UL << GPIO_PIN_INT_ISEL_PMODE4_Pos)                /*!< GPIO_PIN_INT ISEL: PMODE4 Mask          */
#define GPIO_PIN_INT_ISEL_PMODE5_Pos          5                                                       /*!< GPIO_PIN_INT ISEL: PMODE5 Position      */
#define GPIO_PIN_INT_ISEL_PMODE5_Msk          (0x01UL << GPIO_PIN_INT_ISEL_PMODE5_Pos)                /*!< GPIO_PIN_INT ISEL: PMODE5 Mask          */
#define GPIO_PIN_INT_ISEL_PMODE6_Pos          6                                                       /*!< GPIO_PIN_INT ISEL: PMODE6 Position      */
#define GPIO_PIN_INT_ISEL_PMODE6_Msk          (0x01UL << GPIO_PIN_INT_ISEL_PMODE6_Pos)                /*!< GPIO_PIN_INT ISEL: PMODE6 Mask          */
#define GPIO_PIN_INT_ISEL_PMODE7_Pos          7                                                       /*!< GPIO_PIN_INT ISEL: PMODE7 Position      */
#define GPIO_PIN_INT_ISEL_PMODE7_Msk          (0x01UL << GPIO_PIN_INT_ISEL_PMODE7_Pos)                /*!< GPIO_PIN_INT ISEL: PMODE7 Mask          */

/* ------------------------------  GPIO_PIN_INT_IENR  ----------------------------- */
#define GPIO_PIN_INT_IENR_ENRL0_Pos           0                                                       /*!< GPIO_PIN_INT IENR: ENRL0 Position       */
#define GPIO_PIN_INT_IENR_ENRL0_Msk           (0x01UL << GPIO_PIN_INT_IENR_ENRL0_Pos)                 /*!< GPIO_PIN_INT IENR: ENRL0 Mask           */
#define GPIO_PIN_INT_IENR_ENRL1_Pos           1                                                       /*!< GPIO_PIN_INT IENR: ENRL1 Position       */
#define GPIO_PIN_INT_IENR_ENRL1_Msk           (0x01UL << GPIO_PIN_INT_IENR_ENRL1_Pos)                 /*!< GPIO_PIN_INT IENR: ENRL1 Mask           */
#define GPIO_PIN_INT_IENR_ENRL2_Pos           2                                                       /*!< GPIO_PIN_INT IENR: ENRL2 Position       */
#define GPIO_PIN_INT_IENR_ENRL2_Msk           (0x01UL << GPIO_PIN_INT_IENR_ENRL2_Pos)                 /*!< GPIO_PIN_INT IENR: ENRL2 Mask           */
#define GPIO_PIN_INT_IENR_ENRL3_Pos           3                                                       /*!< GPIO_PIN_INT IENR: ENRL3 Position       */
#define GPIO_PIN_INT_IENR_ENRL3_Msk           (0x01UL << GPIO_PIN_INT_IENR_ENRL3_Pos)                 /*!< GPIO_PIN_INT IENR: ENRL3 Mask           */
#define GPIO_PIN_INT_IENR_ENRL4_Pos           4                                                       /*!< GPIO_PIN_INT IENR: ENRL4 Position       */
#define GPIO_PIN_INT_IENR_ENRL4_Msk           (0x01UL << GPIO_PIN_INT_IENR_ENRL4_Pos)                 /*!< GPIO_PIN_INT IENR: ENRL4 Mask           */
#define GPIO_PIN_INT_IENR_ENRL5_Pos           5                                                       /*!< GPIO_PIN_INT IENR: ENRL5 Position       */
#define GPIO_PIN_INT_IENR_ENRL5_Msk           (0x01UL << GPIO_PIN_INT_IENR_ENRL5_Pos)                 /*!< GPIO_PIN_INT IENR: ENRL5 Mask           */
#define GPIO_PIN_INT_IENR_ENRL6_Pos           6                                                       /*!< GPIO_PIN_INT IENR: ENRL6 Position       */
#define GPIO_PIN_INT_IENR_ENRL6_Msk           (0x01UL << GPIO_PIN_INT_IENR_ENRL6_Pos)                 /*!< GPIO_PIN_INT IENR: ENRL6 Mask           */
#define GPIO_PIN_INT_IENR_ENRL7_Pos           7                                                       /*!< GPIO_PIN_INT IENR: ENRL7 Position       */
#define GPIO_PIN_INT_IENR_ENRL7_Msk           (0x01UL << GPIO_PIN_INT_IENR_ENRL7_Pos)                 /*!< GPIO_PIN_INT IENR: ENRL7 Mask           */

/* -----------------------------  GPIO_PIN_INT_SIENR  ----------------------------- */
#define GPIO_PIN_INT_SIENR_SETENRL0_Pos       0                                                       /*!< GPIO_PIN_INT SIENR: SETENRL0 Position   */
#define GPIO_PIN_INT_SIENR_SETENRL0_Msk       (0x01UL << GPIO_PIN_INT_SIENR_SETENRL0_Pos)             /*!< GPIO_PIN_INT SIENR: SETENRL0 Mask       */
#define GPIO_PIN_INT_SIENR_SETENRL1_Pos       1                                                       /*!< GPIO_PIN_INT SIENR: SETENRL1 Position   */
#define GPIO_PIN_INT_SIENR_SETENRL1_Msk       (0x01UL << GPIO_PIN_INT_SIENR_SETENRL1_Pos)             /*!< GPIO_PIN_INT SIENR: SETENRL1 Mask       */
#define GPIO_PIN_INT_SIENR_SETENRL2_Pos       2                                                       /*!< GPIO_PIN_INT SIENR: SETENRL2 Position   */
#define GPIO_PIN_INT_SIENR_SETENRL2_Msk       (0x01UL << GPIO_PIN_INT_SIENR_SETENRL2_Pos)             /*!< GPIO_PIN_INT SIENR: SETENRL2 Mask       */
#define GPIO_PIN_INT_SIENR_SETENRL3_Pos       3                                                       /*!< GPIO_PIN_INT SIENR: SETENRL3 Position   */
#define GPIO_PIN_INT_SIENR_SETENRL3_Msk       (0x01UL << GPIO_PIN_INT_SIENR_SETENRL3_Pos)             /*!< GPIO_PIN_INT SIENR: SETENRL3 Mask       */
#define GPIO_PIN_INT_SIENR_SETENRL4_Pos       4                                                       /*!< GPIO_PIN_INT SIENR: SETENRL4 Position   */
#define GPIO_PIN_INT_SIENR_SETENRL4_Msk       (0x01UL << GPIO_PIN_INT_SIENR_SETENRL4_Pos)             /*!< GPIO_PIN_INT SIENR: SETENRL4 Mask       */
#define GPIO_PIN_INT_SIENR_SETENRL5_Pos       5                                                       /*!< GPIO_PIN_INT SIENR: SETENRL5 Position   */
#define GPIO_PIN_INT_SIENR_SETENRL5_Msk       (0x01UL << GPIO_PIN_INT_SIENR_SETENRL5_Pos)             /*!< GPIO_PIN_INT SIENR: SETENRL5 Mask       */
#define GPIO_PIN_INT_SIENR_SETENRL6_Pos       6                                                       /*!< GPIO_PIN_INT SIENR: SETENRL6 Position   */
#define GPIO_PIN_INT_SIENR_SETENRL6_Msk       (0x01UL << GPIO_PIN_INT_SIENR_SETENRL6_Pos)             /*!< GPIO_PIN_INT SIENR: SETENRL6 Mask       */
#define GPIO_PIN_INT_SIENR_SETENRL7_Pos       7                                                       /*!< GPIO_PIN_INT SIENR: SETENRL7 Position   */
#define GPIO_PIN_INT_SIENR_SETENRL7_Msk       (0x01UL << GPIO_PIN_INT_SIENR_SETENRL7_Pos)             /*!< GPIO_PIN_INT SIENR: SETENRL7 Mask       */

/* -----------------------------  GPIO_PIN_INT_CIENR  ----------------------------- */
#define GPIO_PIN_INT_CIENR_CENRL0_Pos         0                                                       /*!< GPIO_PIN_INT CIENR: CENRL0 Position     */
#define GPIO_PIN_INT_CIENR_CENRL0_Msk         (0x01UL << GPIO_PIN_INT_CIENR_CENRL0_Pos)               /*!< GPIO_PIN_INT CIENR: CENRL0 Mask         */
#define GPIO_PIN_INT_CIENR_CENRL1_Pos         1                                                       /*!< GPIO_PIN_INT CIENR: CENRL1 Position     */
#define GPIO_PIN_INT_CIENR_CENRL1_Msk         (0x01UL << GPIO_PIN_INT_CIENR_CENRL1_Pos)               /*!< GPIO_PIN_INT CIENR: CENRL1 Mask         */
#define GPIO_PIN_INT_CIENR_CENRL2_Pos         2                                                       /*!< GPIO_PIN_INT CIENR: CENRL2 Position     */
#define GPIO_PIN_INT_CIENR_CENRL2_Msk         (0x01UL << GPIO_PIN_INT_CIENR_CENRL2_Pos)               /*!< GPIO_PIN_INT CIENR: CENRL2 Mask         */
#define GPIO_PIN_INT_CIENR_CENRL3_Pos         3                                                       /*!< GPIO_PIN_INT CIENR: CENRL3 Position     */
#define GPIO_PIN_INT_CIENR_CENRL3_Msk         (0x01UL << GPIO_PIN_INT_CIENR_CENRL3_Pos)               /*!< GPIO_PIN_INT CIENR: CENRL3 Mask         */
#define GPIO_PIN_INT_CIENR_CENRL4_Pos         4                                                       /*!< GPIO_PIN_INT CIENR: CENRL4 Position     */
#define GPIO_PIN_INT_CIENR_CENRL4_Msk         (0x01UL << GPIO_PIN_INT_CIENR_CENRL4_Pos)               /*!< GPIO_PIN_INT CIENR: CENRL4 Mask         */
#define GPIO_PIN_INT_CIENR_CENRL5_Pos         5                                                       /*!< GPIO_PIN_INT CIENR: CENRL5 Position     */
#define GPIO_PIN_INT_CIENR_CENRL5_Msk         (0x01UL << GPIO_PIN_INT_CIENR_CENRL5_Pos)               /*!< GPIO_PIN_INT CIENR: CENRL5 Mask         */
#define GPIO_PIN_INT_CIENR_CENRL6_Pos         6                                                       /*!< GPIO_PIN_INT CIENR: CENRL6 Position     */
#define GPIO_PIN_INT_CIENR_CENRL6_Msk         (0x01UL << GPIO_PIN_INT_CIENR_CENRL6_Pos)               /*!< GPIO_PIN_INT CIENR: CENRL6 Mask         */
#define GPIO_PIN_INT_CIENR_CENRL7_Pos         7                                                       /*!< GPIO_PIN_INT CIENR: CENRL7 Position     */
#define GPIO_PIN_INT_CIENR_CENRL7_Msk         (0x01UL << GPIO_PIN_INT_CIENR_CENRL7_Pos)               /*!< GPIO_PIN_INT CIENR: CENRL7 Mask         */

/* ------------------------------  GPIO_PIN_INT_IENF  ----------------------------- */
#define GPIO_PIN_INT_IENF_ENAF0_Pos           0                                                       /*!< GPIO_PIN_INT IENF: ENAF0 Position       */
#define GPIO_PIN_INT_IENF_ENAF0_Msk           (0x01UL << GPIO_PIN_INT_IENF_ENAF0_Pos)                 /*!< GPIO_PIN_INT IENF: ENAF0 Mask           */
#define GPIO_PIN_INT_IENF_ENAF1_Pos           1                                                       /*!< GPIO_PIN_INT IENF: ENAF1 Position       */
#define GPIO_PIN_INT_IENF_ENAF1_Msk           (0x01UL << GPIO_PIN_INT_IENF_ENAF1_Pos)                 /*!< GPIO_PIN_INT IENF: ENAF1 Mask           */
#define GPIO_PIN_INT_IENF_ENAF2_Pos           2                                                       /*!< GPIO_PIN_INT IENF: ENAF2 Position       */
#define GPIO_PIN_INT_IENF_ENAF2_Msk           (0x01UL << GPIO_PIN_INT_IENF_ENAF2_Pos)                 /*!< GPIO_PIN_INT IENF: ENAF2 Mask           */
#define GPIO_PIN_INT_IENF_ENAF3_Pos           3                                                       /*!< GPIO_PIN_INT IENF: ENAF3 Position       */
#define GPIO_PIN_INT_IENF_ENAF3_Msk           (0x01UL << GPIO_PIN_INT_IENF_ENAF3_Pos)                 /*!< GPIO_PIN_INT IENF: ENAF3 Mask           */
#define GPIO_PIN_INT_IENF_ENAF4_Pos           4                                                       /*!< GPIO_PIN_INT IENF: ENAF4 Position       */
#define GPIO_PIN_INT_IENF_ENAF4_Msk           (0x01UL << GPIO_PIN_INT_IENF_ENAF4_Pos)                 /*!< GPIO_PIN_INT IENF: ENAF4 Mask           */
#define GPIO_PIN_INT_IENF_ENAF5_Pos           5                                                       /*!< GPIO_PIN_INT IENF: ENAF5 Position       */
#define GPIO_PIN_INT_IENF_ENAF5_Msk           (0x01UL << GPIO_PIN_INT_IENF_ENAF5_Pos)                 /*!< GPIO_PIN_INT IENF: ENAF5 Mask           */
#define GPIO_PIN_INT_IENF_ENAF6_Pos           6                                                       /*!< GPIO_PIN_INT IENF: ENAF6 Position       */
#define GPIO_PIN_INT_IENF_ENAF6_Msk           (0x01UL << GPIO_PIN_INT_IENF_ENAF6_Pos)                 /*!< GPIO_PIN_INT IENF: ENAF6 Mask           */
#define GPIO_PIN_INT_IENF_ENAF7_Pos           7                                                       /*!< GPIO_PIN_INT IENF: ENAF7 Position       */
#define GPIO_PIN_INT_IENF_ENAF7_Msk           (0x01UL << GPIO_PIN_INT_IENF_ENAF7_Pos)                 /*!< GPIO_PIN_INT IENF: ENAF7 Mask           */

