MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* --------------------------  GPIO_GROUP_INT1_PORT_POL7  ------------------------- */
#define GPIO_GROUP_INT1_PORT_POL7_POL_0_Pos   0                                                       /*!< GPIO_GROUP_INT1 PORT_POL7: POL_0 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_0_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_0_Pos)         /*!< GPIO_GROUP_INT1 PORT_POL7: POL_0 Mask   */
#define GPIO_GROUP_INT1_PORT_POL7_POL_1_Pos   1                                                       /*!< GPIO_GROUP_INT1 PORT_POL7: POL_1 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_1_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_1_Pos)         /*!< GPIO_GROUP_INT1 PORT_POL7: POL_1 Mask   */
#define GPIO_GROUP_INT1_PORT_POL7_POL_2_Pos   2                                                       /*!< GPIO_GROUP_INT1 PORT_POL7: POL_2 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_2_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_2_Pos)         /*!< GPIO_GROUP_INT1 PORT_POL7: POL_2 Mask   */
#define GPIO_GROUP_INT1_PORT_POL7_POL_3_Pos   3                                                       /*!< GPIO_GROUP_INT1 PORT_POL7: POL_3 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_3_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_3_Pos)         /*!< GPIO_GROUP_INT1 PORT_POL7: POL_3 Mask   */
#define GPIO_GROUP_INT1_PORT_POL7_POL_4_Pos   4                                                       /*!< GPIO_GROUP_INT1 PORT_POL7: POL_4 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_4_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_4_Pos)         /*!< GPIO_GROUP_INT1 PORT_POL7: POL_4 Mask   */
#define GPIO_GROUP_INT1_PORT_POL7_POL_5_Pos   5                                                       /*!< GPIO_GROUP_INT1 PORT_POL7: POL_5 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_5_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_5_Pos)         /*!< GPIO_GROUP_INT1 PORT_POL7: POL_5 Mask   */
#define GPIO_GROUP_INT1_PORT_POL7_POL_6_Pos   6                                                       /*!< GPIO_GROUP_INT1 PORT_POL7: POL_6 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_6_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_6_Pos)         /*!< GPIO_GROUP_INT1 PORT_POL7: POL_6 Mask   */
#define GPIO_GROUP_INT1_PORT_POL7_POL_7_Pos   7                                                       /*!< GPIO_GROUP_INT1 PORT_POL7: POL_7 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_7_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_7_Pos)         /*!< GPIO_GROUP_INT1 PORT_POL7: POL_7 Mask   */
#define GPIO_GROUP_INT1_PORT_POL7_POL_8_Pos   8                                                       /*!< GPIO_GROUP_INT1 PORT_POL7: POL_8 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_8_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_8_Pos)         /*!< GPIO_GROUP_INT1 PORT_POL7: POL_8 Mask   */
#define GPIO_GROUP_INT1_PORT_POL7_POL_9_Pos   9                                                       /*!< GPIO_GROUP_INT1 PORT_POL7: POL_9 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_9_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_9_Pos)         /*!< GPIO_GROUP_INT1 PORT_POL7: POL_9 Mask   */
#define GPIO_GROUP_INT1_PORT_POL7_POL_10_Pos  10                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_10 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_10_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_10_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_10 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_11_Pos  11                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_11 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_11_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_11_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_11 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_12_Pos  12                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_12 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_12_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_12_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_12 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_13_Pos  13                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_13 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_13_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_13_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_13 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_14_Pos  14                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_14 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_14_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_14_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_14 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_15_Pos  15                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_15 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_15_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_15_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_15 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_16_Pos  16                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_16 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_16_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_16_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_16 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_17_Pos  17                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_17 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_17_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_17_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_17 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_18_Pos  18                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_18 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_18_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_18_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_18 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_19_Pos  19                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_19 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_19_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_19_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_19 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_20_Pos  20                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_20 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_20_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_20_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_20 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_21_Pos  21                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_21 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_21_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_21_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_21 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_22_Pos  22                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_22 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_22_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_22_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_22 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_23_Pos  23                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_23 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_23_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_23_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_23 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_24_Pos  24                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_24 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_24_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_24_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_24 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_25_Pos  25                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_25 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_25_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_25_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_25 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_26_Pos  26                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_26 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_26_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_26_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_26 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_27_Pos  27                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_27 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_27_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_27_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_27 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_28_Pos  28                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_28 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_28_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_28_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_28 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_29_Pos  29                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_29 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_29_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_29_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_29 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_30_Pos  30                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_30 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_30_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_30_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_30 Mask  */
#define GPIO_GROUP_INT1_PORT_POL7_POL_31_Pos  31                                                      /*!< GPIO_GROUP_INT1 PORT_POL7: POL_31 Position */
#define GPIO_GROUP_INT1_PORT_POL7_POL_31_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_POL7_POL_31_Pos)        /*!< GPIO_GROUP_INT1 PORT_POL7: POL_31 Mask  */

/* --------------------------  GPIO_GROUP_INT1_PORT_ENA0  ------------------------- */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_0_Pos   0                                                       /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_0 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_0_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_0_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_0 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_1_Pos   1                                                       /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_1 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_1_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_1_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_1 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_2_Pos   2                                                       /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_2 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_2_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_2_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_2 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_3_Pos   3                                                       /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_3 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_3_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_3_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_3 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_4_Pos   4                                                       /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_4 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_4_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_4_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_4 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_5_Pos   5                                                       /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_5 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_5_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_5_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_5 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_6_Pos   6                                                       /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_6 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_6_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_6_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_6 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_7_Pos   7                                                       /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_7 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_7_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_7_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_7 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_8_Pos   8                                                       /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_8 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_8_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_8_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_8 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_9_Pos   9                                                       /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_9 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_9_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_9_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_9 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_10_Pos  10                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_10 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_10_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_10_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_10 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_11_Pos  11                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_11 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_11_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_11_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_11 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_12_Pos  12                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_12 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_12_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_12_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_12 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_13_Pos  13                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_13 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_13_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_13_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_13 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_14_Pos  14                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_14 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_14_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_14_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_14 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_15_Pos  15                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_15 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_15_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_15_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_15 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_16_Pos  16                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_16 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_16_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_16_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_16 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_17_Pos  17                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_17 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_17_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_17_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_17 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_18_Pos  18                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_18 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_18_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_18_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_18 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_19_Pos  19                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_19 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_19_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_19_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_19 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_20_Pos  20                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_20 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_20_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_20_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_20 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_21_Pos  21                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_21 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_21_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_21_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_21 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_22_Pos  22                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_22 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_22_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_22_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_22 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_23_Pos  23                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_23 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_23_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_23_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_23 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_24_Pos  24                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_24 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_24_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_24_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_24 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_25_Pos  25                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_25 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_25_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_25_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_25 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_26_Pos  26                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_26 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_26_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_26_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_26 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_27_Pos  27                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_27 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_27_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_27_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_27 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_28_Pos  28                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_28 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_28_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_28_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_28 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_29_Pos  29                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_29 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_29_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_29_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_29 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_30_Pos  30                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_30 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_30_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_30_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_30 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_31_Pos  31                                                      /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_31 Position */
#define GPIO_GROUP_INT1_PORT_ENA0_ENA_31_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA0_ENA_31_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA0: ENA_31 Mask  */

