MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* --------------------------------  MCPWM_CON_CLR  ------------------------------- */
#define MCPWM_CON_CLR_RUN0_CLR_Pos            0                                                       /*!< MCPWM CON_CLR: RUN0_CLR Position        */
#define MCPWM_CON_CLR_RUN0_CLR_Msk            (0x01UL << MCPWM_CON_CLR_RUN0_CLR_Pos)                  /*!< MCPWM CON_CLR: RUN0_CLR Mask            */
#define MCPWM_CON_CLR_CENTER0_CLR_Pos         1                                                       /*!< MCPWM CON_CLR: CENTER0_CLR Position     */
#define MCPWM_CON_CLR_CENTER0_CLR_Msk         (0x01UL << MCPWM_CON_CLR_CENTER0_CLR_Pos)               /*!< MCPWM CON_CLR: CENTER0_CLR Mask         */
#define MCPWM_CON_CLR_POLA0_CLR_Pos           2                                                       /*!< MCPWM CON_CLR: POLA0_CLR Position       */
#define MCPWM_CON_CLR_POLA0_CLR_Msk           (0x01UL << MCPWM_CON_CLR_POLA0_CLR_Pos)                 /*!< MCPWM CON_CLR: POLA0_CLR Mask           */
#define MCPWM_CON_CLR_DTE0_CLR_Pos            3                                                       /*!< MCPWM CON_CLR: DTE0_CLR Position        */
#define MCPWM_CON_CLR_DTE0_CLR_Msk            (0x01UL << MCPWM_CON_CLR_DTE0_CLR_Pos)                  /*!< MCPWM CON_CLR: DTE0_CLR Mask            */
#define MCPWM_CON_CLR_DISUP0_CLR_Pos          4                                                       /*!< MCPWM CON_CLR: DISUP0_CLR Position      */
#define MCPWM_CON_CLR_DISUP0_CLR_Msk          (0x01UL << MCPWM_CON_CLR_DISUP0_CLR_Pos)                /*!< MCPWM CON_CLR: DISUP0_CLR Mask          */
#define MCPWM_CON_CLR_RUN1_CLR_Pos            8                                                       /*!< MCPWM CON_CLR: RUN1_CLR Position        */
#define MCPWM_CON_CLR_RUN1_CLR_Msk            (0x01UL << MCPWM_CON_CLR_RUN1_CLR_Pos)                  /*!< MCPWM CON_CLR: RUN1_CLR Mask            */
#define MCPWM_CON_CLR_CENTER1_CLR_Pos         9                                                       /*!< MCPWM CON_CLR: CENTER1_CLR Position     */
#define MCPWM_CON_CLR_CENTER1_CLR_Msk         (0x01UL << MCPWM_CON_CLR_CENTER1_CLR_Pos)               /*!< MCPWM CON_CLR: CENTER1_CLR Mask         */
#define MCPWM_CON_CLR_POLA1_CLR_Pos           10                                                      /*!< MCPWM CON_CLR: POLA1_CLR Position       */
#define MCPWM_CON_CLR_POLA1_CLR_Msk           (0x01UL << MCPWM_CON_CLR_POLA1_CLR_Pos)                 /*!< MCPWM CON_CLR: POLA1_CLR Mask           */
#define MCPWM_CON_CLR_DTE1_CLR_Pos            11                                                      /*!< MCPWM CON_CLR: DTE1_CLR Position        */
#define MCPWM_CON_CLR_DTE1_CLR_Msk            (0x01UL << MCPWM_CON_CLR_DTE1_CLR_Pos)                  /*!< MCPWM CON_CLR: DTE1_CLR Mask            */
#define MCPWM_CON_CLR_DISUP1_CLR_Pos          12                                                      /*!< MCPWM CON_CLR: DISUP1_CLR Position      */
#define MCPWM_CON_CLR_DISUP1_CLR_Msk          (0x01UL << MCPWM_CON_CLR_DISUP1_CLR_Pos)                /*!< MCPWM CON_CLR: DISUP1_CLR Mask          */
#define MCPWM_CON_CLR_RUN2_CLR_Pos            16                                                      /*!< MCPWM CON_CLR: RUN2_CLR Position        */
#define MCPWM_CON_CLR_RUN2_CLR_Msk            (0x01UL << MCPWM_CON_CLR_RUN2_CLR_Pos)                  /*!< MCPWM CON_CLR: RUN2_CLR Mask            */
#define MCPWM_CON_CLR_CENTER2_CLR_Pos         17                                                      /*!< MCPWM CON_CLR: CENTER2_CLR Position     */
#define MCPWM_CON_CLR_CENTER2_CLR_Msk         (0x01UL << MCPWM_CON_CLR_CENTER2_CLR_Pos)               /*!< MCPWM CON_CLR: CENTER2_CLR Mask         */
#define MCPWM_CON_CLR_POLA2_CLR_Pos           18                                                      /*!< MCPWM CON_CLR: POLA2_CLR Position       */
#define MCPWM_CON_CLR_POLA2_CLR_Msk           (0x01UL << MCPWM_CON_CLR_POLA2_CLR_Pos)                 /*!< MCPWM CON_CLR: POLA2_CLR Mask           */
#define MCPWM_CON_CLR_DTE2_CLR_Pos            19                                                      /*!< MCPWM CON_CLR: DTE2_CLR Position        */
#define MCPWM_CON_CLR_DTE2_CLR_Msk            (0x01UL << MCPWM_CON_CLR_DTE2_CLR_Pos)                  /*!< MCPWM CON_CLR: DTE2_CLR Mask            */
#define MCPWM_CON_CLR_DISUP2_CLR_Pos          20                                                      /*!< MCPWM CON_CLR: DISUP2_CLR Position      */
#define MCPWM_CON_CLR_DISUP2_CLR_Msk          (0x01UL << MCPWM_CON_CLR_DISUP2_CLR_Pos)                /*!< MCPWM CON_CLR: DISUP2_CLR Mask          */
#define MCPWM_CON_CLR_INVBDC_CLR_Pos          29                                                      /*!< MCPWM CON_CLR: INVBDC_CLR Position      */
#define MCPWM_CON_CLR_INVBDC_CLR_Msk          (0x01UL << MCPWM_CON_CLR_INVBDC_CLR_Pos)                /*!< MCPWM CON_CLR: INVBDC_CLR Mask          */
#define MCPWM_CON_CLR_ACMOD_CLR_Pos           30                                                      /*!< MCPWM CON_CLR: ACMOD_CLR Position       */
#define MCPWM_CON_CLR_ACMOD_CLR_Msk           (0x01UL << MCPWM_CON_CLR_ACMOD_CLR_Pos)                 /*!< MCPWM CON_CLR: ACMOD_CLR Mask           */
#define MCPWM_CON_CLR_DCMODE_CLR_Pos          31                                                      /*!< MCPWM CON_CLR: DCMODE_CLR Position      */
#define MCPWM_CON_CLR_DCMODE_CLR_Msk          (0x01UL << MCPWM_CON_CLR_DCMODE_CLR_Pos)                /*!< MCPWM CON_CLR: DCMODE_CLR Mask          */

/* --------------------------------  MCPWM_CAPCON  -------------------------------- */
#define MCPWM_CAPCON_CAP0MCI0_RE_Pos          0                                                       /*!< MCPWM CAPCON: CAP0MCI0_RE Position      */
#define MCPWM_CAPCON_CAP0MCI0_RE_Msk          (0x01UL << MCPWM_CAPCON_CAP0MCI0_RE_Pos)                /*!< MCPWM CAPCON: CAP0MCI0_RE Mask          */
#define MCPWM_CAPCON_CAP0MCI0_FE_Pos          1                                                       /*!< MCPWM CAPCON: CAP0MCI0_FE Position      */
#define MCPWM_CAPCON_CAP0MCI0_FE_Msk          (0x01UL << MCPWM_CAPCON_CAP0MCI0_FE_Pos)                /*!< MCPWM CAPCON: CAP0MCI0_FE Mask          */
#define MCPWM_CAPCON_CAP0MCI1_RE_Pos          2                                                       /*!< MCPWM CAPCON: CAP0MCI1_RE Position      */
#define MCPWM_CAPCON_CAP0MCI1_RE_Msk          (0x01UL << MCPWM_CAPCON_CAP0MCI1_RE_Pos)                /*!< MCPWM CAPCON: CAP0MCI1_RE Mask          */
#define MCPWM_CAPCON_CAP0MCI1_FE_Pos          3                                                       /*!< MCPWM CAPCON: CAP0MCI1_FE Position      */
#define MCPWM_CAPCON_CAP0MCI1_FE_Msk          (0x01UL << MCPWM_CAPCON_CAP0MCI1_FE_Pos)                /*!< MCPWM CAPCON: CAP0MCI1_FE Mask          */
#define MCPWM_CAPCON_CAP0MCI2_RE_Pos          4                                                       /*!< MCPWM CAPCON: CAP0MCI2_RE Position      */
#define MCPWM_CAPCON_CAP0MCI2_RE_Msk          (0x01UL << MCPWM_CAPCON_CAP0MCI2_RE_Pos)                /*!< MCPWM CAPCON: CAP0MCI2_RE Mask          */
#define MCPWM_CAPCON_CAP0MCI2_FE_Pos          5                                                       /*!< MCPWM CAPCON: CAP0MCI2_FE Position      */
#define MCPWM_CAPCON_CAP0MCI2_FE_Msk          (0x01UL << MCPWM_CAPCON_CAP0MCI2_FE_Pos)                /*!< MCPWM CAPCON: CAP0MCI2_FE Mask          */
#define MCPWM_CAPCON_CAP1MCI0_RE_Pos          6                                                       /*!< MCPWM CAPCON: CAP1MCI0_RE Position      */
#define MCPWM_CAPCON_CAP1MCI0_RE_Msk          (0x01UL << MCPWM_CAPCON_CAP1MCI0_RE_Pos)                /*!< MCPWM CAPCON: CAP1MCI0_RE Mask          */
#define MCPWM_CAPCON_CAP1MCI0_FE_Pos          7                                                       /*!< MCPWM CAPCON: CAP1MCI0_FE Position      */
#define MCPWM_CAPCON_CAP1MCI0_FE_Msk          (0x01UL << MCPWM_CAPCON_CAP1MCI0_FE_Pos)                /*!< MCPWM CAPCON: CAP1MCI0_FE Mask          */
#define MCPWM_CAPCON_CAP1MCI1_RE_Pos          8                                                       /*!< MCPWM CAPCON: CAP1MCI1_RE Position      */
#define MCPWM_CAPCON_CAP1MCI1_RE_Msk          (0x01UL << MCPWM_CAPCON_CAP1MCI1_RE_Pos)                /*!< MCPWM CAPCON: CAP1MCI1_RE Mask          */
#define MCPWM_CAPCON_CAP1MCI1_FE_Pos          9                                                       /*!< MCPWM CAPCON: CAP1MCI1_FE Position      */
#define MCPWM_CAPCON_CAP1MCI1_FE_Msk          (0x01UL << MCPWM_CAPCON_CAP1MCI1_FE_Pos)                /*!< MCPWM CAPCON: CAP1MCI1_FE Mask          */
#define MCPWM_CAPCON_CAP1MCI2_RE_Pos          10                                                      /*!< MCPWM CAPCON: CAP1MCI2_RE Position      */
#define MCPWM_CAPCON_CAP1MCI2_RE_Msk          (0x01UL << MCPWM_CAPCON_CAP1MCI2_RE_Pos)                /*!< MCPWM CAPCON: CAP1MCI2_RE Mask          */
#define MCPWM_CAPCON_CAP1MCI2_FE_Pos          11                                                      /*!< MCPWM CAPCON: CAP1MCI2_FE Position      */
#define MCPWM_CAPCON_CAP1MCI2_FE_Msk          (0x01UL << MCPWM_CAPCON_CAP1MCI2_FE_Pos)                /*!< MCPWM CAPCON: CAP1MCI2_FE Mask          */
#define MCPWM_CAPCON_CAP2MCI0_RE_Pos          12                                                      /*!< MCPWM CAPCON: CAP2MCI0_RE Position      */
#define MCPWM_CAPCON_CAP2MCI0_RE_Msk          (0x01UL << MCPWM_CAPCON_CAP2MCI0_RE_Pos)                /*!< MCPWM CAPCON: CAP2MCI0_RE Mask          */
#define MCPWM_CAPCON_CAP2MCI0_FE_Pos          13                                                      /*!< MCPWM CAPCON: CAP2MCI0_FE Position      */
#define MCPWM_CAPCON_CAP2MCI0_FE_Msk          (0x01UL << MCPWM_CAPCON_CAP2MCI0_FE_Pos)                /*!< MCPWM CAPCON: CAP2MCI0_FE Mask          */
#define MCPWM_CAPCON_CAP2MCI1_RE_Pos          14                                                      /*!< MCPWM CAPCON: CAP2MCI1_RE Position      */
#define MCPWM_CAPCON_CAP2MCI1_RE_Msk          (0x01UL << MCPWM_CAPCON_CAP2MCI1_RE_Pos)                /*!< MCPWM CAPCON: CAP2MCI1_RE Mask          */
#define MCPWM_CAPCON_CAP2MCI1_FE_Pos          15                                                      /*!< MCPWM CAPCON: CAP2MCI1_FE Position      */
#define MCPWM_CAPCON_CAP2MCI1_FE_Msk          (0x01UL << MCPWM_CAPCON_CAP2MCI1_FE_Pos)                /*!< MCPWM CAPCON: CAP2MCI1_FE Mask          */
#define MCPWM_CAPCON_CAP2MCI2_RE_Pos          16                                                      /*!< MCPWM CAPCON: CAP2MCI2_RE Position      */
#define MCPWM_CAPCON_CAP2MCI2_RE_Msk          (0x01UL << MCPWM_CAPCON_CAP2MCI2_RE_Pos)                /*!< MCPWM CAPCON: CAP2MCI2_RE Mask          */
#define MCPWM_CAPCON_CAP2MCI2_FE_Pos          17                                                      /*!< MCPWM CAPCON: CAP2MCI2_FE Position      */
#define MCPWM_CAPCON_CAP2MCI2_FE_Msk          (0x01UL << MCPWM_CAPCON_CAP2MCI2_FE_Pos)                /*!< MCPWM CAPCON: CAP2MCI2_FE Mask          */
#define MCPWM_CAPCON_RT0_Pos                  18                                                      /*!< MCPWM CAPCON: RT0 Position              */
#define MCPWM_CAPCON_RT0_Msk                  (0x01UL << MCPWM_CAPCON_RT0_Pos)                        /*!< MCPWM CAPCON: RT0 Mask                  */
#define MCPWM_CAPCON_RT1_Pos                  19                                                      /*!< MCPWM CAPCON: RT1 Position              */
#define MCPWM_CAPCON_RT1_Msk                  (0x01UL << MCPWM_CAPCON_RT1_Pos)                        /*!< MCPWM CAPCON: RT1 Mask                  */
#define MCPWM_CAPCON_RT2_Pos                  20                                                      /*!< MCPWM CAPCON: RT2 Position              */
#define MCPWM_CAPCON_RT2_Msk                  (0x01UL << MCPWM_CAPCON_RT2_Pos)                        /*!< MCPWM CAPCON: RT2 Mask                  */

/* ------------------------------  MCPWM_CAPCON_SET  ------------------------------ */
#define MCPWM_CAPCON_SET_CAP0MCI0_RE_SET_Pos  0                                                       /*!< MCPWM CAPCON_SET: CAP0MCI0_RE_SET Position */
#define MCPWM_CAPCON_SET_CAP0MCI0_RE_SET_Msk  (0x01UL << MCPWM_CAPCON_SET_CAP0MCI0_RE_SET_Pos)        /*!< MCPWM CAPCON_SET: CAP0MCI0_RE_SET Mask  */
#define MCPWM_CAPCON_SET_CAP0MCI0_FE_SET_Pos  1                                                       /*!< MCPWM CAPCON_SET: CAP0MCI0_FE_SET Position */
#define MCPWM_CAPCON_SET_CAP0MCI0_FE_SET_Msk  (0x01UL << MCPWM_CAPCON_SET_CAP0MCI0_FE_SET_Pos)        /*!< MCPWM CAPCON_SET: CAP0MCI0_FE_SET Mask  */
#define MCPWM_CAPCON_SET_CAP0MCI1_RE_SET_Pos  2                                                       /*!< MCPWM CAPCON_SET: CAP0MCI1_RE_SET Position */
#define MCPWM_CAPCON_SET_CAP0MCI1_RE_SET_Msk  (0x01UL << MCPWM_CAPCON_SET_CAP0MCI1_RE_SET_Pos)        /*!< MCPWM CAPCON_SET: CAP0MCI1_RE_SET Mask  */
#define MCPWM_CAPCON_SET_CAP0MCI1_FE_SET_Pos  3                                                       /*!< MCPWM CAPCON_SET: CAP0MCI1_FE_SET Position */
#define MCPWM_CAPCON_SET_CAP0MCI1_FE_SET_Msk  (0x01UL << MCPWM_CAPCON_SET_CAP0MCI1_FE_SET_Pos)        /*!< MCPWM CAPCON_SET: CAP0MCI1_FE_SET Mask  */
#define MCPWM_CAPCON_SET_CAP0MCI2_RE_SET_Pos  4                                                       /*!< MCPWM CAPCON_SET: CAP0MCI2_RE_SET Position */
#define MCPWM_CAPCON_SET_CAP0MCI2_RE_SET_Msk  (0x01UL << MCPWM_CAPCON_SET_CAP0MCI2_RE_SET_Pos)        /*!< MCPWM CAPCON_SET: CAP0MCI2_RE_SET Mask  */
#define MCPWM_CAPCON_SET_CAP0MCI2_FE_SET_Pos  5                                                       /*!< MCPWM CAPCON_SET: CAP0MCI2_FE_SET Position */
#define MCPWM_CAPCON_SET_CAP0MCI2_FE_SET_Msk  (0x01UL << MCPWM_CAPCON_SET_CAP0MCI2_FE_SET_Pos)        /*!< MCPWM CAPCON_SET: CAP0MCI2_FE_SET Mask  */
#define MCPWM_CAPCON_SET_CAP1MCI0_RE_SET_Pos  6                                                       /*!< MCPWM CAPCON_SET: CAP1MCI0_RE_SET Position */
#define MCPWM_CAPCON_SET_CAP1MCI0_RE_SET_Msk  (0x01UL << MCPWM_CAPCON_SET_CAP1MCI0_RE_SET_Pos)        /*!< MCPWM CAPCON_SET: CAP1MCI0_RE_SET Mask  */
#define MCPWM_CAPCON_SET_CAP1MCI0_FE_SET_Pos  7                                                       /*!< MCPWM CAPCON_SET: CAP1MCI0_FE_SET Position */
#define MCPWM_CAPCON_SET_CAP1MCI0_FE_SET_Msk  (0x01UL << MCPWM_CAPCON_SET_CAP1MCI0_FE_SET_Pos)        /*!< MCPWM CAPCON_SET: CAP1MCI0_FE_SET Mask  */
#define MCPWM_CAPCON_SET_CAP1MCI1_RE_SET_Pos  8                                                       /*!< MCPWM CAPCON_SET: CAP1MCI1_RE_SET Position */
#define MCPWM_CAPCON_SET_CAP1MCI1_RE_SET_Msk  (0x01UL << MCPWM_CAPCON_SET_CAP1MCI1_RE_SET_Pos)        /*!< MCPWM CAPCON_SET: CAP1MCI1_RE_SET Mask  */
#define MCPWM_CAPCON_SET_CAP1MCI1_FE_SET_Pos  9                                                       /*!< MCPWM CAPCON_SET: CAP1MCI1_FE_SET Position */
#define MCPWM_CAPCON_SET_CAP1MCI1_FE_SET_Msk  (0x01UL << MCPWM_CAPCON_SET_CAP1MCI1_FE_SET_Pos)        /*!< MCPWM CAPCON_SET: CAP1MCI1_FE_SET Mask  */
#define MCPWM_CAPCON_SET_CAP1MCI2_RE_SET_Pos  10                                                      /*!< MCPWM CAPCON_SET: CAP1MCI2_RE_SET Position */
#define MCPWM_CAPCON_SET_CAP1MCI2_RE_SET_Msk  (0x01UL << MCPWM_CAPCON_SET_CAP1MCI2_RE_SET_Pos)        /*!< MCPWM CAPCON_SET: CAP1MCI2_RE_SET Mask  */
#define MCPWM_CAPCON_SET_CAP1MCI2_FE_SET_Pos  11                                                      /*!< MCPWM CAPCON_SET: CAP1MCI2_FE_SET Position */
#define MCPWM_CAPCON_SET_CAP1MCI2_FE_SET_Msk  (0x01UL << MCPWM_CAPCON_SET_CAP1MCI2_FE_SET_Pos)        /*!< MCPWM CAPCON_SET: CAP1MCI2_FE_SET Mask  */
#define MCPWM_CAPCON_SET_CAP2MCI0_RE_SET_Pos  12                                                      /*!< MCPWM CAPCON_SET: CAP2MCI0_RE_SET Position */
#define MCPWM_CAPCON_SET_CAP2MCI0_RE_SET_Msk  (0x01UL << MCPWM_CAPCON_SET_CAP2MCI0_RE_SET_Pos)        /*!< MCPWM CAPCON_SET: CAP2MCI0_RE_SET Mask  */
#define MCPWM_CAPCON_SET_CAP2MCI0_FE_SET_Pos  13                                                      /*!< MCPWM CAPCON_SET: CAP2MCI0_FE_SET Position */
#define MCPWM_CAPCON_SET_CAP2MCI0_FE_SET_Msk  (0x01UL << MCPWM_CAPCON_SET_CAP2MCI0_FE_SET_Pos)        /*!< MCPWM CAPCON_SET: CAP2MCI0_FE_SET Mask  */
#define MCPWM_CAPCON_SET_CAP2MCI1_RE_SET_Pos  14                                                      /*!< MCPWM CAPCON_SET: CAP2MCI1_RE_SET Position */
#define MCPWM_CAPCON_SET_CAP2MCI1_RE_SET_Msk  (0x01UL << MCPWM_CAPCON_SET_CAP2MCI1_RE_SET_Pos)        /*!< MCPWM CAPCON_SET: CAP2MCI1_RE_SET Mask  */
#define MCPWM_CAPCON_SET_CAP2MCI1_FE_SET_Pos  15                                                      /*!< MCPWM CAPCON_SET: CAP2MCI1_FE_SET Position */
#define MCPWM_CAPCON_SET_CAP2MCI1_FE_SET_Msk  (0x01UL << MCPWM_CAPCON_SET_CAP2MCI1_FE_SET_Pos)        /*!< MCPWM CAPCON_SET: CAP2MCI1_FE_SET Mask  */
#define MCPWM_CAPCON_SET_CAP2MCI2_RE_SET_Pos  16                                                      /*!< MCPWM CAPCON_SET: CAP2MCI2_RE_SET Position */
#define MCPWM_CAPCON_SET_CAP2MCI2_RE_SET_Msk  (0x01UL << MCPWM_CAPCON_SET_CAP2MCI2_RE_SET_Pos)        /*!< MCPWM CAPCON_SET: CAP2MCI2_RE_SET Mask  */
#define MCPWM_CAPCON_SET_CAP2MCI2_FE_SET_Pos  17                                                      /*!< MCPWM CAPCON_SET: CAP2MCI2_FE_SET Position */
#define MCPWM_CAPCON_SET_CAP2MCI2_FE_SET_Msk  (0x01UL << MCPWM_CAPCON_SET_CAP2MCI2_FE_SET_Pos)        /*!< MCPWM CAPCON_SET: CAP2MCI2_FE_SET Mask  */
#define MCPWM_CAPCON_SET_RT0_SET_Pos          18                                                      /*!< MCPWM CAPCON_SET: RT0_SET Position      */
#define MCPWM_CAPCON_SET_RT0_SET_Msk          (0x01UL << MCPWM_CAPCON_SET_RT0_SET_Pos)                /*!< MCPWM CAPCON_SET: RT0_SET Mask          */
#define MCPWM_CAPCON_SET_RT1_SET_Pos          19                                                      /*!< MCPWM CAPCON_SET: RT1_SET Position      */
#define MCPWM_CAPCON_SET_RT1_SET_Msk          (0x01UL << MCPWM_CAPCON_SET_RT1_SET_Pos)                /*!< MCPWM CAPCON_SET: RT1_SET Mask          */
#define MCPWM_CAPCON_SET_RT2_SET_Pos          20                                                      /*!< MCPWM CAPCON_SET: RT2_SET Position      */
#define MCPWM_CAPCON_SET_RT2_SET_Msk          (0x01UL << MCPWM_CAPCON_SET_RT2_SET_Pos)                /*!< MCPWM CAPCON_SET: RT2_SET Mask          */

