MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ----------------------------------  MCPWM_TC0  --------------------------------- */
#define MCPWM_TC0_MCTC_Pos                    0                                                       /*!< MCPWM TC0: MCTC Position                */
#define MCPWM_TC0_MCTC_Msk                    (0xffffffffUL << MCPWM_TC0_MCTC_Pos)                    /*!< MCPWM TC0: MCTC Mask                    */

/* ----------------------------------  MCPWM_TC1  --------------------------------- */
#define MCPWM_TC1_MCTC_Pos                    0                                                       /*!< MCPWM TC1: MCTC Position                */
#define MCPWM_TC1_MCTC_Msk                    (0xffffffffUL << MCPWM_TC1_MCTC_Pos)                    /*!< MCPWM TC1: MCTC Mask                    */

/* ----------------------------------  MCPWM_TC2  --------------------------------- */
#define MCPWM_TC2_MCTC_Pos                    0                                                       /*!< MCPWM TC2: MCTC Position                */
#define MCPWM_TC2_MCTC_Msk                    (0xffffffffUL << MCPWM_TC2_MCTC_Pos)                    /*!< MCPWM TC2: MCTC Mask                    */

/* ---------------------------------  MCPWM_LIM0  --------------------------------- */
#define MCPWM_LIM0_MCLIM_Pos                  0                                                       /*!< MCPWM LIM0: MCLIM Position              */
#define MCPWM_LIM0_MCLIM_Msk                  (0xffffffffUL << MCPWM_LIM0_MCLIM_Pos)                  /*!< MCPWM LIM0: MCLIM Mask                  */

/* ---------------------------------  MCPWM_LIM1  --------------------------------- */
#define MCPWM_LIM1_MCLIM_Pos                  0                                                       /*!< MCPWM LIM1: MCLIM Position              */
#define MCPWM_LIM1_MCLIM_Msk                  (0xffffffffUL << MCPWM_LIM1_MCLIM_Pos)                  /*!< MCPWM LIM1: MCLIM Mask                  */

/* ---------------------------------  MCPWM_LIM2  --------------------------------- */
#define MCPWM_LIM2_MCLIM_Pos                  0                                                       /*!< MCPWM LIM2: MCLIM Position              */
#define MCPWM_LIM2_MCLIM_Msk                  (0xffffffffUL << MCPWM_LIM2_MCLIM_Pos)                  /*!< MCPWM LIM2: MCLIM Mask                  */

/* ---------------------------------  MCPWM_MAT0  --------------------------------- */
#define MCPWM_MAT0_MCMAT_Pos                  0                                                       /*!< MCPWM MAT0: MCMAT Position              */
#define MCPWM_MAT0_MCMAT_Msk                  (0xffffffffUL << MCPWM_MAT0_MCMAT_Pos)                  /*!< MCPWM MAT0: MCMAT Mask                  */

/* ---------------------------------  MCPWM_MAT1  --------------------------------- */
#define MCPWM_MAT1_MCMAT_Pos                  0                                                       /*!< MCPWM MAT1: MCMAT Position              */
#define MCPWM_MAT1_MCMAT_Msk                  (0xffffffffUL << MCPWM_MAT1_MCMAT_Pos)                  /*!< MCPWM MAT1: MCMAT Mask                  */

/* ---------------------------------  MCPWM_MAT2  --------------------------------- */
#define MCPWM_MAT2_MCMAT_Pos                  0                                                       /*!< MCPWM MAT2: MCMAT Position              */
#define MCPWM_MAT2_MCMAT_Msk                  (0xffffffffUL << MCPWM_MAT2_MCMAT_Pos)                  /*!< MCPWM MAT2: MCMAT Mask                  */

/* ----------------------------------  MCPWM_DT  ---------------------------------- */
#define MCPWM_DT_DT0_Pos                      0                                                       /*!< MCPWM DT: DT0 Position                  */
#define MCPWM_DT_DT0_Msk                      (0x000003ffUL << MCPWM_DT_DT0_Pos)                      /*!< MCPWM DT: DT0 Mask                      */
#define MCPWM_DT_DT1_Pos                      10                                                      /*!< MCPWM DT: DT1 Position                  */
#define MCPWM_DT_DT1_Msk                      (0x000003ffUL << MCPWM_DT_DT1_Pos)                      /*!< MCPWM DT: DT1 Mask                      */
#define MCPWM_DT_DT2_Pos                      20                                                      /*!< MCPWM DT: DT2 Position                  */
#define MCPWM_DT_DT2_Msk                      (0x000003ffUL << MCPWM_DT_DT2_Pos)                      /*!< MCPWM DT: DT2 Mask                      */

/* ----------------------------------  MCPWM_CCP  --------------------------------- */
#define MCPWM_CCP_CCPA0_Pos                   0                                                       /*!< MCPWM CCP: CCPA0 Position               */
#define MCPWM_CCP_CCPA0_Msk                   (0x01UL << MCPWM_CCP_CCPA0_Pos)                         /*!< MCPWM CCP: CCPA0 Mask                   */
#define MCPWM_CCP_CCPB0_Pos                   1                                                       /*!< MCPWM CCP: CCPB0 Position               */
#define MCPWM_CCP_CCPB0_Msk                   (0x01UL << MCPWM_CCP_CCPB0_Pos)                         /*!< MCPWM CCP: CCPB0 Mask                   */
#define MCPWM_CCP_CCPA1_Pos                   2                                                       /*!< MCPWM CCP: CCPA1 Position               */
#define MCPWM_CCP_CCPA1_Msk                   (0x01UL << MCPWM_CCP_CCPA1_Pos)                         /*!< MCPWM CCP: CCPA1 Mask                   */
#define MCPWM_CCP_CCPB1_Pos                   3                                                       /*!< MCPWM CCP: CCPB1 Position               */
#define MCPWM_CCP_CCPB1_Msk                   (0x01UL << MCPWM_CCP_CCPB1_Pos)                         /*!< MCPWM CCP: CCPB1 Mask                   */
#define MCPWM_CCP_CCPA2_Pos                   4                                                       /*!< MCPWM CCP: CCPA2 Position               */
#define MCPWM_CCP_CCPA2_Msk                   (0x01UL << MCPWM_CCP_CCPA2_Pos)                         /*!< MCPWM CCP: CCPA2 Mask                   */
#define MCPWM_CCP_CCPB2_Pos                   5                                                       /*!< MCPWM CCP: CCPB2 Position               */
#define MCPWM_CCP_CCPB2_Msk                   (0x01UL << MCPWM_CCP_CCPB2_Pos)                         /*!< MCPWM CCP: CCPB2 Mask                   */

/* ---------------------------------  MCPWM_CAP0  --------------------------------- */
#define MCPWM_CAP0_CAP_Pos                    0                                                       /*!< MCPWM CAP0: CAP Position                */
#define MCPWM_CAP0_CAP_Msk                    (0xffffffffUL << MCPWM_CAP0_CAP_Pos)                    /*!< MCPWM CAP0: CAP Mask                    */

/* ---------------------------------  MCPWM_CAP1  --------------------------------- */
#define MCPWM_CAP1_CAP_Pos                    0                                                       /*!< MCPWM CAP1: CAP Position                */
#define MCPWM_CAP1_CAP_Msk                    (0xffffffffUL << MCPWM_CAP1_CAP_Pos)                    /*!< MCPWM CAP1: CAP Mask                    */

/* ---------------------------------  MCPWM_CAP2  --------------------------------- */
#define MCPWM_CAP2_CAP_Pos                    0                                                       /*!< MCPWM CAP2: CAP Position                */
#define MCPWM_CAP2_CAP_Msk                    (0xffffffffUL << MCPWM_CAP2_CAP_Pos)                    /*!< MCPWM CAP2: CAP Mask                    */

