MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ------------------------------  MCPWM_CNTCON_CLR  ------------------------------ */
#define MCPWM_CNTCON_CLR_TC0MCI0_RE_CLR_Pos   0                                                       /*!< MCPWM CNTCON_CLR: TC0MCI0_RE_CLR Position */
#define MCPWM_CNTCON_CLR_TC0MCI0_RE_CLR_Msk   (0x01UL << MCPWM_CNTCON_CLR_TC0MCI0_RE_CLR_Pos)         /*!< MCPWM CNTCON_CLR: TC0MCI0_RE_CLR Mask   */
#define MCPWM_CNTCON_CLR_TC0MCI0_FE_CLR_Pos   1                                                       /*!< MCPWM CNTCON_CLR: TC0MCI0_FE_CLR Position */
#define MCPWM_CNTCON_CLR_TC0MCI0_FE_CLR_Msk   (0x01UL << MCPWM_CNTCON_CLR_TC0MCI0_FE_CLR_Pos)         /*!< MCPWM CNTCON_CLR: TC0MCI0_FE_CLR Mask   */
#define MCPWM_CNTCON_CLR_TC0MCI1_RE_CLR_Pos   2                                                       /*!< MCPWM CNTCON_CLR: TC0MCI1_RE_CLR Position */
#define MCPWM_CNTCON_CLR_TC0MCI1_RE_CLR_Msk   (0x01UL << MCPWM_CNTCON_CLR_TC0MCI1_RE_CLR_Pos)         /*!< MCPWM CNTCON_CLR: TC0MCI1_RE_CLR Mask   */
#define MCPWM_CNTCON_CLR_TC0MCI1_FE_CLR_Pos   3                                                       /*!< MCPWM CNTCON_CLR: TC0MCI1_FE_CLR Position */
#define MCPWM_CNTCON_CLR_TC0MCI1_FE_CLR_Msk   (0x01UL << MCPWM_CNTCON_CLR_TC0MCI1_FE_CLR_Pos)         /*!< MCPWM CNTCON_CLR: TC0MCI1_FE_CLR Mask   */
#define MCPWM_CNTCON_CLR_TC0MCI2_RE_Pos       4                                                       /*!< MCPWM CNTCON_CLR: TC0MCI2_RE Position   */
#define MCPWM_CNTCON_CLR_TC0MCI2_RE_Msk       (0x01UL << MCPWM_CNTCON_CLR_TC0MCI2_RE_Pos)             /*!< MCPWM CNTCON_CLR: TC0MCI2_RE Mask       */
#define MCPWM_CNTCON_CLR_TC0MCI2_FE_CLR_Pos   5                                                       /*!< MCPWM CNTCON_CLR: TC0MCI2_FE_CLR Position */
#define MCPWM_CNTCON_CLR_TC0MCI2_FE_CLR_Msk   (0x01UL << MCPWM_CNTCON_CLR_TC0MCI2_FE_CLR_Pos)         /*!< MCPWM CNTCON_CLR: TC0MCI2_FE_CLR Mask   */
#define MCPWM_CNTCON_CLR_TC1MCI0_RE_CLR_Pos   6                                                       /*!< MCPWM CNTCON_CLR: TC1MCI0_RE_CLR Position */
#define MCPWM_CNTCON_CLR_TC1MCI0_RE_CLR_Msk   (0x01UL << MCPWM_CNTCON_CLR_TC1MCI0_RE_CLR_Pos)         /*!< MCPWM CNTCON_CLR: TC1MCI0_RE_CLR Mask   */
#define MCPWM_CNTCON_CLR_TC1MCI0_FE_CLR_Pos   7                                                       /*!< MCPWM CNTCON_CLR: TC1MCI0_FE_CLR Position */
#define MCPWM_CNTCON_CLR_TC1MCI0_FE_CLR_Msk   (0x01UL << MCPWM_CNTCON_CLR_TC1MCI0_FE_CLR_Pos)         /*!< MCPWM CNTCON_CLR: TC1MCI0_FE_CLR Mask   */
#define MCPWM_CNTCON_CLR_TC1MCI1_RE_CLR_Pos   8                                                       /*!< MCPWM CNTCON_CLR: TC1MCI1_RE_CLR Position */
#define MCPWM_CNTCON_CLR_TC1MCI1_RE_CLR_Msk   (0x01UL << MCPWM_CNTCON_CLR_TC1MCI1_RE_CLR_Pos)         /*!< MCPWM CNTCON_CLR: TC1MCI1_RE_CLR Mask   */
#define MCPWM_CNTCON_CLR_TC1MCI1_FE_CLR_Pos   9                                                       /*!< MCPWM CNTCON_CLR: TC1MCI1_FE_CLR Position */
#define MCPWM_CNTCON_CLR_TC1MCI1_FE_CLR_Msk   (0x01UL << MCPWM_CNTCON_CLR_TC1MCI1_FE_CLR_Pos)         /*!< MCPWM CNTCON_CLR: TC1MCI1_FE_CLR Mask   */
#define MCPWM_CNTCON_CLR_TC1MCI2_RE_CLR_Pos   10                                                      /*!< MCPWM CNTCON_CLR: TC1MCI2_RE_CLR Position */
#define MCPWM_CNTCON_CLR_TC1MCI2_RE_CLR_Msk   (0x01UL << MCPWM_CNTCON_CLR_TC1MCI2_RE_CLR_Pos)         /*!< MCPWM CNTCON_CLR: TC1MCI2_RE_CLR Mask   */
#define MCPWM_CNTCON_CLR_TC1MCI2_FE_CLR_Pos   11                                                      /*!< MCPWM CNTCON_CLR: TC1MCI2_FE_CLR Position */
#define MCPWM_CNTCON_CLR_TC1MCI2_FE_CLR_Msk   (0x01UL << MCPWM_CNTCON_CLR_TC1MCI2_FE_CLR_Pos)         /*!< MCPWM CNTCON_CLR: TC1MCI2_FE_CLR Mask   */
#define MCPWM_CNTCON_CLR_TC2MCI0_RE_CLR_Pos   12                                                      /*!< MCPWM CNTCON_CLR: TC2MCI0_RE_CLR Position */
#define MCPWM_CNTCON_CLR_TC2MCI0_RE_CLR_Msk   (0x01UL << MCPWM_CNTCON_CLR_TC2MCI0_RE_CLR_Pos)         /*!< MCPWM CNTCON_CLR: TC2MCI0_RE_CLR Mask   */
#define MCPWM_CNTCON_CLR_TC2MCI0_FE_CLR_Pos   13                                                      /*!< MCPWM CNTCON_CLR: TC2MCI0_FE_CLR Position */
#define MCPWM_CNTCON_CLR_TC2MCI0_FE_CLR_Msk   (0x01UL << MCPWM_CNTCON_CLR_TC2MCI0_FE_CLR_Pos)         /*!< MCPWM CNTCON_CLR: TC2MCI0_FE_CLR Mask   */
#define MCPWM_CNTCON_CLR_TC2MCI1_RE_CLR_Pos   14                                                      /*!< MCPWM CNTCON_CLR: TC2MCI1_RE_CLR Position */
#define MCPWM_CNTCON_CLR_TC2MCI1_RE_CLR_Msk   (0x01UL << MCPWM_CNTCON_CLR_TC2MCI1_RE_CLR_Pos)         /*!< MCPWM CNTCON_CLR: TC2MCI1_RE_CLR Mask   */
#define MCPWM_CNTCON_CLR_TC2MCI1_FE_CLR_Pos   15                                                      /*!< MCPWM CNTCON_CLR: TC2MCI1_FE_CLR Position */
#define MCPWM_CNTCON_CLR_TC2MCI1_FE_CLR_Msk   (0x01UL << MCPWM_CNTCON_CLR_TC2MCI1_FE_CLR_Pos)         /*!< MCPWM CNTCON_CLR: TC2MCI1_FE_CLR Mask   */
#define MCPWM_CNTCON_CLR_TC2MCI2_RE_CLR_Pos   16                                                      /*!< MCPWM CNTCON_CLR: TC2MCI2_RE_CLR Position */
#define MCPWM_CNTCON_CLR_TC2MCI2_RE_CLR_Msk   (0x01UL << MCPWM_CNTCON_CLR_TC2MCI2_RE_CLR_Pos)         /*!< MCPWM CNTCON_CLR: TC2MCI2_RE_CLR Mask   */
#define MCPWM_CNTCON_CLR_TC2MCI2_FE_CLR_Pos   17                                                      /*!< MCPWM CNTCON_CLR: TC2MCI2_FE_CLR Position */
#define MCPWM_CNTCON_CLR_TC2MCI2_FE_CLR_Msk   (0x01UL << MCPWM_CNTCON_CLR_TC2MCI2_FE_CLR_Pos)         /*!< MCPWM CNTCON_CLR: TC2MCI2_FE_CLR Mask   */
#define MCPWM_CNTCON_CLR_CNTR0_CLR_Pos        29                                                      /*!< MCPWM CNTCON_CLR: CNTR0_CLR Position    */
#define MCPWM_CNTCON_CLR_CNTR0_CLR_Msk        (0x01UL << MCPWM_CNTCON_CLR_CNTR0_CLR_Pos)              /*!< MCPWM CNTCON_CLR: CNTR0_CLR Mask        */
#define MCPWM_CNTCON_CLR_CNTR1_CLR_Pos        30                                                      /*!< MCPWM CNTCON_CLR: CNTR1_CLR Position    */
#define MCPWM_CNTCON_CLR_CNTR1_CLR_Msk        (0x01UL << MCPWM_CNTCON_CLR_CNTR1_CLR_Pos)              /*!< MCPWM CNTCON_CLR: CNTR1_CLR Mask        */
#define MCPWM_CNTCON_CLR_CNTR2_CLR_Pos        31                                                      /*!< MCPWM CNTCON_CLR: CNTR2_CLR Position    */
#define MCPWM_CNTCON_CLR_CNTR2_CLR_Msk        (0x01UL << MCPWM_CNTCON_CLR_CNTR2_CLR_Pos)              /*!< MCPWM CNTCON_CLR: CNTR2_CLR Mask        */

/* ---------------------------------  MCPWM_INTF  --------------------------------- */
#define MCPWM_INTF_ILIM0_F_Pos                0                                                       /*!< MCPWM INTF: ILIM0_F Position            */
#define MCPWM_INTF_ILIM0_F_Msk                (0x01UL << MCPWM_INTF_ILIM0_F_Pos)                      /*!< MCPWM INTF: ILIM0_F Mask                */
#define MCPWM_INTF_IMAT0_F_Pos                1                                                       /*!< MCPWM INTF: IMAT0_F Position            */
#define MCPWM_INTF_IMAT0_F_Msk                (0x01UL << MCPWM_INTF_IMAT0_F_Pos)                      /*!< MCPWM INTF: IMAT0_F Mask                */
#define MCPWM_INTF_ICAP0_F_Pos                2                                                       /*!< MCPWM INTF: ICAP0_F Position            */
#define MCPWM_INTF_ICAP0_F_Msk                (0x01UL << MCPWM_INTF_ICAP0_F_Pos)                      /*!< MCPWM INTF: ICAP0_F Mask                */
#define MCPWM_INTF_ILIM1_F_Pos                4                                                       /*!< MCPWM INTF: ILIM1_F Position            */
#define MCPWM_INTF_ILIM1_F_Msk                (0x01UL << MCPWM_INTF_ILIM1_F_Pos)                      /*!< MCPWM INTF: ILIM1_F Mask                */
#define MCPWM_INTF_IMAT1_F_Pos                5                                                       /*!< MCPWM INTF: IMAT1_F Position            */
#define MCPWM_INTF_IMAT1_F_Msk                (0x01UL << MCPWM_INTF_IMAT1_F_Pos)                      /*!< MCPWM INTF: IMAT1_F Mask                */
#define MCPWM_INTF_ICAP1_F_Pos                6                                                       /*!< MCPWM INTF: ICAP1_F Position            */
#define MCPWM_INTF_ICAP1_F_Msk                (0x01UL << MCPWM_INTF_ICAP1_F_Pos)                      /*!< MCPWM INTF: ICAP1_F Mask                */
#define MCPWM_INTF_ILIM2_F_Pos                8                                                       /*!< MCPWM INTF: ILIM2_F Position            */
#define MCPWM_INTF_ILIM2_F_Msk                (0x01UL << MCPWM_INTF_ILIM2_F_Pos)                      /*!< MCPWM INTF: ILIM2_F Mask                */
#define MCPWM_INTF_IMAT2_F_Pos                9                                                       /*!< MCPWM INTF: IMAT2_F Position            */
#define MCPWM_INTF_IMAT2_F_Msk                (0x01UL << MCPWM_INTF_IMAT2_F_Pos)                      /*!< MCPWM INTF: IMAT2_F Mask                */
#define MCPWM_INTF_ICAP2_F_Pos                10                                                      /*!< MCPWM INTF: ICAP2_F Position            */
#define MCPWM_INTF_ICAP2_F_Msk                (0x01UL << MCPWM_INTF_ICAP2_F_Pos)                      /*!< MCPWM INTF: ICAP2_F Mask                */
#define MCPWM_INTF_ABORT_F_Pos                15                                                      /*!< MCPWM INTF: ABORT_F Position            */
#define MCPWM_INTF_ABORT_F_Msk                (0x01UL << MCPWM_INTF_ABORT_F_Pos)                      /*!< MCPWM INTF: ABORT_F Mask                */

