MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ------------------------------  I2Cn_DATA_BUFFER  ------------------------------ */
#define I2Cn_DATA_BUFFER_Data_Pos             0                                                       /*!< I2Cn DATA_BUFFER: Data Position         */
#define I2Cn_DATA_BUFFER_Data_Msk             (0x000000ffUL << I2Cn_DATA_BUFFER_Data_Pos)             /*!< I2Cn DATA_BUFFER: Data Mask             */

/* ---------------------------------  I2Cn_MASK0  --------------------------------- */
#define I2Cn_MASK0_MASK_Pos                   1                                                       /*!< I2Cn MASK0: MASK Position               */
#define I2Cn_MASK0_MASK_Msk                   (0x7fUL << I2Cn_MASK0_MASK_Pos)                         /*!< I2Cn MASK0: MASK Mask                   */

/* ---------------------------------  I2Cn_MASK1  --------------------------------- */
#define I2Cn_MASK1_MASK_Pos                   1                                                       /*!< I2Cn MASK1: MASK Position               */
#define I2Cn_MASK1_MASK_Msk                   (0x7fUL << I2Cn_MASK1_MASK_Pos)                         /*!< I2Cn MASK1: MASK Mask                   */

/* ---------------------------------  I2Cn_MASK2  --------------------------------- */
#define I2Cn_MASK2_MASK_Pos                   1                                                       /*!< I2Cn MASK2: MASK Position               */
#define I2Cn_MASK2_MASK_Msk                   (0x7fUL << I2Cn_MASK2_MASK_Pos)                         /*!< I2Cn MASK2: MASK Mask                   */

/* ---------------------------------  I2Cn_MASK3  --------------------------------- */
#define I2Cn_MASK3_MASK_Pos                   1                                                       /*!< I2Cn MASK3: MASK Position               */
#define I2Cn_MASK3_MASK_Msk                   (0x7fUL << I2Cn_MASK3_MASK_Pos)                         /*!< I2Cn MASK3: MASK Mask                   */


/* ================================================================================ */
/* ================          struct 'I2C0' Position & Mask         ================ */
/* ================================================================================ */


/* ---------------------------------  I2C0_CONSET  -------------------------------- */
#define I2C0_CONSET_AA_Pos                    2                                                       /*!< I2C0 CONSET: AA Position                */
#define I2C0_CONSET_AA_Msk                    (0x01UL << I2C0_CONSET_AA_Pos)                          /*!< I2C0 CONSET: AA Mask                    */
#define I2C0_CONSET_SI_Pos                    3                                                       /*!< I2C0 CONSET: SI Position                */
#define I2C0_CONSET_SI_Msk                    (0x01UL << I2C0_CONSET_SI_Pos)                          /*!< I2C0 CONSET: SI Mask                    */
#define I2C0_CONSET_STO_Pos                   4                                                       /*!< I2C0 CONSET: STO Position               */
#define I2C0_CONSET_STO_Msk                   (0x01UL << I2C0_CONSET_STO_Pos)                         /*!< I2C0 CONSET: STO Mask                   */
#define I2C0_CONSET_STA_Pos                   5                                                       /*!< I2C0 CONSET: STA Position               */
#define I2C0_CONSET_STA_Msk                   (0x01UL << I2C0_CONSET_STA_Pos)                         /*!< I2C0 CONSET: STA Mask                   */
#define I2C0_CONSET_I2EN_Pos                  6                                                       /*!< I2C0 CONSET: I2EN Position              */
#define I2C0_CONSET_I2EN_Msk                  (0x01UL << I2C0_CONSET_I2EN_Pos)                        /*!< I2C0 CONSET: I2EN Mask                  */

/* ----------------------------------  I2C0_STAT  --------------------------------- */
#define I2C0_STAT_Status_Pos                  3                                                       /*!< I2C0 STAT: Status Position              */
#define I2C0_STAT_Status_Msk                  (0x1fUL << I2C0_STAT_Status_Pos)                        /*!< I2C0 STAT: Status Mask                  */

/* ----------------------------------  I2C0_DAT  ---------------------------------- */
#define I2C0_DAT_Data_Pos                     0                                                       /*!< I2C0 DAT: Data Position                 */
#define I2C0_DAT_Data_Msk                     (0x000000ffUL << I2C0_DAT_Data_Pos)                     /*!< I2C0 DAT: Data Mask                     */

/* ----------------------------------  I2C0_ADR0  --------------------------------- */
#define I2C0_ADR0_GC_Pos                      0                                                       /*!< I2C0 ADR0: GC Position                  */
#define I2C0_ADR0_GC_Msk                      (0x01UL << I2C0_ADR0_GC_Pos)                            /*!< I2C0 ADR0: GC Mask                      */
#define I2C0_ADR0_Address_Pos                 1                                                       /*!< I2C0 ADR0: Address Position             */
#define I2C0_ADR0_Address_Msk                 (0x7fUL << I2C0_ADR0_Address_Pos)                       /*!< I2C0 ADR0: Address Mask                 */

/* ----------------------------------  I2C0_SCLH  --------------------------------- */
#define I2C0_SCLH_SCLH_Pos                    0                                                       /*!< I2C0 SCLH: SCLH Position                */
#define I2C0_SCLH_SCLH_Msk                    (0x0000ffffUL << I2C0_SCLH_SCLH_Pos)                    /*!< I2C0 SCLH: SCLH Mask                    */

/* ----------------------------------  I2C0_SCLL  --------------------------------- */
#define I2C0_SCLL_SCLL_Pos                    0                                                       /*!< I2C0 SCLL: SCLL Position                */
#define I2C0_SCLL_SCLL_Msk                    (0x0000ffffUL << I2C0_SCLL_SCLL_Pos)                    /*!< I2C0 SCLL: SCLL Mask                    */

/* ---------------------------------  I2C0_CONCLR  -------------------------------- */
#define I2C0_CONCLR_AAC_Pos                   2                                                       /*!< I2C0 CONCLR: AAC Position               */
#define I2C0_CONCLR_AAC_Msk                   (0x01UL << I2C0_CONCLR_AAC_Pos)                         /*!< I2C0 CONCLR: AAC Mask                   */
#define I2C0_CONCLR_SIC_Pos                   3                                                       /*!< I2C0 CONCLR: SIC Position               */
#define I2C0_CONCLR_SIC_Msk                   (0x01UL << I2C0_CONCLR_SIC_Pos)                         /*!< I2C0 CONCLR: SIC Mask                   */
#define I2C0_CONCLR_STAC_Pos                  5                                                       /*!< I2C0 CONCLR: STAC Position              */
#define I2C0_CONCLR_STAC_Msk                  (0x01UL << I2C0_CONCLR_STAC_Pos)                        /*!< I2C0 CONCLR: STAC Mask                  */
#define I2C0_CONCLR_I2ENC_Pos                 6                                                       /*!< I2C0 CONCLR: I2ENC Position             */
#define I2C0_CONCLR_I2ENC_Msk                 (0x01UL << I2C0_CONCLR_I2ENC_Pos)                       /*!< I2C0 CONCLR: I2ENC Mask                 */

/* ---------------------------------  I2C0_MMCTRL  -------------------------------- */
#define I2C0_MMCTRL_MM_ENA_Pos                0                                                       /*!< I2C0 MMCTRL: MM_ENA Position            */
#define I2C0_MMCTRL_MM_ENA_Msk                (0x01UL << I2C0_MMCTRL_MM_ENA_Pos)                      /*!< I2C0 MMCTRL: MM_ENA Mask                */
#define I2C0_MMCTRL_ENA_SCL_Pos               1                                                       /*!< I2C0 MMCTRL: ENA_SCL Position           */
#define I2C0_MMCTRL_ENA_SCL_Msk               (0x01UL << I2C0_MMCTRL_ENA_SCL_Pos)                     /*!< I2C0 MMCTRL: ENA_SCL Mask               */
#define I2C0_MMCTRL_MATCH_ALL_Pos             2                                                       /*!< I2C0 MMCTRL: MATCH_ALL Position         */
#define I2C0_MMCTRL_MATCH_ALL_Msk             (0x01UL << I2C0_MMCTRL_MATCH_ALL_Pos)                   /*!< I2C0 MMCTRL: MATCH_ALL Mask             */

/* ----------------------------------  I2C0_ADR1  --------------------------------- */
#define I2C0_ADR1_GC_Pos                      0                                                       /*!< I2C0 ADR1: GC Position                  */
#define I2C0_ADR1_GC_Msk                      (0x01UL << I2C0_ADR1_GC_Pos)                            /*!< I2C0 ADR1: GC Mask                      */
#define I2C0_ADR1_Address_Pos                 1                                                       /*!< I2C0 ADR1: Address Position             */
#define I2C0_ADR1_Address_Msk                 (0x7fUL << I2C0_ADR1_Address_Pos)                       /*!< I2C0 ADR1: Address Mask                 */

