MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ----------------------------------  I2Sn_DMA2  --------------------------------- */
#define I2Sn_DMA2_RX_DMA2_ENABLE_Pos          0                                                       /*!< I2Sn DMA2: RX_DMA2_ENABLE Position      */
#define I2Sn_DMA2_RX_DMA2_ENABLE_Msk          (0x01UL << I2Sn_DMA2_RX_DMA2_ENABLE_Pos)                /*!< I2Sn DMA2: RX_DMA2_ENABLE Mask          */
#define I2Sn_DMA2_TX_DMA2_ENABLE_Pos          1                                                       /*!< I2Sn DMA2: TX_DMA2_ENABLE Position      */
#define I2Sn_DMA2_TX_DMA2_ENABLE_Msk          (0x01UL << I2Sn_DMA2_TX_DMA2_ENABLE_Pos)                /*!< I2Sn DMA2: TX_DMA2_ENABLE Mask          */
#define I2Sn_DMA2_RX_DEPTH_DMA2_Pos           8                                                       /*!< I2Sn DMA2: RX_DEPTH_DMA2 Position       */
#define I2Sn_DMA2_RX_DEPTH_DMA2_Msk           (0x0fUL << I2Sn_DMA2_RX_DEPTH_DMA2_Pos)                 /*!< I2Sn DMA2: RX_DEPTH_DMA2 Mask           */
#define I2Sn_DMA2_TX_DEPTH_DMA2_Pos           16                                                      /*!< I2Sn DMA2: TX_DEPTH_DMA2 Position       */
#define I2Sn_DMA2_TX_DEPTH_DMA2_Msk           (0x0fUL << I2Sn_DMA2_TX_DEPTH_DMA2_Pos)                 /*!< I2Sn DMA2: TX_DEPTH_DMA2 Mask           */

/* ----------------------------------  I2Sn_IRQ  ---------------------------------- */
#define I2Sn_IRQ_RX_IRQ_ENABLE_Pos            0                                                       /*!< I2Sn IRQ: RX_IRQ_ENABLE Position        */
#define I2Sn_IRQ_RX_IRQ_ENABLE_Msk            (0x01UL << I2Sn_IRQ_RX_IRQ_ENABLE_Pos)                  /*!< I2Sn IRQ: RX_IRQ_ENABLE Mask            */
#define I2Sn_IRQ_TX_IRQ_ENABLE_Pos            1                                                       /*!< I2Sn IRQ: TX_IRQ_ENABLE Position        */
#define I2Sn_IRQ_TX_IRQ_ENABLE_Msk            (0x01UL << I2Sn_IRQ_TX_IRQ_ENABLE_Pos)                  /*!< I2Sn IRQ: TX_IRQ_ENABLE Mask            */
#define I2Sn_IRQ_RX_DEPTH_IRQ_Pos             8                                                       /*!< I2Sn IRQ: RX_DEPTH_IRQ Position         */
#define I2Sn_IRQ_RX_DEPTH_IRQ_Msk             (0x0fUL << I2Sn_IRQ_RX_DEPTH_IRQ_Pos)                   /*!< I2Sn IRQ: RX_DEPTH_IRQ Mask             */
#define I2Sn_IRQ_TX_DEPTH_IRQ_Pos             16                                                      /*!< I2Sn IRQ: TX_DEPTH_IRQ Position         */
#define I2Sn_IRQ_TX_DEPTH_IRQ_Msk             (0x0fUL << I2Sn_IRQ_TX_DEPTH_IRQ_Pos)                   /*!< I2Sn IRQ: TX_DEPTH_IRQ Mask             */

/* ---------------------------------  I2Sn_TXRATE  -------------------------------- */
#define I2Sn_TXRATE_Y_DIVIDER_Pos             0                                                       /*!< I2Sn TXRATE: Y_DIVIDER Position         */
#define I2Sn_TXRATE_Y_DIVIDER_Msk             (0x000000ffUL << I2Sn_TXRATE_Y_DIVIDER_Pos)             /*!< I2Sn TXRATE: Y_DIVIDER Mask             */
#define I2Sn_TXRATE_X_DIVIDER_Pos             8                                                       /*!< I2Sn TXRATE: X_DIVIDER Position         */
#define I2Sn_TXRATE_X_DIVIDER_Msk             (0x000000ffUL << I2Sn_TXRATE_X_DIVIDER_Pos)             /*!< I2Sn TXRATE: X_DIVIDER Mask             */

/* ---------------------------------  I2Sn_RXRATE  -------------------------------- */
#define I2Sn_RXRATE_Y_DIVIDER_Pos             0                                                       /*!< I2Sn RXRATE: Y_DIVIDER Position         */
#define I2Sn_RXRATE_Y_DIVIDER_Msk             (0x000000ffUL << I2Sn_RXRATE_Y_DIVIDER_Pos)             /*!< I2Sn RXRATE: Y_DIVIDER Mask             */
#define I2Sn_RXRATE_X_DIVIDER_Pos             8                                                       /*!< I2Sn RXRATE: X_DIVIDER Position         */
#define I2Sn_RXRATE_X_DIVIDER_Msk             (0x000000ffUL << I2Sn_RXRATE_X_DIVIDER_Pos)             /*!< I2Sn RXRATE: X_DIVIDER Mask             */

/* -------------------------------  I2Sn_TXBITRATE  ------------------------------- */
#define I2Sn_TXBITRATE_TX_BITRATE_Pos         0                                                       /*!< I2Sn TXBITRATE: TX_BITRATE Position     */
#define I2Sn_TXBITRATE_TX_BITRATE_Msk         (0x3fUL << I2Sn_TXBITRATE_TX_BITRATE_Pos)               /*!< I2Sn TXBITRATE: TX_BITRATE Mask         */

/* -------------------------------  I2Sn_RXBITRATE  ------------------------------- */
#define I2Sn_RXBITRATE_RX_BITRATE_Pos         0                                                       /*!< I2Sn RXBITRATE: RX_BITRATE Position     */
#define I2Sn_RXBITRATE_RX_BITRATE_Msk         (0x3fUL << I2Sn_RXBITRATE_RX_BITRATE_Pos)               /*!< I2Sn RXBITRATE: RX_BITRATE Mask         */

/* ---------------------------------  I2Sn_TXMODE  -------------------------------- */
#define I2Sn_TXMODE_TXCLKSEL_Pos              0                                                       /*!< I2Sn TXMODE: TXCLKSEL Position          */
#define I2Sn_TXMODE_TXCLKSEL_Msk              (0x03UL << I2Sn_TXMODE_TXCLKSEL_Pos)                    /*!< I2Sn TXMODE: TXCLKSEL Mask              */
#define I2Sn_TXMODE_TX4PIN_Pos                2                                                       /*!< I2Sn TXMODE: TX4PIN Position            */
#define I2Sn_TXMODE_TX4PIN_Msk                (0x01UL << I2Sn_TXMODE_TX4PIN_Pos)                      /*!< I2Sn TXMODE: TX4PIN Mask                */
#define I2Sn_TXMODE_TXMCENA_Pos               3                                                       /*!< I2Sn TXMODE: TXMCENA Position           */
#define I2Sn_TXMODE_TXMCENA_Msk               (0x01UL << I2Sn_TXMODE_TXMCENA_Pos)                     /*!< I2Sn TXMODE: TXMCENA Mask               */

/* ---------------------------------  I2Sn_RXMODE  -------------------------------- */
#define I2Sn_RXMODE_RXCLKSEL_Pos              0                                                       /*!< I2Sn RXMODE: RXCLKSEL Position          */
#define I2Sn_RXMODE_RXCLKSEL_Msk              (0x03UL << I2Sn_RXMODE_RXCLKSEL_Pos)                    /*!< I2Sn RXMODE: RXCLKSEL Mask              */
#define I2Sn_RXMODE_RX4PIN_Pos                2                                                       /*!< I2Sn RXMODE: RX4PIN Position            */
#define I2Sn_RXMODE_RX4PIN_Msk                (0x01UL << I2Sn_RXMODE_RX4PIN_Pos)                      /*!< I2Sn RXMODE: RX4PIN Mask                */
#define I2Sn_RXMODE_RXMCENA_Pos               3                                                       /*!< I2Sn RXMODE: RXMCENA Position           */
#define I2Sn_RXMODE_RXMCENA_Msk               (0x01UL << I2Sn_RXMODE_RXMCENA_Pos)                     /*!< I2Sn RXMODE: RXMCENA Mask               */


/* ================================================================================ */
/* ================          struct 'I2S0' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------------  I2S0_DAO  ---------------------------------- */
#define I2S0_DAO_WORDWIDTH_Pos                0                                                       /*!< I2S0 DAO: WORDWIDTH Position            */
#define I2S0_DAO_WORDWIDTH_Msk                (0x03UL << I2S0_DAO_WORDWIDTH_Pos)                      /*!< I2S0 DAO: WORDWIDTH Mask                */
#define I2S0_DAO_MONO_Pos                     2                                                       /*!< I2S0 DAO: MONO Position                 */
#define I2S0_DAO_MONO_Msk                     (0x01UL << I2S0_DAO_MONO_Pos)                           /*!< I2S0 DAO: MONO Mask                     */
#define I2S0_DAO_STOP_Pos                     3                                                       /*!< I2S0 DAO: STOP Position                 */
#define I2S0_DAO_STOP_Msk                     (0x01UL << I2S0_DAO_STOP_Pos)                           /*!< I2S0 DAO: STOP Mask                     */
#define I2S0_DAO_RESET_Pos                    4                                                       /*!< I2S0 DAO: RESET Position                */
#define I2S0_DAO_RESET_Msk                    (0x01UL << I2S0_DAO_RESET_Pos)                          /*!< I2S0 DAO: RESET Mask                    */
#define I2S0_DAO_WS_SEL_Pos                   5                                                       /*!< I2S0 DAO: WS_SEL Position               */
#define I2S0_DAO_WS_SEL_Msk                   (0x01UL << I2S0_DAO_WS_SEL_Pos)                         /*!< I2S0 DAO: WS_SEL Mask                   */
#define I2S0_DAO_WS_HALFPERIOD_Pos            6                                                       /*!< I2S0 DAO: WS_HALFPERIOD Position        */
#define I2S0_DAO_WS_HALFPERIOD_Msk            (0x000001ffUL << I2S0_DAO_WS_HALFPERIOD_Pos)            /*!< I2S0 DAO: WS_HALFPERIOD Mask            */
#define I2S0_DAO_MUTE_Pos                     15                                                      /*!< I2S0 DAO: MUTE Position                 */
#define I2S0_DAO_MUTE_Msk                     (0x01UL << I2S0_DAO_MUTE_Pos)                           /*!< I2S0 DAO: MUTE Mask                     */

/* ----------------------------------  I2S0_DAI  ---------------------------------- */
#define I2S0_DAI_WORDWIDTH_Pos                0                                                       /*!< I2S0 DAI: WORDWIDTH Position            */
#define I2S0_DAI_WORDWIDTH_Msk                (0x03UL << I2S0_DAI_WORDWIDTH_Pos)                      /*!< I2S0 DAI: WORDWIDTH Mask                */
#define I2S0_DAI_MONO_Pos                     2                                                       /*!< I2S0 DAI: MONO Position                 */
#define I2S0_DAI_MONO_Msk                     (0x01UL << I2S0_DAI_MONO_Pos)                           /*!< I2S0 DAI: MONO Mask                     */
#define I2S0_DAI_STOP_Pos                     3                                                       /*!< I2S0 DAI: STOP Position                 */
#define I2S0_DAI_STOP_Msk                     (0x01UL << I2S0_DAI_STOP_Pos)                           /*!< I2S0 DAI: STOP Mask                     */
#define I2S0_DAI_RESET_Pos                    4                                                       /*!< I2S0 DAI: RESET Position                */
#define I2S0_DAI_RESET_Msk                    (0x01UL << I2S0_DAI_RESET_Pos)                          /*!< I2S0 DAI: RESET Mask                    */
#define I2S0_DAI_WS_SEL_Pos                   5                                                       /*!< I2S0 DAI: WS_SEL Position               */
#define I2S0_DAI_WS_SEL_Msk                   (0x01UL << I2S0_DAI_WS_SEL_Pos)                         /*!< I2S0 DAI: WS_SEL Mask                   */
#define I2S0_DAI_WS_HALFPERIOD_Pos            6                                                       /*!< I2S0 DAI: WS_HALFPERIOD Position        */
#define I2S0_DAI_WS_HALFPERIOD_Msk            (0x000001ffUL << I2S0_DAI_WS_HALFPERIOD_Pos)            /*!< I2S0 DAI: WS_HALFPERIOD Mask            */

