MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  I2S0_RXMODE  -------------------------------- */
#define I2S0_RXMODE_RXCLKSEL_Pos              0                                                       /*!< I2S0 RXMODE: RXCLKSEL Position          */
#define I2S0_RXMODE_RXCLKSEL_Msk              (0x03UL << I2S0_RXMODE_RXCLKSEL_Pos)                    /*!< I2S0 RXMODE: RXCLKSEL Mask              */
#define I2S0_RXMODE_RX4PIN_Pos                2                                                       /*!< I2S0 RXMODE: RX4PIN Position            */
#define I2S0_RXMODE_RX4PIN_Msk                (0x01UL << I2S0_RXMODE_RX4PIN_Pos)                      /*!< I2S0 RXMODE: RX4PIN Mask                */
#define I2S0_RXMODE_RXMCENA_Pos               3                                                       /*!< I2S0 RXMODE: RXMCENA Position           */
#define I2S0_RXMODE_RXMCENA_Msk               (0x01UL << I2S0_RXMODE_RXMCENA_Pos)                     /*!< I2S0 RXMODE: RXMCENA Mask               */


/* ================================================================================ */
/* ================          struct 'I2S1' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------------  I2S1_DAO  ---------------------------------- */
#define I2S1_DAO_WORDWIDTH_Pos                0                                                       /*!< I2S1 DAO: WORDWIDTH Position            */
#define I2S1_DAO_WORDWIDTH_Msk                (0x03UL << I2S1_DAO_WORDWIDTH_Pos)                      /*!< I2S1 DAO: WORDWIDTH Mask                */
#define I2S1_DAO_MONO_Pos                     2                                                       /*!< I2S1 DAO: MONO Position                 */
#define I2S1_DAO_MONO_Msk                     (0x01UL << I2S1_DAO_MONO_Pos)                           /*!< I2S1 DAO: MONO Mask                     */
#define I2S1_DAO_STOP_Pos                     3                                                       /*!< I2S1 DAO: STOP Position                 */
#define I2S1_DAO_STOP_Msk                     (0x01UL << I2S1_DAO_STOP_Pos)                           /*!< I2S1 DAO: STOP Mask                     */
#define I2S1_DAO_RESET_Pos                    4                                                       /*!< I2S1 DAO: RESET Position                */
#define I2S1_DAO_RESET_Msk                    (0x01UL << I2S1_DAO_RESET_Pos)                          /*!< I2S1 DAO: RESET Mask                    */
#define I2S1_DAO_WS_SEL_Pos                   5                                                       /*!< I2S1 DAO: WS_SEL Position               */
#define I2S1_DAO_WS_SEL_Msk                   (0x01UL << I2S1_DAO_WS_SEL_Pos)                         /*!< I2S1 DAO: WS_SEL Mask                   */
#define I2S1_DAO_WS_HALFPERIOD_Pos            6                                                       /*!< I2S1 DAO: WS_HALFPERIOD Position        */
#define I2S1_DAO_WS_HALFPERIOD_Msk            (0x000001ffUL << I2S1_DAO_WS_HALFPERIOD_Pos)            /*!< I2S1 DAO: WS_HALFPERIOD Mask            */
#define I2S1_DAO_MUTE_Pos                     15                                                      /*!< I2S1 DAO: MUTE Position                 */
#define I2S1_DAO_MUTE_Msk                     (0x01UL << I2S1_DAO_MUTE_Pos)                           /*!< I2S1 DAO: MUTE Mask                     */

/* ----------------------------------  I2S1_DAI  ---------------------------------- */
#define I2S1_DAI_WORDWIDTH_Pos                0                                                       /*!< I2S1 DAI: WORDWIDTH Position            */
#define I2S1_DAI_WORDWIDTH_Msk                (0x03UL << I2S1_DAI_WORDWIDTH_Pos)                      /*!< I2S1 DAI: WORDWIDTH Mask                */
#define I2S1_DAI_MONO_Pos                     2                                                       /*!< I2S1 DAI: MONO Position                 */
#define I2S1_DAI_MONO_Msk                     (0x01UL << I2S1_DAI_MONO_Pos)                           /*!< I2S1 DAI: MONO Mask                     */
#define I2S1_DAI_STOP_Pos                     3                                                       /*!< I2S1 DAI: STOP Position                 */
#define I2S1_DAI_STOP_Msk                     (0x01UL << I2S1_DAI_STOP_Pos)                           /*!< I2S1 DAI: STOP Mask                     */
#define I2S1_DAI_RESET_Pos                    4                                                       /*!< I2S1 DAI: RESET Position                */
#define I2S1_DAI_RESET_Msk                    (0x01UL << I2S1_DAI_RESET_Pos)                          /*!< I2S1 DAI: RESET Mask                    */
#define I2S1_DAI_WS_SEL_Pos                   5                                                       /*!< I2S1 DAI: WS_SEL Position               */
#define I2S1_DAI_WS_SEL_Msk                   (0x01UL << I2S1_DAI_WS_SEL_Pos)                         /*!< I2S1 DAI: WS_SEL Mask                   */
#define I2S1_DAI_WS_HALFPERIOD_Pos            6                                                       /*!< I2S1 DAI: WS_HALFPERIOD Position        */
#define I2S1_DAI_WS_HALFPERIOD_Msk            (0x000001ffUL << I2S1_DAI_WS_HALFPERIOD_Pos)            /*!< I2S1 DAI: WS_HALFPERIOD Mask            */

/* ---------------------------------  I2S1_TXFIFO  -------------------------------- */
#define I2S1_TXFIFO_I2STXFIFO_Pos             0                                                       /*!< I2S1 TXFIFO: I2STXFIFO Position         */
#define I2S1_TXFIFO_I2STXFIFO_Msk             (0xffffffffUL << I2S1_TXFIFO_I2STXFIFO_Pos)             /*!< I2S1 TXFIFO: I2STXFIFO Mask             */

/* ---------------------------------  I2S1_RXFIFO  -------------------------------- */
#define I2S1_RXFIFO_I2SRXFIFO_Pos             0                                                       /*!< I2S1 RXFIFO: I2SRXFIFO Position         */
#define I2S1_RXFIFO_I2SRXFIFO_Msk             (0xffffffffUL << I2S1_RXFIFO_I2SRXFIFO_Pos)             /*!< I2S1 RXFIFO: I2SRXFIFO Mask             */

