MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ----------------------------------  C_CANn_EC  --------------------------------- */
#define C_CANn_EC_TEC_7_0_Pos                 0                                                       /*!< C_CANn EC: TEC_7_0 Position             */
#define C_CANn_EC_TEC_7_0_Msk                 (0x000000ffUL << C_CANn_EC_TEC_7_0_Pos)                 /*!< C_CANn EC: TEC_7_0 Mask                 */
#define C_CANn_EC_REC_6_0_Pos                 8                                                       /*!< C_CANn EC: REC_6_0 Position             */
#define C_CANn_EC_REC_6_0_Msk                 (0x7fUL << C_CANn_EC_REC_6_0_Pos)                       /*!< C_CANn EC: REC_6_0 Mask                 */
#define C_CANn_EC_RP_Pos                      15                                                      /*!< C_CANn EC: RP Position                  */
#define C_CANn_EC_RP_Msk                      (0x01UL << C_CANn_EC_RP_Pos)                            /*!< C_CANn EC: RP Mask                      */

/* ----------------------------------  C_CANn_BT  --------------------------------- */
#define C_CANn_BT_BRP_Pos                     0                                                       /*!< C_CANn BT: BRP Position                 */
#define C_CANn_BT_BRP_Msk                     (0x3fUL << C_CANn_BT_BRP_Pos)                           /*!< C_CANn BT: BRP Mask                     */
#define C_CANn_BT_SJW_Pos                     6                                                       /*!< C_CANn BT: SJW Position                 */
#define C_CANn_BT_SJW_Msk                     (0x03UL << C_CANn_BT_SJW_Pos)                           /*!< C_CANn BT: SJW Mask                     */
#define C_CANn_BT_TSEG1_Pos                   8                                                       /*!< C_CANn BT: TSEG1 Position               */
#define C_CANn_BT_TSEG1_Msk                   (0x0fUL << C_CANn_BT_TSEG1_Pos)                         /*!< C_CANn BT: TSEG1 Mask                   */
#define C_CANn_BT_TSEG2_Pos                   12                                                      /*!< C_CANn BT: TSEG2 Position               */
#define C_CANn_BT_TSEG2_Msk                   (0x07UL << C_CANn_BT_TSEG2_Pos)                         /*!< C_CANn BT: TSEG2 Mask                   */

/* ---------------------------------  C_CANn_INT  --------------------------------- */
#define C_CANn_INT_INTID15_0_Pos              0                                                       /*!< C_CANn INT: INTID15_0 Position          */
#define C_CANn_INT_INTID15_0_Msk              (0x0000ffffUL << C_CANn_INT_INTID15_0_Pos)              /*!< C_CANn INT: INTID15_0 Mask              */

/* ---------------------------------  C_CANn_TEST  -------------------------------- */
#define C_CANn_TEST_BASIC_Pos                 2                                                       /*!< C_CANn TEST: BASIC Position             */
#define C_CANn_TEST_BASIC_Msk                 (0x01UL << C_CANn_TEST_BASIC_Pos)                       /*!< C_CANn TEST: BASIC Mask                 */
#define C_CANn_TEST_SILENT_Pos                3                                                       /*!< C_CANn TEST: SILENT Position            */
#define C_CANn_TEST_SILENT_Msk                (0x01UL << C_CANn_TEST_SILENT_Pos)                      /*!< C_CANn TEST: SILENT Mask                */
#define C_CANn_TEST_LBACK_Pos                 4                                                       /*!< C_CANn TEST: LBACK Position             */
#define C_CANn_TEST_LBACK_Msk                 (0x01UL << C_CANn_TEST_LBACK_Pos)                       /*!< C_CANn TEST: LBACK Mask                 */
#define C_CANn_TEST_TX1_0_Pos                 5                                                       /*!< C_CANn TEST: TX1_0 Position             */
#define C_CANn_TEST_TX1_0_Msk                 (0x03UL << C_CANn_TEST_TX1_0_Pos)                       /*!< C_CANn TEST: TX1_0 Mask                 */
#define C_CANn_TEST_RX_Pos                    7                                                       /*!< C_CANn TEST: RX Position                */
#define C_CANn_TEST_RX_Msk                    (0x01UL << C_CANn_TEST_RX_Pos)                          /*!< C_CANn TEST: RX Mask                    */

/* ---------------------------------  C_CANn_BRPE  -------------------------------- */
#define C_CANn_BRPE_BRPE_Pos                  0                                                       /*!< C_CANn BRPE: BRPE Position              */
#define C_CANn_BRPE_BRPE_Msk                  (0x0fUL << C_CANn_BRPE_BRPE_Pos)                        /*!< C_CANn BRPE: BRPE Mask                  */

/* ------------------------------  C_CANn_IF1_CMDREQ  ----------------------------- */
#define C_CANn_IF1_CMDREQ_MESSNUM_Pos         0                                                       /*!< C_CANn IF1_CMDREQ: MESSNUM Position     */
#define C_CANn_IF1_CMDREQ_MESSNUM_Msk         (0x3fUL << C_CANn_IF1_CMDREQ_MESSNUM_Pos)               /*!< C_CANn IF1_CMDREQ: MESSNUM Mask         */
#define C_CANn_IF1_CMDREQ_BUSY_Pos            15                                                      /*!< C_CANn IF1_CMDREQ: BUSY Position        */
#define C_CANn_IF1_CMDREQ_BUSY_Msk            (0x01UL << C_CANn_IF1_CMDREQ_BUSY_Pos)                  /*!< C_CANn IF1_CMDREQ: BUSY Mask            */

/* -----------------------------  C_CANn_IF1_CMDMSK_W  ---------------------------- */
#define C_CANn_IF1_CMDMSK_W_DATA_B_Pos        0                                                       /*!< C_CANn IF1_CMDMSK_W: DATA_B Position    */
#define C_CANn_IF1_CMDMSK_W_DATA_B_Msk        (0x01UL << C_CANn_IF1_CMDMSK_W_DATA_B_Pos)              /*!< C_CANn IF1_CMDMSK_W: DATA_B Mask        */
#define C_CANn_IF1_CMDMSK_W_DATA_A_Pos        1                                                       /*!< C_CANn IF1_CMDMSK_W: DATA_A Position    */
#define C_CANn_IF1_CMDMSK_W_DATA_A_Msk        (0x01UL << C_CANn_IF1_CMDMSK_W_DATA_A_Pos)              /*!< C_CANn IF1_CMDMSK_W: DATA_A Mask        */
#define C_CANn_IF1_CMDMSK_W_TXRQST_Pos        2                                                       /*!< C_CANn IF1_CMDMSK_W: TXRQST Position    */
#define C_CANn_IF1_CMDMSK_W_TXRQST_Msk        (0x01UL << C_CANn_IF1_CMDMSK_W_TXRQST_Pos)              /*!< C_CANn IF1_CMDMSK_W: TXRQST Mask        */
#define C_CANn_IF1_CMDMSK_W_CLRINTPND_Pos     3                                                       /*!< C_CANn IF1_CMDMSK_W: CLRINTPND Position */
#define C_CANn_IF1_CMDMSK_W_CLRINTPND_Msk     (0x01UL << C_CANn_IF1_CMDMSK_W_CLRINTPND_Pos)           /*!< C_CANn IF1_CMDMSK_W: CLRINTPND Mask     */
#define C_CANn_IF1_CMDMSK_W_CTRL_Pos          4                                                       /*!< C_CANn IF1_CMDMSK_W: CTRL Position      */
#define C_CANn_IF1_CMDMSK_W_CTRL_Msk          (0x01UL << C_CANn_IF1_CMDMSK_W_CTRL_Pos)                /*!< C_CANn IF1_CMDMSK_W: CTRL Mask          */
#define C_CANn_IF1_CMDMSK_W_ARB_Pos           5                                                       /*!< C_CANn IF1_CMDMSK_W: ARB Position       */
#define C_CANn_IF1_CMDMSK_W_ARB_Msk           (0x01UL << C_CANn_IF1_CMDMSK_W_ARB_Pos)                 /*!< C_CANn IF1_CMDMSK_W: ARB Mask           */
#define C_CANn_IF1_CMDMSK_W_MASK_Pos          6                                                       /*!< C_CANn IF1_CMDMSK_W: MASK Position      */
#define C_CANn_IF1_CMDMSK_W_MASK_Msk          (0x01UL << C_CANn_IF1_CMDMSK_W_MASK_Pos)                /*!< C_CANn IF1_CMDMSK_W: MASK Mask          */
#define C_CANn_IF1_CMDMSK_W_WR_RD_Pos         7                                                       /*!< C_CANn IF1_CMDMSK_W: WR_RD Position     */
#define C_CANn_IF1_CMDMSK_W_WR_RD_Msk         (0x01UL << C_CANn_IF1_CMDMSK_W_WR_RD_Pos)               /*!< C_CANn IF1_CMDMSK_W: WR_RD Mask         */

/* -----------------------------  C_CANn_IF1_CMDMSK_R  ---------------------------- */
#define C_CANn_IF1_CMDMSK_R_DATA_B_Pos        0                                                       /*!< C_CANn IF1_CMDMSK_R: DATA_B Position    */
#define C_CANn_IF1_CMDMSK_R_DATA_B_Msk        (0x01UL << C_CANn_IF1_CMDMSK_R_DATA_B_Pos)              /*!< C_CANn IF1_CMDMSK_R: DATA_B Mask        */
#define C_CANn_IF1_CMDMSK_R_DATA_A_Pos        1                                                       /*!< C_CANn IF1_CMDMSK_R: DATA_A Position    */
#define C_CANn_IF1_CMDMSK_R_DATA_A_Msk        (0x01UL << C_CANn_IF1_CMDMSK_R_DATA_A_Pos)              /*!< C_CANn IF1_CMDMSK_R: DATA_A Mask        */
#define C_CANn_IF1_CMDMSK_R_NEWDAT_Pos        2                                                       /*!< C_CANn IF1_CMDMSK_R: NEWDAT Position    */
#define C_CANn_IF1_CMDMSK_R_NEWDAT_Msk        (0x01UL << C_CANn_IF1_CMDMSK_R_NEWDAT_Pos)              /*!< C_CANn IF1_CMDMSK_R: NEWDAT Mask        */
#define C_CANn_IF1_CMDMSK_R_CLRINTPND_Pos     3                                                       /*!< C_CANn IF1_CMDMSK_R: CLRINTPND Position */
#define C_CANn_IF1_CMDMSK_R_CLRINTPND_Msk     (0x01UL << C_CANn_IF1_CMDMSK_R_CLRINTPND_Pos)           /*!< C_CANn IF1_CMDMSK_R: CLRINTPND Mask     */
#define C_CANn_IF1_CMDMSK_R_CTRL_Pos          4                                                       /*!< C_CANn IF1_CMDMSK_R: CTRL Position      */
#define C_CANn_IF1_CMDMSK_R_CTRL_Msk          (0x01UL << C_CANn_IF1_CMDMSK_R_CTRL_Pos)                /*!< C_CANn IF1_CMDMSK_R: CTRL Mask          */
#define C_CANn_IF1_CMDMSK_R_ARB_Pos           5                                                       /*!< C_CANn IF1_CMDMSK_R: ARB Position       */
#define C_CANn_IF1_CMDMSK_R_ARB_Msk           (0x01UL << C_CANn_IF1_CMDMSK_R_ARB_Pos)                 /*!< C_CANn IF1_CMDMSK_R: ARB Mask           */
#define C_CANn_IF1_CMDMSK_R_MASK_Pos          6                                                       /*!< C_CANn IF1_CMDMSK_R: MASK Position      */
#define C_CANn_IF1_CMDMSK_R_MASK_Msk          (0x01UL << C_CANn_IF1_CMDMSK_R_MASK_Pos)                /*!< C_CANn IF1_CMDMSK_R: MASK Mask          */
#define C_CANn_IF1_CMDMSK_R_WR_RD_Pos         7                                                       /*!< C_CANn IF1_CMDMSK_R: WR_RD Position     */
#define C_CANn_IF1_CMDMSK_R_WR_RD_Msk         (0x01UL << C_CANn_IF1_CMDMSK_R_WR_RD_Pos)               /*!< C_CANn IF1_CMDMSK_R: WR_RD Mask         */

/* -------------------------------  C_CANn_IF1_MSK1  ------------------------------ */
#define C_CANn_IF1_MSK1_MSK15_0_Pos           0                                                       /*!< C_CANn IF1_MSK1: MSK15_0 Position       */
#define C_CANn_IF1_MSK1_MSK15_0_Msk           (0x0000ffffUL << C_CANn_IF1_MSK1_MSK15_0_Pos)           /*!< C_CANn IF1_MSK1: MSK15_0 Mask           */

/* -------------------------------  C_CANn_IF1_MSK2  ------------------------------ */
#define C_CANn_IF1_MSK2_MSK28_16_Pos          0                                                       /*!< C_CANn IF1_MSK2: MSK28_16 Position      */
#define C_CANn_IF1_MSK2_MSK28_16_Msk          (0x00001fffUL << C_CANn_IF1_MSK2_MSK28_16_Pos)          /*!< C_CANn IF1_MSK2: MSK28_16 Mask          */
#define C_CANn_IF1_MSK2_MDIR_Pos              14                                                      /*!< C_CANn IF1_MSK2: MDIR Position          */
#define C_CANn_IF1_MSK2_MDIR_Msk              (0x01UL << C_CANn_IF1_MSK2_MDIR_Pos)                    /*!< C_CANn IF1_MSK2: MDIR Mask              */
#define C_CANn_IF1_MSK2_MXTD_Pos              15                                                      /*!< C_CANn IF1_MSK2: MXTD Position          */
#define C_CANn_IF1_MSK2_MXTD_Msk              (0x01UL << C_CANn_IF1_MSK2_MXTD_Pos)                    /*!< C_CANn IF1_MSK2: MXTD Mask              */

/* -------------------------------  C_CANn_IF1_ARB1  ------------------------------ */
#define C_CANn_IF1_ARB1_ID15_0_Pos            0                                                       /*!< C_CANn IF1_ARB1: ID15_0 Position        */
#define C_CANn_IF1_ARB1_ID15_0_Msk            (0x0000ffffUL << C_CANn_IF1_ARB1_ID15_0_Pos)            /*!< C_CANn IF1_ARB1: ID15_0 Mask            */

