MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ------------------------------  C_CANn_IF2_CMDREQ  ----------------------------- */
#define C_CANn_IF2_CMDREQ_MESSNUM_Pos         0                                                       /*!< C_CANn IF2_CMDREQ: MESSNUM Position     */
#define C_CANn_IF2_CMDREQ_MESSNUM_Msk         (0x3fUL << C_CANn_IF2_CMDREQ_MESSNUM_Pos)               /*!< C_CANn IF2_CMDREQ: MESSNUM Mask         */
#define C_CANn_IF2_CMDREQ_BUSY_Pos            15                                                      /*!< C_CANn IF2_CMDREQ: BUSY Position        */
#define C_CANn_IF2_CMDREQ_BUSY_Msk            (0x01UL << C_CANn_IF2_CMDREQ_BUSY_Pos)                  /*!< C_CANn IF2_CMDREQ: BUSY Mask            */

/* -----------------------------  C_CANn_IF2_CMDMSK_W  ---------------------------- */
#define C_CANn_IF2_CMDMSK_W_DATA_B_Pos        0                                                       /*!< C_CANn IF2_CMDMSK_W: DATA_B Position    */
#define C_CANn_IF2_CMDMSK_W_DATA_B_Msk        (0x01UL << C_CANn_IF2_CMDMSK_W_DATA_B_Pos)              /*!< C_CANn IF2_CMDMSK_W: DATA_B Mask        */
#define C_CANn_IF2_CMDMSK_W_DATA_A_Pos        1                                                       /*!< C_CANn IF2_CMDMSK_W: DATA_A Position    */
#define C_CANn_IF2_CMDMSK_W_DATA_A_Msk        (0x01UL << C_CANn_IF2_CMDMSK_W_DATA_A_Pos)              /*!< C_CANn IF2_CMDMSK_W: DATA_A Mask        */
#define C_CANn_IF2_CMDMSK_W_TXRQST_Pos        2                                                       /*!< C_CANn IF2_CMDMSK_W: TXRQST Position    */
#define C_CANn_IF2_CMDMSK_W_TXRQST_Msk        (0x01UL << C_CANn_IF2_CMDMSK_W_TXRQST_Pos)              /*!< C_CANn IF2_CMDMSK_W: TXRQST Mask        */
#define C_CANn_IF2_CMDMSK_W_CLRINTPND_Pos     3                                                       /*!< C_CANn IF2_CMDMSK_W: CLRINTPND Position */
#define C_CANn_IF2_CMDMSK_W_CLRINTPND_Msk     (0x01UL << C_CANn_IF2_CMDMSK_W_CLRINTPND_Pos)           /*!< C_CANn IF2_CMDMSK_W: CLRINTPND Mask     */
#define C_CANn_IF2_CMDMSK_W_CTRL_Pos          4                                                       /*!< C_CANn IF2_CMDMSK_W: CTRL Position      */
#define C_CANn_IF2_CMDMSK_W_CTRL_Msk          (0x01UL << C_CANn_IF2_CMDMSK_W_CTRL_Pos)                /*!< C_CANn IF2_CMDMSK_W: CTRL Mask          */
#define C_CANn_IF2_CMDMSK_W_ARB_Pos           5                                                       /*!< C_CANn IF2_CMDMSK_W: ARB Position       */
#define C_CANn_IF2_CMDMSK_W_ARB_Msk           (0x01UL << C_CANn_IF2_CMDMSK_W_ARB_Pos)                 /*!< C_CANn IF2_CMDMSK_W: ARB Mask           */
#define C_CANn_IF2_CMDMSK_W_MASK_Pos          6                                                       /*!< C_CANn IF2_CMDMSK_W: MASK Position      */
#define C_CANn_IF2_CMDMSK_W_MASK_Msk          (0x01UL << C_CANn_IF2_CMDMSK_W_MASK_Pos)                /*!< C_CANn IF2_CMDMSK_W: MASK Mask          */
#define C_CANn_IF2_CMDMSK_W_WR_RD_Pos         7                                                       /*!< C_CANn IF2_CMDMSK_W: WR_RD Position     */
#define C_CANn_IF2_CMDMSK_W_WR_RD_Msk         (0x01UL << C_CANn_IF2_CMDMSK_W_WR_RD_Pos)               /*!< C_CANn IF2_CMDMSK_W: WR_RD Mask         */

/* -----------------------------  C_CANn_IF2_CMDMSK_R  ---------------------------- */
#define C_CANn_IF2_CMDMSK_R_DATA_B_Pos        0                                                       /*!< C_CANn IF2_CMDMSK_R: DATA_B Position    */
#define C_CANn_IF2_CMDMSK_R_DATA_B_Msk        (0x01UL << C_CANn_IF2_CMDMSK_R_DATA_B_Pos)              /*!< C_CANn IF2_CMDMSK_R: DATA_B Mask        */
#define C_CANn_IF2_CMDMSK_R_DATA_A_Pos        1                                                       /*!< C_CANn IF2_CMDMSK_R: DATA_A Position    */
#define C_CANn_IF2_CMDMSK_R_DATA_A_Msk        (0x01UL << C_CANn_IF2_CMDMSK_R_DATA_A_Pos)              /*!< C_CANn IF2_CMDMSK_R: DATA_A Mask        */
#define C_CANn_IF2_CMDMSK_R_NEWDAT_Pos        2                                                       /*!< C_CANn IF2_CMDMSK_R: NEWDAT Position    */
#define C_CANn_IF2_CMDMSK_R_NEWDAT_Msk        (0x01UL << C_CANn_IF2_CMDMSK_R_NEWDAT_Pos)              /*!< C_CANn IF2_CMDMSK_R: NEWDAT Mask        */
#define C_CANn_IF2_CMDMSK_R_CLRINTPND_Pos     3                                                       /*!< C_CANn IF2_CMDMSK_R: CLRINTPND Position */
#define C_CANn_IF2_CMDMSK_R_CLRINTPND_Msk     (0x01UL << C_CANn_IF2_CMDMSK_R_CLRINTPND_Pos)           /*!< C_CANn IF2_CMDMSK_R: CLRINTPND Mask     */
#define C_CANn_IF2_CMDMSK_R_CTRL_Pos          4                                                       /*!< C_CANn IF2_CMDMSK_R: CTRL Position      */
#define C_CANn_IF2_CMDMSK_R_CTRL_Msk          (0x01UL << C_CANn_IF2_CMDMSK_R_CTRL_Pos)                /*!< C_CANn IF2_CMDMSK_R: CTRL Mask          */
#define C_CANn_IF2_CMDMSK_R_ARB_Pos           5                                                       /*!< C_CANn IF2_CMDMSK_R: ARB Position       */
#define C_CANn_IF2_CMDMSK_R_ARB_Msk           (0x01UL << C_CANn_IF2_CMDMSK_R_ARB_Pos)                 /*!< C_CANn IF2_CMDMSK_R: ARB Mask           */
#define C_CANn_IF2_CMDMSK_R_MASK_Pos          6                                                       /*!< C_CANn IF2_CMDMSK_R: MASK Position      */
#define C_CANn_IF2_CMDMSK_R_MASK_Msk          (0x01UL << C_CANn_IF2_CMDMSK_R_MASK_Pos)                /*!< C_CANn IF2_CMDMSK_R: MASK Mask          */
#define C_CANn_IF2_CMDMSK_R_WR_RD_Pos         7                                                       /*!< C_CANn IF2_CMDMSK_R: WR_RD Position     */
#define C_CANn_IF2_CMDMSK_R_WR_RD_Msk         (0x01UL << C_CANn_IF2_CMDMSK_R_WR_RD_Pos)               /*!< C_CANn IF2_CMDMSK_R: WR_RD Mask         */

/* -------------------------------  C_CANn_IF2_MSK1  ------------------------------ */
#define C_CANn_IF2_MSK1_MSK15_0_Pos           0                                                       /*!< C_CANn IF2_MSK1: MSK15_0 Position       */
#define C_CANn_IF2_MSK1_MSK15_0_Msk           (0x0000ffffUL << C_CANn_IF2_MSK1_MSK15_0_Pos)           /*!< C_CANn IF2_MSK1: MSK15_0 Mask           */

/* -------------------------------  C_CANn_IF2_MSK2  ------------------------------ */
#define C_CANn_IF2_MSK2_MSK28_16_Pos          0                                                       /*!< C_CANn IF2_MSK2: MSK28_16 Position      */
#define C_CANn_IF2_MSK2_MSK28_16_Msk          (0x00001fffUL << C_CANn_IF2_MSK2_MSK28_16_Pos)          /*!< C_CANn IF2_MSK2: MSK28_16 Mask          */
#define C_CANn_IF2_MSK2_MDIR_Pos              14                                                      /*!< C_CANn IF2_MSK2: MDIR Position          */
#define C_CANn_IF2_MSK2_MDIR_Msk              (0x01UL << C_CANn_IF2_MSK2_MDIR_Pos)                    /*!< C_CANn IF2_MSK2: MDIR Mask              */
#define C_CANn_IF2_MSK2_MXTD_Pos              15                                                      /*!< C_CANn IF2_MSK2: MXTD Position          */
#define C_CANn_IF2_MSK2_MXTD_Msk              (0x01UL << C_CANn_IF2_MSK2_MXTD_Pos)                    /*!< C_CANn IF2_MSK2: MXTD Mask              */

