MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -------------------------------  C_CANn_IF2_ARB1  ------------------------------ */
#define C_CANn_IF2_ARB1_ID15_0_Pos            0                                                       /*!< C_CANn IF2_ARB1: ID15_0 Position        */
#define C_CANn_IF2_ARB1_ID15_0_Msk            (0x0000ffffUL << C_CANn_IF2_ARB1_ID15_0_Pos)            /*!< C_CANn IF2_ARB1: ID15_0 Mask            */

/* -------------------------------  C_CANn_IF2_ARB2  ------------------------------ */
#define C_CANn_IF2_ARB2_ID28_16_Pos           0                                                       /*!< C_CANn IF2_ARB2: ID28_16 Position       */
#define C_CANn_IF2_ARB2_ID28_16_Msk           (0x00001fffUL << C_CANn_IF2_ARB2_ID28_16_Pos)           /*!< C_CANn IF2_ARB2: ID28_16 Mask           */
#define C_CANn_IF2_ARB2_DIR_Pos               13                                                      /*!< C_CANn IF2_ARB2: DIR Position           */
#define C_CANn_IF2_ARB2_DIR_Msk               (0x01UL << C_CANn_IF2_ARB2_DIR_Pos)                     /*!< C_CANn IF2_ARB2: DIR Mask               */
#define C_CANn_IF2_ARB2_XTD_Pos               14                                                      /*!< C_CANn IF2_ARB2: XTD Position           */
#define C_CANn_IF2_ARB2_XTD_Msk               (0x01UL << C_CANn_IF2_ARB2_XTD_Pos)                     /*!< C_CANn IF2_ARB2: XTD Mask               */
#define C_CANn_IF2_ARB2_MSGVAL_Pos            15                                                      /*!< C_CANn IF2_ARB2: MSGVAL Position        */
#define C_CANn_IF2_ARB2_MSGVAL_Msk            (0x01UL << C_CANn_IF2_ARB2_MSGVAL_Pos)                  /*!< C_CANn IF2_ARB2: MSGVAL Mask            */

/* ------------------------------  C_CANn_IF2_MCTRL  ------------------------------ */
#define C_CANn_IF2_MCTRL_DLC3_0_Pos           0                                                       /*!< C_CANn IF2_MCTRL: DLC3_0 Position       */
#define C_CANn_IF2_MCTRL_DLC3_0_Msk           (0x0fUL << C_CANn_IF2_MCTRL_DLC3_0_Pos)                 /*!< C_CANn IF2_MCTRL: DLC3_0 Mask           */
#define C_CANn_IF2_MCTRL_EOB_Pos              7                                                       /*!< C_CANn IF2_MCTRL: EOB Position          */
#define C_CANn_IF2_MCTRL_EOB_Msk              (0x01UL << C_CANn_IF2_MCTRL_EOB_Pos)                    /*!< C_CANn IF2_MCTRL: EOB Mask              */
#define C_CANn_IF2_MCTRL_TXRQST_Pos           8                                                       /*!< C_CANn IF2_MCTRL: TXRQST Position       */
#define C_CANn_IF2_MCTRL_TXRQST_Msk           (0x01UL << C_CANn_IF2_MCTRL_TXRQST_Pos)                 /*!< C_CANn IF2_MCTRL: TXRQST Mask           */
#define C_CANn_IF2_MCTRL_RMTEN_Pos            9                                                       /*!< C_CANn IF2_MCTRL: RMTEN Position        */
#define C_CANn_IF2_MCTRL_RMTEN_Msk            (0x01UL << C_CANn_IF2_MCTRL_RMTEN_Pos)                  /*!< C_CANn IF2_MCTRL: RMTEN Mask            */
#define C_CANn_IF2_MCTRL_RXIE_Pos             10                                                      /*!< C_CANn IF2_MCTRL: RXIE Position         */
#define C_CANn_IF2_MCTRL_RXIE_Msk             (0x01UL << C_CANn_IF2_MCTRL_RXIE_Pos)                   /*!< C_CANn IF2_MCTRL: RXIE Mask             */
#define C_CANn_IF2_MCTRL_TXIE_Pos             11                                                      /*!< C_CANn IF2_MCTRL: TXIE Position         */
#define C_CANn_IF2_MCTRL_TXIE_Msk             (0x01UL << C_CANn_IF2_MCTRL_TXIE_Pos)                   /*!< C_CANn IF2_MCTRL: TXIE Mask             */
#define C_CANn_IF2_MCTRL_UMASK_Pos            12                                                      /*!< C_CANn IF2_MCTRL: UMASK Position        */
#define C_CANn_IF2_MCTRL_UMASK_Msk            (0x01UL << C_CANn_IF2_MCTRL_UMASK_Pos)                  /*!< C_CANn IF2_MCTRL: UMASK Mask            */
#define C_CANn_IF2_MCTRL_INTPND_Pos           13                                                      /*!< C_CANn IF2_MCTRL: INTPND Position       */
#define C_CANn_IF2_MCTRL_INTPND_Msk           (0x01UL << C_CANn_IF2_MCTRL_INTPND_Pos)                 /*!< C_CANn IF2_MCTRL: INTPND Mask           */
#define C_CANn_IF2_MCTRL_MSGLST_Pos           14                                                      /*!< C_CANn IF2_MCTRL: MSGLST Position       */
#define C_CANn_IF2_MCTRL_MSGLST_Msk           (0x01UL << C_CANn_IF2_MCTRL_MSGLST_Pos)                 /*!< C_CANn IF2_MCTRL: MSGLST Mask           */
#define C_CANn_IF2_MCTRL_NEWDAT_Pos           15                                                      /*!< C_CANn IF2_MCTRL: NEWDAT Position       */
#define C_CANn_IF2_MCTRL_NEWDAT_Msk           (0x01UL << C_CANn_IF2_MCTRL_NEWDAT_Pos)                 /*!< C_CANn IF2_MCTRL: NEWDAT Mask           */

/* -------------------------------  C_CANn_IF2_DA1  ------------------------------- */
#define C_CANn_IF2_DA1_DATA0_Pos              0                                                       /*!< C_CANn IF2_DA1: DATA0 Position          */
#define C_CANn_IF2_DA1_DATA0_Msk              (0x000000ffUL << C_CANn_IF2_DA1_DATA0_Pos)              /*!< C_CANn IF2_DA1: DATA0 Mask              */
#define C_CANn_IF2_DA1_DATA1_Pos              8                                                       /*!< C_CANn IF2_DA1: DATA1 Position          */
#define C_CANn_IF2_DA1_DATA1_Msk              (0x000000ffUL << C_CANn_IF2_DA1_DATA1_Pos)              /*!< C_CANn IF2_DA1: DATA1 Mask              */

/* -------------------------------  C_CANn_IF2_DA2  ------------------------------- */
#define C_CANn_IF2_DA2_DATA2_Pos              0                                                       /*!< C_CANn IF2_DA2: DATA2 Position          */
#define C_CANn_IF2_DA2_DATA2_Msk              (0x000000ffUL << C_CANn_IF2_DA2_DATA2_Pos)              /*!< C_CANn IF2_DA2: DATA2 Mask              */
#define C_CANn_IF2_DA2_DATA3_Pos              8                                                       /*!< C_CANn IF2_DA2: DATA3 Position          */
#define C_CANn_IF2_DA2_DATA3_Msk              (0x000000ffUL << C_CANn_IF2_DA2_DATA3_Pos)              /*!< C_CANn IF2_DA2: DATA3 Mask              */

/* -------------------------------  C_CANn_IF2_DB1  ------------------------------- */
#define C_CANn_IF2_DB1_DATA4_Pos              0                                                       /*!< C_CANn IF2_DB1: DATA4 Position          */
#define C_CANn_IF2_DB1_DATA4_Msk              (0x000000ffUL << C_CANn_IF2_DB1_DATA4_Pos)              /*!< C_CANn IF2_DB1: DATA4 Mask              */
#define C_CANn_IF2_DB1_DATA5_Pos              8                                                       /*!< C_CANn IF2_DB1: DATA5 Position          */
#define C_CANn_IF2_DB1_DATA5_Msk              (0x000000ffUL << C_CANn_IF2_DB1_DATA5_Pos)              /*!< C_CANn IF2_DB1: DATA5 Mask              */

/* -------------------------------  C_CANn_IF2_DB2  ------------------------------- */
#define C_CANn_IF2_DB2_DATA6_Pos              0                                                       /*!< C_CANn IF2_DB2: DATA6 Position          */
#define C_CANn_IF2_DB2_DATA6_Msk              (0x000000ffUL << C_CANn_IF2_DB2_DATA6_Pos)              /*!< C_CANn IF2_DB2: DATA6 Mask              */
#define C_CANn_IF2_DB2_DATA7_Pos              8                                                       /*!< C_CANn IF2_DB2: DATA7 Position          */
#define C_CANn_IF2_DB2_DATA7_Msk              (0x000000ffUL << C_CANn_IF2_DB2_DATA7_Pos)              /*!< C_CANn IF2_DB2: DATA7 Mask              */

/* --------------------------------  C_CANn_TXREQ1  ------------------------------- */
#define C_CANn_TXREQ1_TXRQST16_1_Pos          0                                                       /*!< C_CANn TXREQ1: TXRQST16_1 Position      */
#define C_CANn_TXREQ1_TXRQST16_1_Msk          (0x0000ffffUL << C_CANn_TXREQ1_TXRQST16_1_Pos)          /*!< C_CANn TXREQ1: TXRQST16_1 Mask          */

/* --------------------------------  C_CANn_TXREQ2  ------------------------------- */
#define C_CANn_TXREQ2_TXRQST32_17_Pos         0                                                       /*!< C_CANn TXREQ2: TXRQST32_17 Position     */
#define C_CANn_TXREQ2_TXRQST32_17_Msk         (0x0000ffffUL << C_CANn_TXREQ2_TXRQST32_17_Pos)         /*!< C_CANn TXREQ2: TXRQST32_17 Mask         */

/* ---------------------------------  C_CANn_ND1  --------------------------------- */
#define C_CANn_ND1_NEWDAT16_1_Pos             0                                                       /*!< C_CANn ND1: NEWDAT16_1 Position         */
#define C_CANn_ND1_NEWDAT16_1_Msk             (0x0000ffffUL << C_CANn_ND1_NEWDAT16_1_Pos)             /*!< C_CANn ND1: NEWDAT16_1 Mask             */

/* ---------------------------------  C_CANn_ND2  --------------------------------- */
#define C_CANn_ND2_NEWDAT32_17_Pos            0                                                       /*!< C_CANn ND2: NEWDAT32_17 Position        */
#define C_CANn_ND2_NEWDAT32_17_Msk            (0x0000ffffUL << C_CANn_ND2_NEWDAT32_17_Pos)            /*!< C_CANn ND2: NEWDAT32_17 Mask            */

/* ---------------------------------  C_CANn_IR1  --------------------------------- */
#define C_CANn_IR1_INTPND16_1_Pos             0                                                       /*!< C_CANn IR1: INTPND16_1 Position         */
#define C_CANn_IR1_INTPND16_1_Msk             (0x0000ffffUL << C_CANn_IR1_INTPND16_1_Pos)             /*!< C_CANn IR1: INTPND16_1 Mask             */

