MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -----------------------------------  QEI_CLR  ---------------------------------- */
#define QEI_CLR_INX_Int_Pos                   0                                                       /*!< QEI CLR: INX_Int Position               */
#define QEI_CLR_INX_Int_Msk                   (0x01UL << QEI_CLR_INX_Int_Pos)                         /*!< QEI CLR: INX_Int Mask                   */
#define QEI_CLR_TIM_Int_Pos                   1                                                       /*!< QEI CLR: TIM_Int Position               */
#define QEI_CLR_TIM_Int_Msk                   (0x01UL << QEI_CLR_TIM_Int_Pos)                         /*!< QEI CLR: TIM_Int Mask                   */
#define QEI_CLR_VELC_Int_Pos                  2                                                       /*!< QEI CLR: VELC_Int Position              */
#define QEI_CLR_VELC_Int_Msk                  (0x01UL << QEI_CLR_VELC_Int_Pos)                        /*!< QEI CLR: VELC_Int Mask                  */
#define QEI_CLR_DIR_Int_Pos                   3                                                       /*!< QEI CLR: DIR_Int Position               */
#define QEI_CLR_DIR_Int_Msk                   (0x01UL << QEI_CLR_DIR_Int_Pos)                         /*!< QEI CLR: DIR_Int Mask                   */
#define QEI_CLR_ERR_Int_Pos                   4                                                       /*!< QEI CLR: ERR_Int Position               */
#define QEI_CLR_ERR_Int_Msk                   (0x01UL << QEI_CLR_ERR_Int_Pos)                         /*!< QEI CLR: ERR_Int Mask                   */
#define QEI_CLR_ENCLK_Int_Pos                 5                                                       /*!< QEI CLR: ENCLK_Int Position             */
#define QEI_CLR_ENCLK_Int_Msk                 (0x01UL << QEI_CLR_ENCLK_Int_Pos)                       /*!< QEI CLR: ENCLK_Int Mask                 */
#define QEI_CLR_POS0_Int_Pos                  6                                                       /*!< QEI CLR: POS0_Int Position              */
#define QEI_CLR_POS0_Int_Msk                  (0x01UL << QEI_CLR_POS0_Int_Pos)                        /*!< QEI CLR: POS0_Int Mask                  */
#define QEI_CLR_POS1_Int_Pos                  7                                                       /*!< QEI CLR: POS1_Int Position              */
#define QEI_CLR_POS1_Int_Msk                  (0x01UL << QEI_CLR_POS1_Int_Pos)                        /*!< QEI CLR: POS1_Int Mask                  */
#define QEI_CLR_POS2_Int_Pos                  8                                                       /*!< QEI CLR: POS2_Int Position              */
#define QEI_CLR_POS2_Int_Msk                  (0x01UL << QEI_CLR_POS2_Int_Pos)                        /*!< QEI CLR: POS2_Int Mask                  */
#define QEI_CLR_REV_Int_Pos                   9                                                       /*!< QEI CLR: REV_Int Position               */
#define QEI_CLR_REV_Int_Msk                   (0x01UL << QEI_CLR_REV_Int_Pos)                         /*!< QEI CLR: REV_Int Mask                   */
#define QEI_CLR_POS0REV_Int_Pos               10                                                      /*!< QEI CLR: POS0REV_Int Position           */
#define QEI_CLR_POS0REV_Int_Msk               (0x01UL << QEI_CLR_POS0REV_Int_Pos)                     /*!< QEI CLR: POS0REV_Int Mask               */
#define QEI_CLR_POS1REV_Int_Pos               11                                                      /*!< QEI CLR: POS1REV_Int Position           */
#define QEI_CLR_POS1REV_Int_Msk               (0x01UL << QEI_CLR_POS1REV_Int_Pos)                     /*!< QEI CLR: POS1REV_Int Mask               */
#define QEI_CLR_REV1_Int_Pos                  13                                                      /*!< QEI CLR: REV1_Int Position              */
#define QEI_CLR_REV1_Int_Msk                  (0x01UL << QEI_CLR_REV1_Int_Pos)                        /*!< QEI CLR: REV1_Int Mask                  */
#define QEI_CLR_REV2_Int_Pos                  14                                                      /*!< QEI CLR: REV2_Int Position              */
#define QEI_CLR_REV2_Int_Msk                  (0x01UL << QEI_CLR_REV2_Int_Pos)                        /*!< QEI CLR: REV2_Int Mask                  */
#define QEI_CLR_MAXPOS_Int_Pos                15                                                      /*!< QEI CLR: MAXPOS_Int Position            */
#define QEI_CLR_MAXPOS_Int_Msk                (0x01UL << QEI_CLR_MAXPOS_Int_Pos)                      /*!< QEI CLR: MAXPOS_Int Mask                */

/* -----------------------------------  QEI_SET  ---------------------------------- */
#define QEI_SET_INX_Int_Pos                   0                                                       /*!< QEI SET: INX_Int Position               */
#define QEI_SET_INX_Int_Msk                   (0x01UL << QEI_SET_INX_Int_Pos)                         /*!< QEI SET: INX_Int Mask                   */
#define QEI_SET_TIM_Int_Pos                   1                                                       /*!< QEI SET: TIM_Int Position               */
#define QEI_SET_TIM_Int_Msk                   (0x01UL << QEI_SET_TIM_Int_Pos)                         /*!< QEI SET: TIM_Int Mask                   */
#define QEI_SET_VELC_Int_Pos                  2                                                       /*!< QEI SET: VELC_Int Position              */
#define QEI_SET_VELC_Int_Msk                  (0x01UL << QEI_SET_VELC_Int_Pos)                        /*!< QEI SET: VELC_Int Mask                  */
#define QEI_SET_DIR_Int_Pos                   3                                                       /*!< QEI SET: DIR_Int Position               */
#define QEI_SET_DIR_Int_Msk                   (0x01UL << QEI_SET_DIR_Int_Pos)                         /*!< QEI SET: DIR_Int Mask                   */
#define QEI_SET_ERR_Int_Pos                   4                                                       /*!< QEI SET: ERR_Int Position               */
#define QEI_SET_ERR_Int_Msk                   (0x01UL << QEI_SET_ERR_Int_Pos)                         /*!< QEI SET: ERR_Int Mask                   */
#define QEI_SET_ENCLK_Int_Pos                 5                                                       /*!< QEI SET: ENCLK_Int Position             */
#define QEI_SET_ENCLK_Int_Msk                 (0x01UL << QEI_SET_ENCLK_Int_Pos)                       /*!< QEI SET: ENCLK_Int Mask                 */
#define QEI_SET_POS0_Int_Pos                  6                                                       /*!< QEI SET: POS0_Int Position              */
#define QEI_SET_POS0_Int_Msk                  (0x01UL << QEI_SET_POS0_Int_Pos)                        /*!< QEI SET: POS0_Int Mask                  */
#define QEI_SET_POS1_Int_Pos                  7                                                       /*!< QEI SET: POS1_Int Position              */
#define QEI_SET_POS1_Int_Msk                  (0x01UL << QEI_SET_POS1_Int_Pos)                        /*!< QEI SET: POS1_Int Mask                  */
#define QEI_SET_POS2_Int_Pos                  8                                                       /*!< QEI SET: POS2_Int Position              */
#define QEI_SET_POS2_Int_Msk                  (0x01UL << QEI_SET_POS2_Int_Pos)                        /*!< QEI SET: POS2_Int Mask                  */
#define QEI_SET_REV_Int_Pos                   9                                                       /*!< QEI SET: REV_Int Position               */
#define QEI_SET_REV_Int_Msk                   (0x01UL << QEI_SET_REV_Int_Pos)                         /*!< QEI SET: REV_Int Mask                   */
#define QEI_SET_POS0REV_Int_Pos               10                                                      /*!< QEI SET: POS0REV_Int Position           */
#define QEI_SET_POS0REV_Int_Msk               (0x01UL << QEI_SET_POS0REV_Int_Pos)                     /*!< QEI SET: POS0REV_Int Mask               */
#define QEI_SET_POS1REV_Int_Pos               11                                                      /*!< QEI SET: POS1REV_Int Position           */
#define QEI_SET_POS1REV_Int_Msk               (0x01UL << QEI_SET_POS1REV_Int_Pos)                     /*!< QEI SET: POS1REV_Int Mask               */
#define QEI_SET_POS2REV_Int_Pos               12                                                      /*!< QEI SET: POS2REV_Int Position           */
#define QEI_SET_POS2REV_Int_Msk               (0x01UL << QEI_SET_POS2REV_Int_Pos)                     /*!< QEI SET: POS2REV_Int Mask               */
#define QEI_SET_REV1_Int_Pos                  13                                                      /*!< QEI SET: REV1_Int Position              */
#define QEI_SET_REV1_Int_Msk                  (0x01UL << QEI_SET_REV1_Int_Pos)                        /*!< QEI SET: REV1_Int Mask                  */
#define QEI_SET_REV2_Int_Pos                  14                                                      /*!< QEI SET: REV2_Int Position              */
#define QEI_SET_REV2_Int_Msk                  (0x01UL << QEI_SET_REV2_Int_Pos)                        /*!< QEI SET: REV2_Int Mask                  */
#define QEI_SET_MAXPOS_Int_Pos                15                                                      /*!< QEI SET: MAXPOS_Int Position            */
#define QEI_SET_MAXPOS_Int_Msk                (0x01UL << QEI_SET_MAXPOS_Int_Pos)                      /*!< QEI SET: MAXPOS_Int Mask                */


/* ================================================================================ */
/* ================          struct 'GIMA' Position & Mask         ================ */
/* ================================================================================ */


