MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -------------------------------  GIMA_CAP0_0_IN  ------------------------------- */
#define GIMA_CAP0_0_IN_INV_Pos                0                                                       /*!< GIMA CAP0_0_IN: INV Position            */
#define GIMA_CAP0_0_IN_INV_Msk                (0x01UL << GIMA_CAP0_0_IN_INV_Pos)                      /*!< GIMA CAP0_0_IN: INV Mask                */
#define GIMA_CAP0_0_IN_EDGE_Pos               1                                                       /*!< GIMA CAP0_0_IN: EDGE Position           */
#define GIMA_CAP0_0_IN_EDGE_Msk               (0x01UL << GIMA_CAP0_0_IN_EDGE_Pos)                     /*!< GIMA CAP0_0_IN: EDGE Mask               */
#define GIMA_CAP0_0_IN_SYNCH_Pos              2                                                       /*!< GIMA CAP0_0_IN: SYNCH Position          */
#define GIMA_CAP0_0_IN_SYNCH_Msk              (0x01UL << GIMA_CAP0_0_IN_SYNCH_Pos)                    /*!< GIMA CAP0_0_IN: SYNCH Mask              */
#define GIMA_CAP0_0_IN_PULSE_Pos              3                                                       /*!< GIMA CAP0_0_IN: PULSE Position          */
#define GIMA_CAP0_0_IN_PULSE_Msk              (0x01UL << GIMA_CAP0_0_IN_PULSE_Pos)                    /*!< GIMA CAP0_0_IN: PULSE Mask              */
#define GIMA_CAP0_0_IN_SELECT_Pos             4                                                       /*!< GIMA CAP0_0_IN: SELECT Position         */
#define GIMA_CAP0_0_IN_SELECT_Msk             (0x0fUL << GIMA_CAP0_0_IN_SELECT_Pos)                   /*!< GIMA CAP0_0_IN: SELECT Mask             */

/* -------------------------------  GIMA_CAP0_1_IN  ------------------------------- */
#define GIMA_CAP0_1_IN_INV_Pos                0                                                       /*!< GIMA CAP0_1_IN: INV Position            */
#define GIMA_CAP0_1_IN_INV_Msk                (0x01UL << GIMA_CAP0_1_IN_INV_Pos)                      /*!< GIMA CAP0_1_IN: INV Mask                */
#define GIMA_CAP0_1_IN_EDGE_Pos               1                                                       /*!< GIMA CAP0_1_IN: EDGE Position           */
#define GIMA_CAP0_1_IN_EDGE_Msk               (0x01UL << GIMA_CAP0_1_IN_EDGE_Pos)                     /*!< GIMA CAP0_1_IN: EDGE Mask               */
#define GIMA_CAP0_1_IN_SYNCH_Pos              2                                                       /*!< GIMA CAP0_1_IN: SYNCH Position          */
#define GIMA_CAP0_1_IN_SYNCH_Msk              (0x01UL << GIMA_CAP0_1_IN_SYNCH_Pos)                    /*!< GIMA CAP0_1_IN: SYNCH Mask              */
#define GIMA_CAP0_1_IN_PULSE_Pos              3                                                       /*!< GIMA CAP0_1_IN: PULSE Position          */
#define GIMA_CAP0_1_IN_PULSE_Msk              (0x01UL << GIMA_CAP0_1_IN_PULSE_Pos)                    /*!< GIMA CAP0_1_IN: PULSE Mask              */
#define GIMA_CAP0_1_IN_SELECT_Pos             4                                                       /*!< GIMA CAP0_1_IN: SELECT Position         */
#define GIMA_CAP0_1_IN_SELECT_Msk             (0x0fUL << GIMA_CAP0_1_IN_SELECT_Pos)                   /*!< GIMA CAP0_1_IN: SELECT Mask             */

/* -------------------------------  GIMA_CAP0_2_IN  ------------------------------- */
#define GIMA_CAP0_2_IN_INV_Pos                0                                                       /*!< GIMA CAP0_2_IN: INV Position            */
#define GIMA_CAP0_2_IN_INV_Msk                (0x01UL << GIMA_CAP0_2_IN_INV_Pos)                      /*!< GIMA CAP0_2_IN: INV Mask                */
#define GIMA_CAP0_2_IN_EDGE_Pos               1                                                       /*!< GIMA CAP0_2_IN: EDGE Position           */
#define GIMA_CAP0_2_IN_EDGE_Msk               (0x01UL << GIMA_CAP0_2_IN_EDGE_Pos)                     /*!< GIMA CAP0_2_IN: EDGE Mask               */
#define GIMA_CAP0_2_IN_SYNCH_Pos              2                                                       /*!< GIMA CAP0_2_IN: SYNCH Position          */
#define GIMA_CAP0_2_IN_SYNCH_Msk              (0x01UL << GIMA_CAP0_2_IN_SYNCH_Pos)                    /*!< GIMA CAP0_2_IN: SYNCH Mask              */
#define GIMA_CAP0_2_IN_PULSE_Pos              3                                                       /*!< GIMA CAP0_2_IN: PULSE Position          */
#define GIMA_CAP0_2_IN_PULSE_Msk              (0x01UL << GIMA_CAP0_2_IN_PULSE_Pos)                    /*!< GIMA CAP0_2_IN: PULSE Mask              */
#define GIMA_CAP0_2_IN_SELECT_Pos             4                                                       /*!< GIMA CAP0_2_IN: SELECT Position         */
#define GIMA_CAP0_2_IN_SELECT_Msk             (0x0fUL << GIMA_CAP0_2_IN_SELECT_Pos)                   /*!< GIMA CAP0_2_IN: SELECT Mask             */

/* -------------------------------  GIMA_CAP0_3_IN  ------------------------------- */
#define GIMA_CAP0_3_IN_INV_Pos                0                                                       /*!< GIMA CAP0_3_IN: INV Position            */
#define GIMA_CAP0_3_IN_INV_Msk                (0x01UL << GIMA_CAP0_3_IN_INV_Pos)                      /*!< GIMA CAP0_3_IN: INV Mask                */
#define GIMA_CAP0_3_IN_EDGE_Pos               1                                                       /*!< GIMA CAP0_3_IN: EDGE Position           */
#define GIMA_CAP0_3_IN_EDGE_Msk               (0x01UL << GIMA_CAP0_3_IN_EDGE_Pos)                     /*!< GIMA CAP0_3_IN: EDGE Mask               */
#define GIMA_CAP0_3_IN_SYNCH_Pos              2                                                       /*!< GIMA CAP0_3_IN: SYNCH Position          */
#define GIMA_CAP0_3_IN_SYNCH_Msk              (0x01UL << GIMA_CAP0_3_IN_SYNCH_Pos)                    /*!< GIMA CAP0_3_IN: SYNCH Mask              */
#define GIMA_CAP0_3_IN_PULSE_Pos              3                                                       /*!< GIMA CAP0_3_IN: PULSE Position          */
#define GIMA_CAP0_3_IN_PULSE_Msk              (0x01UL << GIMA_CAP0_3_IN_PULSE_Pos)                    /*!< GIMA CAP0_3_IN: PULSE Mask              */
#define GIMA_CAP0_3_IN_SELECT_Pos             4                                                       /*!< GIMA CAP0_3_IN: SELECT Position         */
#define GIMA_CAP0_3_IN_SELECT_Msk             (0x0fUL << GIMA_CAP0_3_IN_SELECT_Pos)                   /*!< GIMA CAP0_3_IN: SELECT Mask             */

/* -------------------------------  GIMA_CAP1_0_IN  ------------------------------- */
#define GIMA_CAP1_0_IN_INV_Pos                0                                                       /*!< GIMA CAP1_0_IN: INV Position            */
#define GIMA_CAP1_0_IN_INV_Msk                (0x01UL << GIMA_CAP1_0_IN_INV_Pos)                      /*!< GIMA CAP1_0_IN: INV Mask                */
#define GIMA_CAP1_0_IN_EDGE_Pos               1                                                       /*!< GIMA CAP1_0_IN: EDGE Position           */
#define GIMA_CAP1_0_IN_EDGE_Msk               (0x01UL << GIMA_CAP1_0_IN_EDGE_Pos)                     /*!< GIMA CAP1_0_IN: EDGE Mask               */
#define GIMA_CAP1_0_IN_SYNCH_Pos              2                                                       /*!< GIMA CAP1_0_IN: SYNCH Position          */
#define GIMA_CAP1_0_IN_SYNCH_Msk              (0x01UL << GIMA_CAP1_0_IN_SYNCH_Pos)                    /*!< GIMA CAP1_0_IN: SYNCH Mask              */
#define GIMA_CAP1_0_IN_PULSE_Pos              3                                                       /*!< GIMA CAP1_0_IN: PULSE Position          */
#define GIMA_CAP1_0_IN_PULSE_Msk              (0x01UL << GIMA_CAP1_0_IN_PULSE_Pos)                    /*!< GIMA CAP1_0_IN: PULSE Mask              */
#define GIMA_CAP1_0_IN_SELECT_Pos             4                                                       /*!< GIMA CAP1_0_IN: SELECT Position         */
#define GIMA_CAP1_0_IN_SELECT_Msk             (0x0fUL << GIMA_CAP1_0_IN_SELECT_Pos)                   /*!< GIMA CAP1_0_IN: SELECT Mask             */

/* -------------------------------  GIMA_CAP1_1_IN  ------------------------------- */
#define GIMA_CAP1_1_IN_INV_Pos                0                                                       /*!< GIMA CAP1_1_IN: INV Position            */
#define GIMA_CAP1_1_IN_INV_Msk                (0x01UL << GIMA_CAP1_1_IN_INV_Pos)                      /*!< GIMA CAP1_1_IN: INV Mask                */
#define GIMA_CAP1_1_IN_EDGE_Pos               1                                                       /*!< GIMA CAP1_1_IN: EDGE Position           */
#define GIMA_CAP1_1_IN_EDGE_Msk               (0x01UL << GIMA_CAP1_1_IN_EDGE_Pos)                     /*!< GIMA CAP1_1_IN: EDGE Mask               */
#define GIMA_CAP1_1_IN_SYNCH_Pos              2                                                       /*!< GIMA CAP1_1_IN: SYNCH Position          */
#define GIMA_CAP1_1_IN_SYNCH_Msk              (0x01UL << GIMA_CAP1_1_IN_SYNCH_Pos)                    /*!< GIMA CAP1_1_IN: SYNCH Mask              */
#define GIMA_CAP1_1_IN_PULSE_Pos              3                                                       /*!< GIMA CAP1_1_IN: PULSE Position          */
#define GIMA_CAP1_1_IN_PULSE_Msk              (0x01UL << GIMA_CAP1_1_IN_PULSE_Pos)                    /*!< GIMA CAP1_1_IN: PULSE Mask              */
#define GIMA_CAP1_1_IN_SELECT_Pos             4                                                       /*!< GIMA CAP1_1_IN: SELECT Position         */
#define GIMA_CAP1_1_IN_SELECT_Msk             (0x0fUL << GIMA_CAP1_1_IN_SELECT_Pos)                   /*!< GIMA CAP1_1_IN: SELECT Mask             */

/* -------------------------------  GIMA_CAP1_2_IN  ------------------------------- */
#define GIMA_CAP1_2_IN_INV_Pos                0                                                       /*!< GIMA CAP1_2_IN: INV Position            */
#define GIMA_CAP1_2_IN_INV_Msk                (0x01UL << GIMA_CAP1_2_IN_INV_Pos)                      /*!< GIMA CAP1_2_IN: INV Mask                */
#define GIMA_CAP1_2_IN_EDGE_Pos               1                                                       /*!< GIMA CAP1_2_IN: EDGE Position           */
#define GIMA_CAP1_2_IN_EDGE_Msk               (0x01UL << GIMA_CAP1_2_IN_EDGE_Pos)                     /*!< GIMA CAP1_2_IN: EDGE Mask               */
#define GIMA_CAP1_2_IN_SYNCH_Pos              2                                                       /*!< GIMA CAP1_2_IN: SYNCH Position          */
#define GIMA_CAP1_2_IN_SYNCH_Msk              (0x01UL << GIMA_CAP1_2_IN_SYNCH_Pos)                    /*!< GIMA CAP1_2_IN: SYNCH Mask              */
#define GIMA_CAP1_2_IN_PULSE_Pos              3                                                       /*!< GIMA CAP1_2_IN: PULSE Position          */
#define GIMA_CAP1_2_IN_PULSE_Msk              (0x01UL << GIMA_CAP1_2_IN_PULSE_Pos)                    /*!< GIMA CAP1_2_IN: PULSE Mask              */
#define GIMA_CAP1_2_IN_SELECT_Pos             4                                                       /*!< GIMA CAP1_2_IN: SELECT Position         */
#define GIMA_CAP1_2_IN_SELECT_Msk             (0x0fUL << GIMA_CAP1_2_IN_SELECT_Pos)                   /*!< GIMA CAP1_2_IN: SELECT Mask             */

/* -------------------------------  GIMA_CAP1_3_IN  ------------------------------- */
#define GIMA_CAP1_3_IN_INV_Pos                0                                                       /*!< GIMA CAP1_3_IN: INV Position            */
#define GIMA_CAP1_3_IN_INV_Msk                (0x01UL << GIMA_CAP1_3_IN_INV_Pos)                      /*!< GIMA CAP1_3_IN: INV Mask                */
#define GIMA_CAP1_3_IN_EDGE_Pos               1                                                       /*!< GIMA CAP1_3_IN: EDGE Position           */
#define GIMA_CAP1_3_IN_EDGE_Msk               (0x01UL << GIMA_CAP1_3_IN_EDGE_Pos)                     /*!< GIMA CAP1_3_IN: EDGE Mask               */
#define GIMA_CAP1_3_IN_SYNCH_Pos              2                                                       /*!< GIMA CAP1_3_IN: SYNCH Position          */
#define GIMA_CAP1_3_IN_SYNCH_Msk              (0x01UL << GIMA_CAP1_3_IN_SYNCH_Pos)                    /*!< GIMA CAP1_3_IN: SYNCH Mask              */
#define GIMA_CAP1_3_IN_PULSE_Pos              3                                                       /*!< GIMA CAP1_3_IN: PULSE Position          */
#define GIMA_CAP1_3_IN_PULSE_Msk              (0x01UL << GIMA_CAP1_3_IN_PULSE_Pos)                    /*!< GIMA CAP1_3_IN: PULSE Mask              */
#define GIMA_CAP1_3_IN_SELECT_Pos             4                                                       /*!< GIMA CAP1_3_IN: SELECT Position         */
#define GIMA_CAP1_3_IN_SELECT_Msk             (0x0fUL << GIMA_CAP1_3_IN_SELECT_Pos)                   /*!< GIMA CAP1_3_IN: SELECT Mask             */

/* -------------------------------  GIMA_CAP2_0_IN  ------------------------------- */
#define GIMA_CAP2_0_IN_INV_Pos                0                                                       /*!< GIMA CAP2_0_IN: INV Position            */
#define GIMA_CAP2_0_IN_INV_Msk                (0x01UL << GIMA_CAP2_0_IN_INV_Pos)                      /*!< GIMA CAP2_0_IN: INV Mask                */
#define GIMA_CAP2_0_IN_EDGE_Pos               1                                                       /*!< GIMA CAP2_0_IN: EDGE Position           */
#define GIMA_CAP2_0_IN_EDGE_Msk               (0x01UL << GIMA_CAP2_0_IN_EDGE_Pos)                     /*!< GIMA CAP2_0_IN: EDGE Mask               */
#define GIMA_CAP2_0_IN_SYNCH_Pos              2                                                       /*!< GIMA CAP2_0_IN: SYNCH Position          */
#define GIMA_CAP2_0_IN_SYNCH_Msk              (0x01UL << GIMA_CAP2_0_IN_SYNCH_Pos)                    /*!< GIMA CAP2_0_IN: SYNCH Mask              */
#define GIMA_CAP2_0_IN_PULSE_Pos              3                                                       /*!< GIMA CAP2_0_IN: PULSE Position          */
#define GIMA_CAP2_0_IN_PULSE_Msk              (0x01UL << GIMA_CAP2_0_IN_PULSE_Pos)                    /*!< GIMA CAP2_0_IN: PULSE Mask              */
#define GIMA_CAP2_0_IN_SELECT_Pos             4                                                       /*!< GIMA CAP2_0_IN: SELECT Position         */
#define GIMA_CAP2_0_IN_SELECT_Msk             (0x0fUL << GIMA_CAP2_0_IN_SELECT_Pos)                   /*!< GIMA CAP2_0_IN: SELECT Mask             */

/* -------------------------------  GIMA_CAP2_1_IN  ------------------------------- */
#define GIMA_CAP2_1_IN_INV_Pos                0                                                       /*!< GIMA CAP2_1_IN: INV Position            */
#define GIMA_CAP2_1_IN_INV_Msk                (0x01UL << GIMA_CAP2_1_IN_INV_Pos)                      /*!< GIMA CAP2_1_IN: INV Mask                */
#define GIMA_CAP2_1_IN_EDGE_Pos               1                                                       /*!< GIMA CAP2_1_IN: EDGE Position           */
#define GIMA_CAP2_1_IN_EDGE_Msk               (0x01UL << GIMA_CAP2_1_IN_EDGE_Pos)                     /*!< GIMA CAP2_1_IN: EDGE Mask               */
#define GIMA_CAP2_1_IN_SYNCH_Pos              2                                                       /*!< GIMA CAP2_1_IN: SYNCH Position          */
#define GIMA_CAP2_1_IN_SYNCH_Msk              (0x01UL << GIMA_CAP2_1_IN_SYNCH_Pos)                    /*!< GIMA CAP2_1_IN: SYNCH Mask              */
#define GIMA_CAP2_1_IN_PULSE_Pos              3                                                       /*!< GIMA CAP2_1_IN: PULSE Position          */
#define GIMA_CAP2_1_IN_PULSE_Msk              (0x01UL << GIMA_CAP2_1_IN_PULSE_Pos)                    /*!< GIMA CAP2_1_IN: PULSE Mask              */
#define GIMA_CAP2_1_IN_SELECT_Pos             4                                                       /*!< GIMA CAP2_1_IN: SELECT Position         */
#define GIMA_CAP2_1_IN_SELECT_Msk             (0x0fUL << GIMA_CAP2_1_IN_SELECT_Pos)                   /*!< GIMA CAP2_1_IN: SELECT Mask             */

/* -------------------------------  GIMA_CAP2_2_IN  ------------------------------- */
#define GIMA_CAP2_2_IN_INV_Pos                0                                                       /*!< GIMA CAP2_2_IN: INV Position            */
#define GIMA_CAP2_2_IN_INV_Msk                (0x01UL << GIMA_CAP2_2_IN_INV_Pos)                      /*!< GIMA CAP2_2_IN: INV Mask                */
#define GIMA_CAP2_2_IN_EDGE_Pos               1                                                       /*!< GIMA CAP2_2_IN: EDGE Position           */
#define GIMA_CAP2_2_IN_EDGE_Msk               (0x01UL << GIMA_CAP2_2_IN_EDGE_Pos)                     /*!< GIMA CAP2_2_IN: EDGE Mask               */
#define GIMA_CAP2_2_IN_SYNCH_Pos              2                                                       /*!< GIMA CAP2_2_IN: SYNCH Position          */
#define GIMA_CAP2_2_IN_SYNCH_Msk              (0x01UL << GIMA_CAP2_2_IN_SYNCH_Pos)                    /*!< GIMA CAP2_2_IN: SYNCH Mask              */
#define GIMA_CAP2_2_IN_PULSE_Pos              3                                                       /*!< GIMA CAP2_2_IN: PULSE Position          */
#define GIMA_CAP2_2_IN_PULSE_Msk              (0x01UL << GIMA_CAP2_2_IN_PULSE_Pos)                    /*!< GIMA CAP2_2_IN: PULSE Mask              */
#define GIMA_CAP2_2_IN_SELECT_Pos             4                                                       /*!< GIMA CAP2_2_IN: SELECT Position         */
#define GIMA_CAP2_2_IN_SELECT_Msk             (0x0fUL << GIMA_CAP2_2_IN_SELECT_Pos)                   /*!< GIMA CAP2_2_IN: SELECT Mask             */

/* -------------------------------  GIMA_CAP2_3_IN  ------------------------------- */
#define GIMA_CAP2_3_IN_INV_Pos                0                                                       /*!< GIMA CAP2_3_IN: INV Position            */
#define GIMA_CAP2_3_IN_INV_Msk                (0x01UL << GIMA_CAP2_3_IN_INV_Pos)                      /*!< GIMA CAP2_3_IN: INV Mask                */
#define GIMA_CAP2_3_IN_EDGE_Pos               1                                                       /*!< GIMA CAP2_3_IN: EDGE Position           */
#define GIMA_CAP2_3_IN_EDGE_Msk               (0x01UL << GIMA_CAP2_3_IN_EDGE_Pos)                     /*!< GIMA CAP2_3_IN: EDGE Mask               */
#define GIMA_CAP2_3_IN_SYNCH_Pos              2                                                       /*!< GIMA CAP2_3_IN: SYNCH Position          */
#define GIMA_CAP2_3_IN_SYNCH_Msk              (0x01UL << GIMA_CAP2_3_IN_SYNCH_Pos)                    /*!< GIMA CAP2_3_IN: SYNCH Mask              */
#define GIMA_CAP2_3_IN_PULSE_Pos              3                                                       /*!< GIMA CAP2_3_IN: PULSE Position          */
#define GIMA_CAP2_3_IN_PULSE_Msk              (0x01UL << GIMA_CAP2_3_IN_PULSE_Pos)                    /*!< GIMA CAP2_3_IN: PULSE Mask              */
#define GIMA_CAP2_3_IN_SELECT_Pos             4                                                       /*!< GIMA CAP2_3_IN: SELECT Position         */
#define GIMA_CAP2_3_IN_SELECT_Msk             (0x0fUL << GIMA_CAP2_3_IN_SELECT_Pos)                   /*!< GIMA CAP2_3_IN: SELECT Mask             */

/* -------------------------------  GIMA_CAP3_0_IN  ------------------------------- */
#define GIMA_CAP3_0_IN_INV_Pos                0                                                       /*!< GIMA CAP3_0_IN: INV Position            */
#define GIMA_CAP3_0_IN_INV_Msk                (0x01UL << GIMA_CAP3_0_IN_INV_Pos)                      /*!< GIMA CAP3_0_IN: INV Mask                */
#define GIMA_CAP3_0_IN_EDGE_Pos               1                                                       /*!< GIMA CAP3_0_IN: EDGE Position           */
#define GIMA_CAP3_0_IN_EDGE_Msk               (0x01UL << GIMA_CAP3_0_IN_EDGE_Pos)                     /*!< GIMA CAP3_0_IN: EDGE Mask               */
#define GIMA_CAP3_0_IN_SYNCH_Pos              2                                                       /*!< GIMA CAP3_0_IN: SYNCH Position          */
#define GIMA_CAP3_0_IN_SYNCH_Msk              (0x01UL << GIMA_CAP3_0_IN_SYNCH_Pos)                    /*!< GIMA CAP3_0_IN: SYNCH Mask              */
#define GIMA_CAP3_0_IN_PULSE_Pos              3                                                       /*!< GIMA CAP3_0_IN: PULSE Position          */
#define GIMA_CAP3_0_IN_PULSE_Msk              (0x01UL << GIMA_CAP3_0_IN_PULSE_Pos)                    /*!< GIMA CAP3_0_IN: PULSE Mask              */
#define GIMA_CAP3_0_IN_SELECT_Pos             4                                                       /*!< GIMA CAP3_0_IN: SELECT Position         */
#define GIMA_CAP3_0_IN_SELECT_Msk             (0x0fUL << GIMA_CAP3_0_IN_SELECT_Pos)                   /*!< GIMA CAP3_0_IN: SELECT Mask             */

