MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -------------------------------  GIMA_CAP3_1_IN  ------------------------------- */
#define GIMA_CAP3_1_IN_INV_Pos                0                                                       /*!< GIMA CAP3_1_IN: INV Position            */
#define GIMA_CAP3_1_IN_INV_Msk                (0x01UL << GIMA_CAP3_1_IN_INV_Pos)                      /*!< GIMA CAP3_1_IN: INV Mask                */
#define GIMA_CAP3_1_IN_EDGE_Pos               1                                                       /*!< GIMA CAP3_1_IN: EDGE Position           */
#define GIMA_CAP3_1_IN_EDGE_Msk               (0x01UL << GIMA_CAP3_1_IN_EDGE_Pos)                     /*!< GIMA CAP3_1_IN: EDGE Mask               */
#define GIMA_CAP3_1_IN_SYNCH_Pos              2                                                       /*!< GIMA CAP3_1_IN: SYNCH Position          */
#define GIMA_CAP3_1_IN_SYNCH_Msk              (0x01UL << GIMA_CAP3_1_IN_SYNCH_Pos)                    /*!< GIMA CAP3_1_IN: SYNCH Mask              */
#define GIMA_CAP3_1_IN_PULSE_Pos              3                                                       /*!< GIMA CAP3_1_IN: PULSE Position          */
#define GIMA_CAP3_1_IN_PULSE_Msk              (0x01UL << GIMA_CAP3_1_IN_PULSE_Pos)                    /*!< GIMA CAP3_1_IN: PULSE Mask              */
#define GIMA_CAP3_1_IN_SELECT_Pos             4                                                       /*!< GIMA CAP3_1_IN: SELECT Position         */
#define GIMA_CAP3_1_IN_SELECT_Msk             (0x0fUL << GIMA_CAP3_1_IN_SELECT_Pos)                   /*!< GIMA CAP3_1_IN: SELECT Mask             */

/* -------------------------------  GIMA_CAP3_2_IN  ------------------------------- */
#define GIMA_CAP3_2_IN_INV_Pos                0                                                       /*!< GIMA CAP3_2_IN: INV Position            */
#define GIMA_CAP3_2_IN_INV_Msk                (0x01UL << GIMA_CAP3_2_IN_INV_Pos)                      /*!< GIMA CAP3_2_IN: INV Mask                */
#define GIMA_CAP3_2_IN_EDGE_Pos               1                                                       /*!< GIMA CAP3_2_IN: EDGE Position           */
#define GIMA_CAP3_2_IN_EDGE_Msk               (0x01UL << GIMA_CAP3_2_IN_EDGE_Pos)                     /*!< GIMA CAP3_2_IN: EDGE Mask               */
#define GIMA_CAP3_2_IN_SYNCH_Pos              2                                                       /*!< GIMA CAP3_2_IN: SYNCH Position          */
#define GIMA_CAP3_2_IN_SYNCH_Msk              (0x01UL << GIMA_CAP3_2_IN_SYNCH_Pos)                    /*!< GIMA CAP3_2_IN: SYNCH Mask              */
#define GIMA_CAP3_2_IN_PULSE_Pos              3                                                       /*!< GIMA CAP3_2_IN: PULSE Position          */
#define GIMA_CAP3_2_IN_PULSE_Msk              (0x01UL << GIMA_CAP3_2_IN_PULSE_Pos)                    /*!< GIMA CAP3_2_IN: PULSE Mask              */
#define GIMA_CAP3_2_IN_SELECT_Pos             4                                                       /*!< GIMA CAP3_2_IN: SELECT Position         */
#define GIMA_CAP3_2_IN_SELECT_Msk             (0x0fUL << GIMA_CAP3_2_IN_SELECT_Pos)                   /*!< GIMA CAP3_2_IN: SELECT Mask             */

/* -------------------------------  GIMA_CAP3_3_IN  ------------------------------- */
#define GIMA_CAP3_3_IN_INV_Pos                0                                                       /*!< GIMA CAP3_3_IN: INV Position            */
#define GIMA_CAP3_3_IN_INV_Msk                (0x01UL << GIMA_CAP3_3_IN_INV_Pos)                      /*!< GIMA CAP3_3_IN: INV Mask                */
#define GIMA_CAP3_3_IN_EDGE_Pos               1                                                       /*!< GIMA CAP3_3_IN: EDGE Position           */
#define GIMA_CAP3_3_IN_EDGE_Msk               (0x01UL << GIMA_CAP3_3_IN_EDGE_Pos)                     /*!< GIMA CAP3_3_IN: EDGE Mask               */
#define GIMA_CAP3_3_IN_SYNCH_Pos              2                                                       /*!< GIMA CAP3_3_IN: SYNCH Position          */
#define GIMA_CAP3_3_IN_SYNCH_Msk              (0x01UL << GIMA_CAP3_3_IN_SYNCH_Pos)                    /*!< GIMA CAP3_3_IN: SYNCH Mask              */
#define GIMA_CAP3_3_IN_PULSE_Pos              3                                                       /*!< GIMA CAP3_3_IN: PULSE Position          */
#define GIMA_CAP3_3_IN_PULSE_Msk              (0x01UL << GIMA_CAP3_3_IN_PULSE_Pos)                    /*!< GIMA CAP3_3_IN: PULSE Mask              */
#define GIMA_CAP3_3_IN_SELECT_Pos             4                                                       /*!< GIMA CAP3_3_IN: SELECT Position         */
#define GIMA_CAP3_3_IN_SELECT_Msk             (0x0fUL << GIMA_CAP3_3_IN_SELECT_Pos)                   /*!< GIMA CAP3_3_IN: SELECT Mask             */

/* -------------------------------  GIMA_CTIN_0_IN  ------------------------------- */
#define GIMA_CTIN_0_IN_INV_Pos                0                                                       /*!< GIMA CTIN_0_IN: INV Position            */
#define GIMA_CTIN_0_IN_INV_Msk                (0x01UL << GIMA_CTIN_0_IN_INV_Pos)                      /*!< GIMA CTIN_0_IN: INV Mask                */
#define GIMA_CTIN_0_IN_EDGE_Pos               1                                                       /*!< GIMA CTIN_0_IN: EDGE Position           */
#define GIMA_CTIN_0_IN_EDGE_Msk               (0x01UL << GIMA_CTIN_0_IN_EDGE_Pos)                     /*!< GIMA CTIN_0_IN: EDGE Mask               */
#define GIMA_CTIN_0_IN_SYNCH_Pos              2                                                       /*!< GIMA CTIN_0_IN: SYNCH Position          */
#define GIMA_CTIN_0_IN_SYNCH_Msk              (0x01UL << GIMA_CTIN_0_IN_SYNCH_Pos)                    /*!< GIMA CTIN_0_IN: SYNCH Mask              */
#define GIMA_CTIN_0_IN_PULSE_Pos              3                                                       /*!< GIMA CTIN_0_IN: PULSE Position          */
#define GIMA_CTIN_0_IN_PULSE_Msk              (0x01UL << GIMA_CTIN_0_IN_PULSE_Pos)                    /*!< GIMA CTIN_0_IN: PULSE Mask              */
#define GIMA_CTIN_0_IN_SELECT_Pos             4                                                       /*!< GIMA CTIN_0_IN: SELECT Position         */
#define GIMA_CTIN_0_IN_SELECT_Msk             (0x0fUL << GIMA_CTIN_0_IN_SELECT_Pos)                   /*!< GIMA CTIN_0_IN: SELECT Mask             */

/* -------------------------------  GIMA_CTIN_1_IN  ------------------------------- */
#define GIMA_CTIN_1_IN_INV_Pos                0                                                       /*!< GIMA CTIN_1_IN: INV Position            */
#define GIMA_CTIN_1_IN_INV_Msk                (0x01UL << GIMA_CTIN_1_IN_INV_Pos)                      /*!< GIMA CTIN_1_IN: INV Mask                */
#define GIMA_CTIN_1_IN_EDGE_Pos               1                                                       /*!< GIMA CTIN_1_IN: EDGE Position           */
#define GIMA_CTIN_1_IN_EDGE_Msk               (0x01UL << GIMA_CTIN_1_IN_EDGE_Pos)                     /*!< GIMA CTIN_1_IN: EDGE Mask               */
#define GIMA_CTIN_1_IN_SYNCH_Pos              2                                                       /*!< GIMA CTIN_1_IN: SYNCH Position          */
#define GIMA_CTIN_1_IN_SYNCH_Msk              (0x01UL << GIMA_CTIN_1_IN_SYNCH_Pos)                    /*!< GIMA CTIN_1_IN: SYNCH Mask              */
#define GIMA_CTIN_1_IN_PULSE_Pos              3                                                       /*!< GIMA CTIN_1_IN: PULSE Position          */
#define GIMA_CTIN_1_IN_PULSE_Msk              (0x01UL << GIMA_CTIN_1_IN_PULSE_Pos)                    /*!< GIMA CTIN_1_IN: PULSE Mask              */
#define GIMA_CTIN_1_IN_SELECT_Pos             4                                                       /*!< GIMA CTIN_1_IN: SELECT Position         */
#define GIMA_CTIN_1_IN_SELECT_Msk             (0x0fUL << GIMA_CTIN_1_IN_SELECT_Pos)                   /*!< GIMA CTIN_1_IN: SELECT Mask             */

/* -------------------------------  GIMA_CTIN_2_IN  ------------------------------- */
#define GIMA_CTIN_2_IN_INV_Pos                0                                                       /*!< GIMA CTIN_2_IN: INV Position            */
#define GIMA_CTIN_2_IN_INV_Msk                (0x01UL << GIMA_CTIN_2_IN_INV_Pos)                      /*!< GIMA CTIN_2_IN: INV Mask                */
#define GIMA_CTIN_2_IN_EDGE_Pos               1                                                       /*!< GIMA CTIN_2_IN: EDGE Position           */
#define GIMA_CTIN_2_IN_EDGE_Msk               (0x01UL << GIMA_CTIN_2_IN_EDGE_Pos)                     /*!< GIMA CTIN_2_IN: EDGE Mask               */
#define GIMA_CTIN_2_IN_SYNCH_Pos              2                                                       /*!< GIMA CTIN_2_IN: SYNCH Position          */
#define GIMA_CTIN_2_IN_SYNCH_Msk              (0x01UL << GIMA_CTIN_2_IN_SYNCH_Pos)                    /*!< GIMA CTIN_2_IN: SYNCH Mask              */
#define GIMA_CTIN_2_IN_PULSE_Pos              3                                                       /*!< GIMA CTIN_2_IN: PULSE Position          */
#define GIMA_CTIN_2_IN_PULSE_Msk              (0x01UL << GIMA_CTIN_2_IN_PULSE_Pos)                    /*!< GIMA CTIN_2_IN: PULSE Mask              */
#define GIMA_CTIN_2_IN_SELECT_Pos             4                                                       /*!< GIMA CTIN_2_IN: SELECT Position         */
#define GIMA_CTIN_2_IN_SELECT_Msk             (0x0fUL << GIMA_CTIN_2_IN_SELECT_Pos)                   /*!< GIMA CTIN_2_IN: SELECT Mask             */

