MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -------------------------------  C_CAN0_IF1_MSK1  ------------------------------ */
#define C_CAN0_IF1_MSK1_MSK15_0_Pos           0                                                       /*!< C_CAN0 IF1_MSK1: MSK15_0 Position       */
#define C_CAN0_IF1_MSK1_MSK15_0_Msk           (0x0000ffffUL << C_CAN0_IF1_MSK1_MSK15_0_Pos)           /*!< C_CAN0 IF1_MSK1: MSK15_0 Mask           */

/* -------------------------------  C_CAN0_IF1_MSK2  ------------------------------ */
#define C_CAN0_IF1_MSK2_MSK28_16_Pos          0                                                       /*!< C_CAN0 IF1_MSK2: MSK28_16 Position      */
#define C_CAN0_IF1_MSK2_MSK28_16_Msk          (0x00001fffUL << C_CAN0_IF1_MSK2_MSK28_16_Pos)          /*!< C_CAN0 IF1_MSK2: MSK28_16 Mask          */
#define C_CAN0_IF1_MSK2_MDIR_Pos              14                                                      /*!< C_CAN0 IF1_MSK2: MDIR Position          */
#define C_CAN0_IF1_MSK2_MDIR_Msk              (0x01UL << C_CAN0_IF1_MSK2_MDIR_Pos)                    /*!< C_CAN0 IF1_MSK2: MDIR Mask              */
#define C_CAN0_IF1_MSK2_MXTD_Pos              15                                                      /*!< C_CAN0 IF1_MSK2: MXTD Position          */
#define C_CAN0_IF1_MSK2_MXTD_Msk              (0x01UL << C_CAN0_IF1_MSK2_MXTD_Pos)                    /*!< C_CAN0 IF1_MSK2: MXTD Mask              */

/* -------------------------------  C_CAN0_IF1_ARB1  ------------------------------ */
#define C_CAN0_IF1_ARB1_ID15_0_Pos            0                                                       /*!< C_CAN0 IF1_ARB1: ID15_0 Position        */
#define C_CAN0_IF1_ARB1_ID15_0_Msk            (0x0000ffffUL << C_CAN0_IF1_ARB1_ID15_0_Pos)            /*!< C_CAN0 IF1_ARB1: ID15_0 Mask            */

/* -------------------------------  C_CAN0_IF1_ARB2  ------------------------------ */
#define C_CAN0_IF1_ARB2_ID28_16_Pos           0                                                       /*!< C_CAN0 IF1_ARB2: ID28_16 Position       */
#define C_CAN0_IF1_ARB2_ID28_16_Msk           (0x00001fffUL << C_CAN0_IF1_ARB2_ID28_16_Pos)           /*!< C_CAN0 IF1_ARB2: ID28_16 Mask           */
#define C_CAN0_IF1_ARB2_DIR_Pos               13                                                      /*!< C_CAN0 IF1_ARB2: DIR Position           */
#define C_CAN0_IF1_ARB2_DIR_Msk               (0x01UL << C_CAN0_IF1_ARB2_DIR_Pos)                     /*!< C_CAN0 IF1_ARB2: DIR Mask               */
#define C_CAN0_IF1_ARB2_XTD_Pos               14                                                      /*!< C_CAN0 IF1_ARB2: XTD Position           */
#define C_CAN0_IF1_ARB2_XTD_Msk               (0x01UL << C_CAN0_IF1_ARB2_XTD_Pos)                     /*!< C_CAN0 IF1_ARB2: XTD Mask               */
#define C_CAN0_IF1_ARB2_MSGVAL_Pos            15                                                      /*!< C_CAN0 IF1_ARB2: MSGVAL Position        */
#define C_CAN0_IF1_ARB2_MSGVAL_Msk            (0x01UL << C_CAN0_IF1_ARB2_MSGVAL_Pos)                  /*!< C_CAN0 IF1_ARB2: MSGVAL Mask            */

/* ------------------------------  C_CAN0_IF1_MCTRL  ------------------------------ */
#define C_CAN0_IF1_MCTRL_DLC3_0_Pos           0                                                       /*!< C_CAN0 IF1_MCTRL: DLC3_0 Position       */
#define C_CAN0_IF1_MCTRL_DLC3_0_Msk           (0x0fUL << C_CAN0_IF1_MCTRL_DLC3_0_Pos)                 /*!< C_CAN0 IF1_MCTRL: DLC3_0 Mask           */
#define C_CAN0_IF1_MCTRL_EOB_Pos              7                                                       /*!< C_CAN0 IF1_MCTRL: EOB Position          */
#define C_CAN0_IF1_MCTRL_EOB_Msk              (0x01UL << C_CAN0_IF1_MCTRL_EOB_Pos)                    /*!< C_CAN0 IF1_MCTRL: EOB Mask              */
#define C_CAN0_IF1_MCTRL_TXRQST_Pos           8                                                       /*!< C_CAN0 IF1_MCTRL: TXRQST Position       */
#define C_CAN0_IF1_MCTRL_TXRQST_Msk           (0x01UL << C_CAN0_IF1_MCTRL_TXRQST_Pos)                 /*!< C_CAN0 IF1_MCTRL: TXRQST Mask           */
#define C_CAN0_IF1_MCTRL_RMTEN_Pos            9                                                       /*!< C_CAN0 IF1_MCTRL: RMTEN Position        */
#define C_CAN0_IF1_MCTRL_RMTEN_Msk            (0x01UL << C_CAN0_IF1_MCTRL_RMTEN_Pos)                  /*!< C_CAN0 IF1_MCTRL: RMTEN Mask            */
#define C_CAN0_IF1_MCTRL_RXIE_Pos             10                                                      /*!< C_CAN0 IF1_MCTRL: RXIE Position         */
#define C_CAN0_IF1_MCTRL_RXIE_Msk             (0x01UL << C_CAN0_IF1_MCTRL_RXIE_Pos)                   /*!< C_CAN0 IF1_MCTRL: RXIE Mask             */
#define C_CAN0_IF1_MCTRL_TXIE_Pos             11                                                      /*!< C_CAN0 IF1_MCTRL: TXIE Position         */
#define C_CAN0_IF1_MCTRL_TXIE_Msk             (0x01UL << C_CAN0_IF1_MCTRL_TXIE_Pos)                   /*!< C_CAN0 IF1_MCTRL: TXIE Mask             */
#define C_CAN0_IF1_MCTRL_UMASK_Pos            12                                                      /*!< C_CAN0 IF1_MCTRL: UMASK Position        */
#define C_CAN0_IF1_MCTRL_UMASK_Msk            (0x01UL << C_CAN0_IF1_MCTRL_UMASK_Pos)                  /*!< C_CAN0 IF1_MCTRL: UMASK Mask            */
#define C_CAN0_IF1_MCTRL_INTPND_Pos           13                                                      /*!< C_CAN0 IF1_MCTRL: INTPND Position       */
#define C_CAN0_IF1_MCTRL_INTPND_Msk           (0x01UL << C_CAN0_IF1_MCTRL_INTPND_Pos)                 /*!< C_CAN0 IF1_MCTRL: INTPND Mask           */
#define C_CAN0_IF1_MCTRL_MSGLST_Pos           14                                                      /*!< C_CAN0 IF1_MCTRL: MSGLST Position       */
#define C_CAN0_IF1_MCTRL_MSGLST_Msk           (0x01UL << C_CAN0_IF1_MCTRL_MSGLST_Pos)                 /*!< C_CAN0 IF1_MCTRL: MSGLST Mask           */
#define C_CAN0_IF1_MCTRL_NEWDAT_Pos           15                                                      /*!< C_CAN0 IF1_MCTRL: NEWDAT Position       */
#define C_CAN0_IF1_MCTRL_NEWDAT_Msk           (0x01UL << C_CAN0_IF1_MCTRL_NEWDAT_Pos)                 /*!< C_CAN0 IF1_MCTRL: NEWDAT Mask           */

/* -------------------------------  C_CAN0_IF1_DA1  ------------------------------- */
#define C_CAN0_IF1_DA1_DATA0_Pos              0                                                       /*!< C_CAN0 IF1_DA1: DATA0 Position          */
#define C_CAN0_IF1_DA1_DATA0_Msk              (0x000000ffUL << C_CAN0_IF1_DA1_DATA0_Pos)              /*!< C_CAN0 IF1_DA1: DATA0 Mask              */
#define C_CAN0_IF1_DA1_DATA1_Pos              8                                                       /*!< C_CAN0 IF1_DA1: DATA1 Position          */
#define C_CAN0_IF1_DA1_DATA1_Msk              (0x000000ffUL << C_CAN0_IF1_DA1_DATA1_Pos)              /*!< C_CAN0 IF1_DA1: DATA1 Mask              */

/* -------------------------------  C_CAN0_IF1_DA2  ------------------------------- */
#define C_CAN0_IF1_DA2_DATA2_Pos              0                                                       /*!< C_CAN0 IF1_DA2: DATA2 Position          */
#define C_CAN0_IF1_DA2_DATA2_Msk              (0x000000ffUL << C_CAN0_IF1_DA2_DATA2_Pos)              /*!< C_CAN0 IF1_DA2: DATA2 Mask              */
#define C_CAN0_IF1_DA2_DATA3_Pos              8                                                       /*!< C_CAN0 IF1_DA2: DATA3 Position          */
#define C_CAN0_IF1_DA2_DATA3_Msk              (0x000000ffUL << C_CAN0_IF1_DA2_DATA3_Pos)              /*!< C_CAN0 IF1_DA2: DATA3 Mask              */

