MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  C_CAN0_ND1  --------------------------------- */
#define C_CAN0_ND1_NEWDAT16_1_Pos             0                                                       /*!< C_CAN0 ND1: NEWDAT16_1 Position         */
#define C_CAN0_ND1_NEWDAT16_1_Msk             (0x0000ffffUL << C_CAN0_ND1_NEWDAT16_1_Pos)             /*!< C_CAN0 ND1: NEWDAT16_1 Mask             */

/* ---------------------------------  C_CAN0_ND2  --------------------------------- */
#define C_CAN0_ND2_NEWDAT32_17_Pos            0                                                       /*!< C_CAN0 ND2: NEWDAT32_17 Position        */
#define C_CAN0_ND2_NEWDAT32_17_Msk            (0x0000ffffUL << C_CAN0_ND2_NEWDAT32_17_Pos)            /*!< C_CAN0 ND2: NEWDAT32_17 Mask            */

/* ---------------------------------  C_CAN0_IR1  --------------------------------- */
#define C_CAN0_IR1_INTPND16_1_Pos             0                                                       /*!< C_CAN0 IR1: INTPND16_1 Position         */
#define C_CAN0_IR1_INTPND16_1_Msk             (0x0000ffffUL << C_CAN0_IR1_INTPND16_1_Pos)             /*!< C_CAN0 IR1: INTPND16_1 Mask             */

/* ---------------------------------  C_CAN0_IR2  --------------------------------- */
#define C_CAN0_IR2_INTPND32_17_Pos            0                                                       /*!< C_CAN0 IR2: INTPND32_17 Position        */
#define C_CAN0_IR2_INTPND32_17_Msk            (0x0000ffffUL << C_CAN0_IR2_INTPND32_17_Pos)            /*!< C_CAN0 IR2: INTPND32_17 Mask            */

/* --------------------------------  C_CAN0_MSGV1  -------------------------------- */
#define C_CAN0_MSGV1_MSGVAL16_1_Pos           0                                                       /*!< C_CAN0 MSGV1: MSGVAL16_1 Position       */
#define C_CAN0_MSGV1_MSGVAL16_1_Msk           (0x0000ffffUL << C_CAN0_MSGV1_MSGVAL16_1_Pos)           /*!< C_CAN0 MSGV1: MSGVAL16_1 Mask           */

/* --------------------------------  C_CAN0_MSGV2  -------------------------------- */
#define C_CAN0_MSGV2_MSGVAL32_17_Pos          0                                                       /*!< C_CAN0 MSGV2: MSGVAL32_17 Position      */
#define C_CAN0_MSGV2_MSGVAL32_17_Msk          (0x0000ffffUL << C_CAN0_MSGV2_MSGVAL32_17_Pos)          /*!< C_CAN0 MSGV2: MSGVAL32_17 Mask          */

/* --------------------------------  C_CAN0_CLKDIV  ------------------------------- */
#define C_CAN0_CLKDIV_CLKDIVVAL_Pos           0                                                       /*!< C_CAN0 CLKDIV: CLKDIVVAL Position       */
#define C_CAN0_CLKDIV_CLKDIVVAL_Msk           (0x0fUL << C_CAN0_CLKDIV_CLKDIVVAL_Pos)                 /*!< C_CAN0 CLKDIV: CLKDIVVAL Mask           */


/* ================================================================================ */
/* ================          Group 'ADCn' Position & Mask          ================ */
/* ================================================================================ */


/* -----------------------------------  ADCn_CR  ---------------------------------- */
#define ADCn_CR_SEL_Pos                       0                                                       /*!< ADCn CR: SEL Position                   */
#define ADCn_CR_SEL_Msk                       (0x000000ffUL << ADCn_CR_SEL_Pos)                       /*!< ADCn CR: SEL Mask                       */
#define ADCn_CR_CLKDIV_Pos                    8                                                       /*!< ADCn CR: CLKDIV Position                */
#define ADCn_CR_CLKDIV_Msk                    (0x000000ffUL << ADCn_CR_CLKDIV_Pos)                    /*!< ADCn CR: CLKDIV Mask                    */
#define ADCn_CR_BURST_Pos                     16                                                      /*!< ADCn CR: BURST Position                 */
#define ADCn_CR_BURST_Msk                     (0x01UL << ADCn_CR_BURST_Pos)                           /*!< ADCn CR: BURST Mask                     */
#define ADCn_CR_CLKS_Pos                      17                                                      /*!< ADCn CR: CLKS Position                  */
#define ADCn_CR_CLKS_Msk                      (0x07UL << ADCn_CR_CLKS_Pos)                            /*!< ADCn CR: CLKS Mask                      */
#define ADCn_CR_PDN_Pos                       21                                                      /*!< ADCn CR: PDN Position                   */
#define ADCn_CR_PDN_Msk                       (0x01UL << ADCn_CR_PDN_Pos)                             /*!< ADCn CR: PDN Mask                       */
#define ADCn_CR_START_Pos                     24                                                      /*!< ADCn CR: START Position                 */
#define ADCn_CR_START_Msk                     (0x07UL << ADCn_CR_START_Pos)                           /*!< ADCn CR: START Mask                     */
#define ADCn_CR_EDGE_Pos                      27                                                      /*!< ADCn CR: EDGE Position                  */
#define ADCn_CR_EDGE_Msk                      (0x01UL << ADCn_CR_EDGE_Pos)                            /*!< ADCn CR: EDGE Mask                      */

/* ----------------------------------  ADCn_GDR  ---------------------------------- */
#define ADCn_GDR_V_VREF_Pos                   6                                                       /*!< ADCn GDR: V_VREF Position               */
#define ADCn_GDR_V_VREF_Msk                   (0x000003ffUL << ADCn_GDR_V_VREF_Pos)                   /*!< ADCn GDR: V_VREF Mask                   */
#define ADCn_GDR_CHN_Pos                      24                                                      /*!< ADCn GDR: CHN Position                  */
#define ADCn_GDR_CHN_Msk                      (0x07UL << ADCn_GDR_CHN_Pos)                            /*!< ADCn GDR: CHN Mask                      */
#define ADCn_GDR_OVERRUN_Pos                  30                                                      /*!< ADCn GDR: OVERRUN Position              */
#define ADCn_GDR_OVERRUN_Msk                  (0x01UL << ADCn_GDR_OVERRUN_Pos)                        /*!< ADCn GDR: OVERRUN Mask                  */
#define ADCn_GDR_DONE_Pos                     31                                                      /*!< ADCn GDR: DONE Position                 */
#define ADCn_GDR_DONE_Msk                     (0x01UL << ADCn_GDR_DONE_Pos)                           /*!< ADCn GDR: DONE Mask                     */

/* ---------------------------------  ADCn_INTEN  --------------------------------- */
#define ADCn_INTEN_ADINTEN_Pos                0                                                       /*!< ADCn INTEN: ADINTEN Position            */
#define ADCn_INTEN_ADINTEN_Msk                (0x000000ffUL << ADCn_INTEN_ADINTEN_Pos)                /*!< ADCn INTEN: ADINTEN Mask                */
#define ADCn_INTEN_ADGINTEN_Pos               8                                                       /*!< ADCn INTEN: ADGINTEN Position           */
#define ADCn_INTEN_ADGINTEN_Msk               (0x01UL << ADCn_INTEN_ADGINTEN_Pos)                     /*!< ADCn INTEN: ADGINTEN Mask               */

/* -----------------------------------  ADCn_DR  ---------------------------------- */
#define ADCn_DR_V_VREF_Pos                    6                                                       /*!< ADCn DR: V_VREF Position                */
#define ADCn_DR_V_VREF_Msk                    (0x000003ffUL << ADCn_DR_V_VREF_Pos)                    /*!< ADCn DR: V_VREF Mask                    */
#define ADCn_DR_OVERRUN_Pos                   30                                                      /*!< ADCn DR: OVERRUN Position               */
#define ADCn_DR_OVERRUN_Msk                   (0x01UL << ADCn_DR_OVERRUN_Pos)                         /*!< ADCn DR: OVERRUN Mask                   */
#define ADCn_DR_DONE_Pos                      31                                                      /*!< ADCn DR: DONE Position                  */
#define ADCn_DR_DONE_Msk                      (0x01UL << ADCn_DR_DONE_Pos)                            /*!< ADCn DR: DONE Mask                      */

/* ----------------------------------  ADCn_STAT  --------------------------------- */
#define ADCn_STAT_DONE_Pos                    0                                                       /*!< ADCn STAT: DONE Position                */
#define ADCn_STAT_DONE_Msk                    (0x000000ffUL << ADCn_STAT_DONE_Pos)                    /*!< ADCn STAT: DONE Mask                    */
#define ADCn_STAT_OVERUN_Pos                  8                                                       /*!< ADCn STAT: OVERUN Position              */
#define ADCn_STAT_OVERUN_Msk                  (0x000000ffUL << ADCn_STAT_OVERUN_Pos)                  /*!< ADCn STAT: OVERUN Mask                  */
#define ADCn_STAT_ADINT_Pos                   16                                                      /*!< ADCn STAT: ADINT Position               */
#define ADCn_STAT_ADINT_Msk                   (0x01UL << ADCn_STAT_ADINT_Pos)                         /*!< ADCn STAT: ADINT Mask                   */


/* ================================================================================ */
/* ================          struct 'ADC0' Position & Mask         ================ */
/* ================================================================================ */


/* -----------------------------------  ADC0_CR  ---------------------------------- */
#define ADC0_CR_SEL_Pos                       0                                                       /*!< ADC0 CR: SEL Position                   */
#define ADC0_CR_SEL_Msk                       (0x000000ffUL << ADC0_CR_SEL_Pos)                       /*!< ADC0 CR: SEL Mask                       */
#define ADC0_CR_CLKDIV_Pos                    8                                                       /*!< ADC0 CR: CLKDIV Position                */
#define ADC0_CR_CLKDIV_Msk                    (0x000000ffUL << ADC0_CR_CLKDIV_Pos)                    /*!< ADC0 CR: CLKDIV Mask                    */
#define ADC0_CR_BURST_Pos                     16                                                      /*!< ADC0 CR: BURST Position                 */
#define ADC0_CR_BURST_Msk                     (0x01UL << ADC0_CR_BURST_Pos)                           /*!< ADC0 CR: BURST Mask                     */
#define ADC0_CR_CLKS_Pos                      17                                                      /*!< ADC0 CR: CLKS Position                  */
#define ADC0_CR_CLKS_Msk                      (0x07UL << ADC0_CR_CLKS_Pos)                            /*!< ADC0 CR: CLKS Mask                      */
#define ADC0_CR_PDN_Pos                       21                                                      /*!< ADC0 CR: PDN Position                   */
#define ADC0_CR_PDN_Msk                       (0x01UL << ADC0_CR_PDN_Pos)                             /*!< ADC0 CR: PDN Mask                       */
#define ADC0_CR_START_Pos                     24                                                      /*!< ADC0 CR: START Position                 */
#define ADC0_CR_START_Msk                     (0x07UL << ADC0_CR_START_Pos)                           /*!< ADC0 CR: START Mask                     */
#define ADC0_CR_EDGE_Pos                      27                                                      /*!< ADC0 CR: EDGE Position                  */
#define ADC0_CR_EDGE_Msk                      (0x01UL << ADC0_CR_EDGE_Pos)                            /*!< ADC0 CR: EDGE Mask                      */

/* ----------------------------------  ADC0_GDR  ---------------------------------- */
#define ADC0_GDR_V_VREF_Pos                   6                                                       /*!< ADC0 GDR: V_VREF Position               */
#define ADC0_GDR_V_VREF_Msk                   (0x000003ffUL << ADC0_GDR_V_VREF_Pos)                   /*!< ADC0 GDR: V_VREF Mask                   */
#define ADC0_GDR_CHN_Pos                      24                                                      /*!< ADC0 GDR: CHN Position                  */
#define ADC0_GDR_CHN_Msk                      (0x07UL << ADC0_GDR_CHN_Pos)                            /*!< ADC0 GDR: CHN Mask                      */
#define ADC0_GDR_OVERRUN_Pos                  30                                                      /*!< ADC0 GDR: OVERRUN Position              */
#define ADC0_GDR_OVERRUN_Msk                  (0x01UL << ADC0_GDR_OVERRUN_Pos)                        /*!< ADC0 GDR: OVERRUN Mask                  */
#define ADC0_GDR_DONE_Pos                     31                                                      /*!< ADC0 GDR: DONE Position                 */
#define ADC0_GDR_DONE_Msk                     (0x01UL << ADC0_GDR_DONE_Pos)                           /*!< ADC0 GDR: DONE Mask                     */

