MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* ---------------------------------  ADCHS_THR_B  -------------------------------- */
#define ADCHS_THR_B_THR_LOW_B_Pos             0                                                       /*!< ADCHS THR_B: THR_LOW_B Position         */
#define ADCHS_THR_B_THR_LOW_B_Msk             (0x00000fffUL << ADCHS_THR_B_THR_LOW_B_Pos)             /*!< ADCHS THR_B: THR_LOW_B Mask             */
#define ADCHS_THR_B_THR_HIGH_B_Pos            16                                                      /*!< ADCHS THR_B: THR_HIGH_B Position        */
#define ADCHS_THR_B_THR_HIGH_B_Msk            (0x00000fffUL << ADCHS_THR_B_THR_HIGH_B_Pos)            /*!< ADCHS THR_B: THR_HIGH_B Mask            */

/* ------------------------------  ADCHS_LAST_SAMPLE  ----------------------------- */
#define ADCHS_LAST_SAMPLE_DONE_Pos            0                                                       /*!< ADCHS LAST_SAMPLE: DONE Position        */
#define ADCHS_LAST_SAMPLE_DONE_Msk            (0x01UL << ADCHS_LAST_SAMPLE_DONE_Pos)                  /*!< ADCHS LAST_SAMPLE: DONE Mask            */
#define ADCHS_LAST_SAMPLE_OVERRUN_Pos         1                                                       /*!< ADCHS LAST_SAMPLE: OVERRUN Position     */
#define ADCHS_LAST_SAMPLE_OVERRUN_Msk         (0x01UL << ADCHS_LAST_SAMPLE_OVERRUN_Pos)               /*!< ADCHS LAST_SAMPLE: OVERRUN Mask         */
#define ADCHS_LAST_SAMPLE_THCMP_RANGE_Pos     2                                                       /*!< ADCHS LAST_SAMPLE: THCMP_RANGE Position */
#define ADCHS_LAST_SAMPLE_THCMP_RANGE_Msk     (0x03UL << ADCHS_LAST_SAMPLE_THCMP_RANGE_Pos)           /*!< ADCHS LAST_SAMPLE: THCMP_RANGE Mask     */
#define ADCHS_LAST_SAMPLE_THCMP_CROSS_Pos     4                                                       /*!< ADCHS LAST_SAMPLE: THCMP_CROSS Position */
#define ADCHS_LAST_SAMPLE_THCMP_CROSS_Msk     (0x03UL << ADCHS_LAST_SAMPLE_THCMP_CROSS_Pos)           /*!< ADCHS LAST_SAMPLE: THCMP_CROSS Mask     */
#define ADCHS_LAST_SAMPLE_SAMPLE_Pos          6                                                       /*!< ADCHS LAST_SAMPLE: SAMPLE Position      */
#define ADCHS_LAST_SAMPLE_SAMPLE_Msk          (0x00000fffUL << ADCHS_LAST_SAMPLE_SAMPLE_Pos)          /*!< ADCHS LAST_SAMPLE: SAMPLE Mask          */

/* -------------------------------  ADCHS_ADC_SPEED  ------------------------------ */
#define ADCHS_ADC_SPEED_DGEC0_Pos             0                                                       /*!< ADCHS ADC_SPEED: DGEC0 Position         */
#define ADCHS_ADC_SPEED_DGEC0_Msk             (0x0fUL << ADCHS_ADC_SPEED_DGEC0_Pos)                   /*!< ADCHS ADC_SPEED: DGEC0 Mask             */
#define ADCHS_ADC_SPEED_DGEC1_Pos             4                                                       /*!< ADCHS ADC_SPEED: DGEC1 Position         */
#define ADCHS_ADC_SPEED_DGEC1_Msk             (0x0fUL << ADCHS_ADC_SPEED_DGEC1_Pos)                   /*!< ADCHS ADC_SPEED: DGEC1 Mask             */
#define ADCHS_ADC_SPEED_DGEC2_Pos             8                                                       /*!< ADCHS ADC_SPEED: DGEC2 Position         */
#define ADCHS_ADC_SPEED_DGEC2_Msk             (0x0fUL << ADCHS_ADC_SPEED_DGEC2_Pos)                   /*!< ADCHS ADC_SPEED: DGEC2 Mask             */
#define ADCHS_ADC_SPEED_DGEC3_Pos             12                                                      /*!< ADCHS ADC_SPEED: DGEC3 Position         */
#define ADCHS_ADC_SPEED_DGEC3_Msk             (0x0fUL << ADCHS_ADC_SPEED_DGEC3_Pos)                   /*!< ADCHS ADC_SPEED: DGEC3 Mask             */
#define ADCHS_ADC_SPEED_DGEC4_Pos             16                                                      /*!< ADCHS ADC_SPEED: DGEC4 Position         */
#define ADCHS_ADC_SPEED_DGEC4_Msk             (0x0fUL << ADCHS_ADC_SPEED_DGEC4_Pos)                   /*!< ADCHS ADC_SPEED: DGEC4 Mask             */
#define ADCHS_ADC_SPEED_DGEC5_Pos             20                                                      /*!< ADCHS ADC_SPEED: DGEC5 Position         */
#define ADCHS_ADC_SPEED_DGEC5_Msk             (0x0fUL << ADCHS_ADC_SPEED_DGEC5_Pos)                   /*!< ADCHS ADC_SPEED: DGEC5 Mask             */

/* -----------------------------  ADCHS_POWER_CONTROL  ---------------------------- */
#define ADCHS_POWER_CONTROL_CRS_Pos           0                                                       /*!< ADCHS POWER_CONTROL: CRS Position       */
#define ADCHS_POWER_CONTROL_CRS_Msk           (0x0fUL << ADCHS_POWER_CONTROL_CRS_Pos)                 /*!< ADCHS POWER_CONTROL: CRS Mask           */
#define ADCHS_POWER_CONTROL_DCINNEG_Pos       4                                                       /*!< ADCHS POWER_CONTROL: DCINNEG Position   */
#define ADCHS_POWER_CONTROL_DCINNEG_Msk       (0x3fUL << ADCHS_POWER_CONTROL_DCINNEG_Pos)             /*!< ADCHS POWER_CONTROL: DCINNEG Mask       */
#define ADCHS_POWER_CONTROL_DCINPOS_Pos       10                                                      /*!< ADCHS POWER_CONTROL: DCINPOS Position   */
#define ADCHS_POWER_CONTROL_DCINPOS_Msk       (0x3fUL << ADCHS_POWER_CONTROL_DCINPOS_Pos)             /*!< ADCHS POWER_CONTROL: DCINPOS Mask       */
#define ADCHS_POWER_CONTROL_TWOS_Pos          16                                                      /*!< ADCHS POWER_CONTROL: TWOS Position      */
#define ADCHS_POWER_CONTROL_TWOS_Msk          (0x01UL << ADCHS_POWER_CONTROL_TWOS_Pos)                /*!< ADCHS POWER_CONTROL: TWOS Mask          */
#define ADCHS_POWER_CONTROL_POWER_SWITCH_Pos  17                                                      /*!< ADCHS POWER_CONTROL: POWER_SWITCH Position */
#define ADCHS_POWER_CONTROL_POWER_SWITCH_Msk  (0x01UL << ADCHS_POWER_CONTROL_POWER_SWITCH_Pos)        /*!< ADCHS POWER_CONTROL: POWER_SWITCH Mask  */
#define ADCHS_POWER_CONTROL_BGAP_SWITCH_Pos   18                                                      /*!< ADCHS POWER_CONTROL: BGAP_SWITCH Position */
#define ADCHS_POWER_CONTROL_BGAP_SWITCH_Msk   (0x01UL << ADCHS_POWER_CONTROL_BGAP_SWITCH_Pos)         /*!< ADCHS POWER_CONTROL: BGAP_SWITCH Mask   */

/* ------------------------------  ADCHS_FIFO_OUTPUT  ----------------------------- */
#define ADCHS_FIFO_OUTPUT_SAMPLE_Pos          0                                                       /*!< ADCHS FIFO_OUTPUT: SAMPLE Position      */
#define ADCHS_FIFO_OUTPUT_SAMPLE_Msk          (0x00000fffUL << ADCHS_FIFO_OUTPUT_SAMPLE_Pos)          /*!< ADCHS FIFO_OUTPUT: SAMPLE Mask          */
#define ADCHS_FIFO_OUTPUT_CHAN_ID_Pos         12                                                      /*!< ADCHS FIFO_OUTPUT: CHAN_ID Position     */
#define ADCHS_FIFO_OUTPUT_CHAN_ID_Msk         (0x07UL << ADCHS_FIFO_OUTPUT_CHAN_ID_Pos)               /*!< ADCHS FIFO_OUTPUT: CHAN_ID Mask         */
#define ADCHS_FIFO_OUTPUT_EMPTY_Pos           15                                                      /*!< ADCHS FIFO_OUTPUT: EMPTY Position       */
#define ADCHS_FIFO_OUTPUT_EMPTY_Msk           (0x01UL << ADCHS_FIFO_OUTPUT_EMPTY_Pos)                 /*!< ADCHS FIFO_OUTPUT: EMPTY Mask           */
#define ADCHS_FIFO_OUTPUT_SAMPLE2_Pos         16                                                      /*!< ADCHS FIFO_OUTPUT: SAMPLE2 Position     */
#define ADCHS_FIFO_OUTPUT_SAMPLE2_Msk         (0x00000fffUL << ADCHS_FIFO_OUTPUT_SAMPLE2_Pos)         /*!< ADCHS FIFO_OUTPUT: SAMPLE2 Mask         */
#define ADCHS_FIFO_OUTPUT_CHAN_ID2_Pos        28                                                      /*!< ADCHS FIFO_OUTPUT: CHAN_ID2 Position    */
#define ADCHS_FIFO_OUTPUT_CHAN_ID2_Msk        (0x07UL << ADCHS_FIFO_OUTPUT_CHAN_ID2_Pos)              /*!< ADCHS FIFO_OUTPUT: CHAN_ID2 Mask        */
#define ADCHS_FIFO_OUTPUT_EMPTY2_Pos          31                                                      /*!< ADCHS FIFO_OUTPUT: EMPTY2 Position      */
#define ADCHS_FIFO_OUTPUT_EMPTY2_Msk          (0x01UL << ADCHS_FIFO_OUTPUT_EMPTY2_Pos)                /*!< ADCHS FIFO_OUTPUT: EMPTY2 Mask          */

/* -----------------------------  ADCHS_DESCRIPTOR0_  ----------------------------- */
#define ADCHS_DESCRIPTOR0__CHANNEL_NR_Pos     0                                                       /*!< ADCHS DESCRIPTOR0_: CHANNEL_NR Position */
#define ADCHS_DESCRIPTOR0__CHANNEL_NR_Msk     (0x07UL << ADCHS_DESCRIPTOR0__CHANNEL_NR_Pos)           /*!< ADCHS DESCRIPTOR0_: CHANNEL_NR Mask     */
#define ADCHS_DESCRIPTOR0__HALT_Pos           3                                                       /*!< ADCHS DESCRIPTOR0_: HALT Position       */
#define ADCHS_DESCRIPTOR0__HALT_Msk           (0x01UL << ADCHS_DESCRIPTOR0__HALT_Pos)                 /*!< ADCHS DESCRIPTOR0_: HALT Mask           */
#define ADCHS_DESCRIPTOR0__INTERRUPT_Pos      4                                                       /*!< ADCHS DESCRIPTOR0_: INTERRUPT Position  */
#define ADCHS_DESCRIPTOR0__INTERRUPT_Msk      (0x01UL << ADCHS_DESCRIPTOR0__INTERRUPT_Pos)            /*!< ADCHS DESCRIPTOR0_: INTERRUPT Mask      */
#define ADCHS_DESCRIPTOR0__POWER_DOWN_Pos     5                                                       /*!< ADCHS DESCRIPTOR0_: POWER_DOWN Position */
#define ADCHS_DESCRIPTOR0__POWER_DOWN_Msk     (0x01UL << ADCHS_DESCRIPTOR0__POWER_DOWN_Pos)           /*!< ADCHS DESCRIPTOR0_: POWER_DOWN Mask     */
#define ADCHS_DESCRIPTOR0__BRANCH_Pos         6                                                       /*!< ADCHS DESCRIPTOR0_: BRANCH Position     */
#define ADCHS_DESCRIPTOR0__BRANCH_Msk         (0x03UL << ADCHS_DESCRIPTOR0__BRANCH_Pos)               /*!< ADCHS DESCRIPTOR0_: BRANCH Mask         */
#define ADCHS_DESCRIPTOR0__MATCH_VALUE_Pos    8                                                       /*!< ADCHS DESCRIPTOR0_: MATCH_VALUE Position */
#define ADCHS_DESCRIPTOR0__MATCH_VALUE_Msk    (0x00003fffUL << ADCHS_DESCRIPTOR0__MATCH_VALUE_Pos)    /*!< ADCHS DESCRIPTOR0_: MATCH_VALUE Mask    */
#define ADCHS_DESCRIPTOR0__THRESHOLD_SEL_Pos  22                                                      /*!< ADCHS DESCRIPTOR0_: THRESHOLD_SEL Position */
#define ADCHS_DESCRIPTOR0__THRESHOLD_SEL_Msk  (0x03UL << ADCHS_DESCRIPTOR0__THRESHOLD_SEL_Pos)        /*!< ADCHS DESCRIPTOR0_: THRESHOLD_SEL Mask  */
#define ADCHS_DESCRIPTOR0__RESET_TIMER_Pos    24                                                      /*!< ADCHS DESCRIPTOR0_: RESET_TIMER Position */
#define ADCHS_DESCRIPTOR0__RESET_TIMER_Msk    (0x01UL << ADCHS_DESCRIPTOR0__RESET_TIMER_Pos)          /*!< ADCHS DESCRIPTOR0_: RESET_TIMER Mask    */
#define ADCHS_DESCRIPTOR0__UPDATE_TABLE_Pos   31                                                      /*!< ADCHS DESCRIPTOR0_: UPDATE_TABLE Position */
#define ADCHS_DESCRIPTOR0__UPDATE_TABLE_Msk   (0x01UL << ADCHS_DESCRIPTOR0__UPDATE_TABLE_Pos)         /*!< ADCHS DESCRIPTOR0_: UPDATE_TABLE Mask   */

/* -----------------------------  ADCHS_DESCRIPTOR1_  ----------------------------- */
#define ADCHS_DESCRIPTOR1__CHANNEL_NR_Pos     0                                                       /*!< ADCHS DESCRIPTOR1_: CHANNEL_NR Position */
#define ADCHS_DESCRIPTOR1__CHANNEL_NR_Msk     (0x07UL << ADCHS_DESCRIPTOR1__CHANNEL_NR_Pos)           /*!< ADCHS DESCRIPTOR1_: CHANNEL_NR Mask     */
#define ADCHS_DESCRIPTOR1__HALT_Pos           3                                                       /*!< ADCHS DESCRIPTOR1_: HALT Position       */
#define ADCHS_DESCRIPTOR1__HALT_Msk           (0x01UL << ADCHS_DESCRIPTOR1__HALT_Pos)                 /*!< ADCHS DESCRIPTOR1_: HALT Mask           */
#define ADCHS_DESCRIPTOR1__INTERRUPT_Pos      4                                                       /*!< ADCHS DESCRIPTOR1_: INTERRUPT Position  */
#define ADCHS_DESCRIPTOR1__INTERRUPT_Msk      (0x01UL << ADCHS_DESCRIPTOR1__INTERRUPT_Pos)            /*!< ADCHS DESCRIPTOR1_: INTERRUPT Mask      */
#define ADCHS_DESCRIPTOR1__POWER_DOWN_Pos     5                                                       /*!< ADCHS DESCRIPTOR1_: POWER_DOWN Position */
#define ADCHS_DESCRIPTOR1__POWER_DOWN_Msk     (0x01UL << ADCHS_DESCRIPTOR1__POWER_DOWN_Pos)           /*!< ADCHS DESCRIPTOR1_: POWER_DOWN Mask     */
#define ADCHS_DESCRIPTOR1__BRANCH_Pos         6                                                       /*!< ADCHS DESCRIPTOR1_: BRANCH Position     */
#define ADCHS_DESCRIPTOR1__BRANCH_Msk         (0x03UL << ADCHS_DESCRIPTOR1__BRANCH_Pos)               /*!< ADCHS DESCRIPTOR1_: BRANCH Mask         */
#define ADCHS_DESCRIPTOR1__MATCH_VALUE_Pos    8                                                       /*!< ADCHS DESCRIPTOR1_: MATCH_VALUE Position */
#define ADCHS_DESCRIPTOR1__MATCH_VALUE_Msk    (0x00003fffUL << ADCHS_DESCRIPTOR1__MATCH_VALUE_Pos)    /*!< ADCHS DESCRIPTOR1_: MATCH_VALUE Mask    */
#define ADCHS_DESCRIPTOR1__THRESHOLD_SEL_Pos  22                                                      /*!< ADCHS DESCRIPTOR1_: THRESHOLD_SEL Position */
#define ADCHS_DESCRIPTOR1__THRESHOLD_SEL_Msk  (0x03UL << ADCHS_DESCRIPTOR1__THRESHOLD_SEL_Pos)        /*!< ADCHS DESCRIPTOR1_: THRESHOLD_SEL Mask  */
#define ADCHS_DESCRIPTOR1__RESET_TIMER_Pos    24                                                      /*!< ADCHS DESCRIPTOR1_: RESET_TIMER Position */
#define ADCHS_DESCRIPTOR1__RESET_TIMER_Msk    (0x01UL << ADCHS_DESCRIPTOR1__RESET_TIMER_Pos)          /*!< ADCHS DESCRIPTOR1_: RESET_TIMER Mask    */
#define ADCHS_DESCRIPTOR1__UPDATE_TABLE_Pos   31                                                      /*!< ADCHS DESCRIPTOR1_: UPDATE_TABLE Position */
#define ADCHS_DESCRIPTOR1__UPDATE_TABLE_Msk   (0x01UL << ADCHS_DESCRIPTOR1__UPDATE_TABLE_Pos)         /*!< ADCHS DESCRIPTOR1_: UPDATE_TABLE Mask   */

/* --------------------------------  ADCHS_CLR_EN0  ------------------------------- */
#define ADCHS_CLR_EN0_CEN0_Pos                0                                                       /*!< ADCHS CLR_EN0: CEN0 Position            */
#define ADCHS_CLR_EN0_CEN0_Msk                (0x7fUL << ADCHS_CLR_EN0_CEN0_Pos)                      /*!< ADCHS CLR_EN0: CEN0 Mask                */

