MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* --------------------------------  ADCHS_SET_EN0  ------------------------------- */
#define ADCHS_SET_EN0_SEN0_Pos                0                                                       /*!< ADCHS SET_EN0: SEN0 Position            */
#define ADCHS_SET_EN0_SEN0_Msk                (0x7fUL << ADCHS_SET_EN0_SEN0_Pos)                      /*!< ADCHS SET_EN0: SEN0 Mask                */

/* ---------------------------------  ADCHS_MASK0  -------------------------------- */
#define ADCHS_MASK0_M0_Pos                    0                                                       /*!< ADCHS MASK0: M0 Position                */
#define ADCHS_MASK0_M0_Msk                    (0x7fUL << ADCHS_MASK0_M0_Pos)                          /*!< ADCHS MASK0: M0 Mask                    */

/* --------------------------------  ADCHS_STATUS0  ------------------------------- */
#define ADCHS_STATUS0_FIFO_FULL_Pos           0                                                       /*!< ADCHS STATUS0: FIFO_FULL Position       */
#define ADCHS_STATUS0_FIFO_FULL_Msk           (0x01UL << ADCHS_STATUS0_FIFO_FULL_Pos)                 /*!< ADCHS STATUS0: FIFO_FULL Mask           */
#define ADCHS_STATUS0_FIFO_EMPTY_Pos          1                                                       /*!< ADCHS STATUS0: FIFO_EMPTY Position      */
#define ADCHS_STATUS0_FIFO_EMPTY_Msk          (0x01UL << ADCHS_STATUS0_FIFO_EMPTY_Pos)                /*!< ADCHS STATUS0: FIFO_EMPTY Mask          */
#define ADCHS_STATUS0_FIFO_OVERFLOW_Pos       2                                                       /*!< ADCHS STATUS0: FIFO_OVERFLOW Position   */
#define ADCHS_STATUS0_FIFO_OVERFLOW_Msk       (0x01UL << ADCHS_STATUS0_FIFO_OVERFLOW_Pos)             /*!< ADCHS STATUS0: FIFO_OVERFLOW Mask       */
#define ADCHS_STATUS0_DSCR_DONE_Pos           3                                                       /*!< ADCHS STATUS0: DSCR_DONE Position       */
#define ADCHS_STATUS0_DSCR_DONE_Msk           (0x01UL << ADCHS_STATUS0_DSCR_DONE_Pos)                 /*!< ADCHS STATUS0: DSCR_DONE Mask           */
#define ADCHS_STATUS0_DSCR_ERROR_Pos          4                                                       /*!< ADCHS STATUS0: DSCR_ERROR Position      */
#define ADCHS_STATUS0_DSCR_ERROR_Msk          (0x01UL << ADCHS_STATUS0_DSCR_ERROR_Pos)                /*!< ADCHS STATUS0: DSCR_ERROR Mask          */
#define ADCHS_STATUS0_ADC_OVF_Pos             5                                                       /*!< ADCHS STATUS0: ADC_OVF Position         */
#define ADCHS_STATUS0_ADC_OVF_Msk             (0x01UL << ADCHS_STATUS0_ADC_OVF_Pos)                   /*!< ADCHS STATUS0: ADC_OVF Mask             */
#define ADCHS_STATUS0_ADC_UNF_Pos             6                                                       /*!< ADCHS STATUS0: ADC_UNF Position         */
#define ADCHS_STATUS0_ADC_UNF_Msk             (0x01UL << ADCHS_STATUS0_ADC_UNF_Pos)                   /*!< ADCHS STATUS0: ADC_UNF Mask             */

/* -------------------------------  ADCHS_CLR_STAT0  ------------------------------ */
#define ADCHS_CLR_STAT0_CSTAT0_Pos            0                                                       /*!< ADCHS CLR_STAT0: CSTAT0 Position        */
#define ADCHS_CLR_STAT0_CSTAT0_Msk            (0x7fUL << ADCHS_CLR_STAT0_CSTAT0_Pos)                  /*!< ADCHS CLR_STAT0: CSTAT0 Mask            */

/* -------------------------------  ADCHS_SET_STAT0  ------------------------------ */
#define ADCHS_SET_STAT0_SSTAT0_Pos            0                                                       /*!< ADCHS SET_STAT0: SSTAT0 Position        */
#define ADCHS_SET_STAT0_SSTAT0_Msk            (0x7fUL << ADCHS_SET_STAT0_SSTAT0_Pos)                  /*!< ADCHS SET_STAT0: SSTAT0 Mask            */

/* --------------------------------  ADCHS_CLR_EN1  ------------------------------- */
#define ADCHS_CLR_EN1_CEN1_Pos                0                                                       /*!< ADCHS CLR_EN1: CEN1 Position            */
#define ADCHS_CLR_EN1_CEN1_Msk                (0x3fffffffUL << ADCHS_CLR_EN1_CEN1_Pos)                /*!< ADCHS CLR_EN1: CEN1 Mask                */

/* --------------------------------  ADCHS_SET_EN1  ------------------------------- */
#define ADCHS_SET_EN1_SEN1_Pos                0                                                       /*!< ADCHS SET_EN1: SEN1 Position            */
#define ADCHS_SET_EN1_SEN1_Msk                (0x3fffffffUL << ADCHS_SET_EN1_SEN1_Pos)                /*!< ADCHS SET_EN1: SEN1 Mask                */

/* ---------------------------------  ADCHS_MASK1  -------------------------------- */
#define ADCHS_MASK1_M1_Pos                    0                                                       /*!< ADCHS MASK1: M1 Position                */
#define ADCHS_MASK1_M1_Msk                    (0x3fffffffUL << ADCHS_MASK1_M1_Pos)                    /*!< ADCHS MASK1: M1 Mask                    */

/* --------------------------------  ADCHS_STATUS1  ------------------------------- */
#define ADCHS_STATUS1_THCMP_BRANGE0_Pos       0                                                       /*!< ADCHS STATUS1: THCMP_BRANGE0 Position   */
#define ADCHS_STATUS1_THCMP_BRANGE0_Msk       (0x01UL << ADCHS_STATUS1_THCMP_BRANGE0_Pos)             /*!< ADCHS STATUS1: THCMP_BRANGE0 Mask       */
#define ADCHS_STATUS1_THCMP_ARANGE0_Pos       1                                                       /*!< ADCHS STATUS1: THCMP_ARANGE0 Position   */
#define ADCHS_STATUS1_THCMP_ARANGE0_Msk       (0x01UL << ADCHS_STATUS1_THCMP_ARANGE0_Pos)             /*!< ADCHS STATUS1: THCMP_ARANGE0 Mask       */
#define ADCHS_STATUS1_THCMP_DCROSS0_Pos       2                                                       /*!< ADCHS STATUS1: THCMP_DCROSS0 Position   */
#define ADCHS_STATUS1_THCMP_DCROSS0_Msk       (0x01UL << ADCHS_STATUS1_THCMP_DCROSS0_Pos)             /*!< ADCHS STATUS1: THCMP_DCROSS0 Mask       */
#define ADCHS_STATUS1_THCMP_UCROSS0_Pos       3                                                       /*!< ADCHS STATUS1: THCMP_UCROSS0 Position   */
#define ADCHS_STATUS1_THCMP_UCROSS0_Msk       (0x01UL << ADCHS_STATUS1_THCMP_UCROSS0_Pos)             /*!< ADCHS STATUS1: THCMP_UCROSS0 Mask       */
#define ADCHS_STATUS1_OVERRUN_0_Pos           4                                                       /*!< ADCHS STATUS1: OVERRUN_0 Position       */
#define ADCHS_STATUS1_OVERRUN_0_Msk           (0x01UL << ADCHS_STATUS1_OVERRUN_0_Pos)                 /*!< ADCHS STATUS1: OVERRUN_0 Mask           */
#define ADCHS_STATUS1_THCMP_BRANGE1_Pos       5                                                       /*!< ADCHS STATUS1: THCMP_BRANGE1 Position   */
#define ADCHS_STATUS1_THCMP_BRANGE1_Msk       (0x01UL << ADCHS_STATUS1_THCMP_BRANGE1_Pos)             /*!< ADCHS STATUS1: THCMP_BRANGE1 Mask       */
#define ADCHS_STATUS1_THCMP_ARANGE1_Pos       6                                                       /*!< ADCHS STATUS1: THCMP_ARANGE1 Position   */
#define ADCHS_STATUS1_THCMP_ARANGE1_Msk       (0x01UL << ADCHS_STATUS1_THCMP_ARANGE1_Pos)             /*!< ADCHS STATUS1: THCMP_ARANGE1 Mask       */
#define ADCHS_STATUS1_THCMP_DCROSS1_Pos       7                                                       /*!< ADCHS STATUS1: THCMP_DCROSS1 Position   */
#define ADCHS_STATUS1_THCMP_DCROSS1_Msk       (0x01UL << ADCHS_STATUS1_THCMP_DCROSS1_Pos)             /*!< ADCHS STATUS1: THCMP_DCROSS1 Mask       */
#define ADCHS_STATUS1_THCMP_UCROSS1_Pos       8                                                       /*!< ADCHS STATUS1: THCMP_UCROSS1 Position   */
#define ADCHS_STATUS1_THCMP_UCROSS1_Msk       (0x01UL << ADCHS_STATUS1_THCMP_UCROSS1_Pos)             /*!< ADCHS STATUS1: THCMP_UCROSS1 Mask       */
#define ADCHS_STATUS1_OVERRUN_1_Pos           9                                                       /*!< ADCHS STATUS1: OVERRUN_1 Position       */
#define ADCHS_STATUS1_OVERRUN_1_Msk           (0x01UL << ADCHS_STATUS1_OVERRUN_1_Pos)                 /*!< ADCHS STATUS1: OVERRUN_1 Mask           */
#define ADCHS_STATUS1_THCMP_BRANGE2_Pos       10                                                      /*!< ADCHS STATUS1: THCMP_BRANGE2 Position   */
#define ADCHS_STATUS1_THCMP_BRANGE2_Msk       (0x01UL << ADCHS_STATUS1_THCMP_BRANGE2_Pos)             /*!< ADCHS STATUS1: THCMP_BRANGE2 Mask       */
#define ADCHS_STATUS1_THCMP_ARANGE2_Pos       11                                                      /*!< ADCHS STATUS1: THCMP_ARANGE2 Position   */
#define ADCHS_STATUS1_THCMP_ARANGE2_Msk       (0x01UL << ADCHS_STATUS1_THCMP_ARANGE2_Pos)             /*!< ADCHS STATUS1: THCMP_ARANGE2 Mask       */
#define ADCHS_STATUS1_THCMP_DCROSS2_Pos       12                                                      /*!< ADCHS STATUS1: THCMP_DCROSS2 Position   */
#define ADCHS_STATUS1_THCMP_DCROSS2_Msk       (0x01UL << ADCHS_STATUS1_THCMP_DCROSS2_Pos)             /*!< ADCHS STATUS1: THCMP_DCROSS2 Mask       */
#define ADCHS_STATUS1_THCMP_UCROSS2_Pos       13                                                      /*!< ADCHS STATUS1: THCMP_UCROSS2 Position   */
#define ADCHS_STATUS1_THCMP_UCROSS2_Msk       (0x01UL << ADCHS_STATUS1_THCMP_UCROSS2_Pos)             /*!< ADCHS STATUS1: THCMP_UCROSS2 Mask       */
#define ADCHS_STATUS1_OVERRUN_2_Pos           14                                                      /*!< ADCHS STATUS1: OVERRUN_2 Position       */
#define ADCHS_STATUS1_OVERRUN_2_Msk           (0x01UL << ADCHS_STATUS1_OVERRUN_2_Pos)                 /*!< ADCHS STATUS1: OVERRUN_2 Mask           */
#define ADCHS_STATUS1_THCMP_BRANGE3_Pos       15                                                      /*!< ADCHS STATUS1: THCMP_BRANGE3 Position   */
#define ADCHS_STATUS1_THCMP_BRANGE3_Msk       (0x01UL << ADCHS_STATUS1_THCMP_BRANGE3_Pos)             /*!< ADCHS STATUS1: THCMP_BRANGE3 Mask       */
#define ADCHS_STATUS1_THCMP_ARANGE3_Pos       16                                                      /*!< ADCHS STATUS1: THCMP_ARANGE3 Position   */
#define ADCHS_STATUS1_THCMP_ARANGE3_Msk       (0x01UL << ADCHS_STATUS1_THCMP_ARANGE3_Pos)             /*!< ADCHS STATUS1: THCMP_ARANGE3 Mask       */
#define ADCHS_STATUS1_THCMP_DCROSS3_Pos       17                                                      /*!< ADCHS STATUS1: THCMP_DCROSS3 Position   */
#define ADCHS_STATUS1_THCMP_DCROSS3_Msk       (0x01UL << ADCHS_STATUS1_THCMP_DCROSS3_Pos)             /*!< ADCHS STATUS1: THCMP_DCROSS3 Mask       */
#define ADCHS_STATUS1_THCMP_UCROSS3_Pos       18                                                      /*!< ADCHS STATUS1: THCMP_UCROSS3 Position   */
#define ADCHS_STATUS1_THCMP_UCROSS3_Msk       (0x01UL << ADCHS_STATUS1_THCMP_UCROSS3_Pos)             /*!< ADCHS STATUS1: THCMP_UCROSS3 Mask       */
#define ADCHS_STATUS1_OVERRUN_3_Pos           19                                                      /*!< ADCHS STATUS1: OVERRUN_3 Position       */
#define ADCHS_STATUS1_OVERRUN_3_Msk           (0x01UL << ADCHS_STATUS1_OVERRUN_3_Pos)                 /*!< ADCHS STATUS1: OVERRUN_3 Mask           */
#define ADCHS_STATUS1_THCMP_BRANGE4_Pos       20                                                      /*!< ADCHS STATUS1: THCMP_BRANGE4 Position   */
#define ADCHS_STATUS1_THCMP_BRANGE4_Msk       (0x01UL << ADCHS_STATUS1_THCMP_BRANGE4_Pos)             /*!< ADCHS STATUS1: THCMP_BRANGE4 Mask       */
#define ADCHS_STATUS1_THCMP_ARANGE4_Pos       21                                                      /*!< ADCHS STATUS1: THCMP_ARANGE4 Position   */
#define ADCHS_STATUS1_THCMP_ARANGE4_Msk       (0x01UL << ADCHS_STATUS1_THCMP_ARANGE4_Pos)             /*!< ADCHS STATUS1: THCMP_ARANGE4 Mask       */
#define ADCHS_STATUS1_THCMP_DCROSS4_Pos       22                                                      /*!< ADCHS STATUS1: THCMP_DCROSS4 Position   */
#define ADCHS_STATUS1_THCMP_DCROSS4_Msk       (0x01UL << ADCHS_STATUS1_THCMP_DCROSS4_Pos)             /*!< ADCHS STATUS1: THCMP_DCROSS4 Mask       */
#define ADCHS_STATUS1_THCMP_UCROSS4_Pos       23                                                      /*!< ADCHS STATUS1: THCMP_UCROSS4 Position   */
#define ADCHS_STATUS1_THCMP_UCROSS4_Msk       (0x01UL << ADCHS_STATUS1_THCMP_UCROSS4_Pos)             /*!< ADCHS STATUS1: THCMP_UCROSS4 Mask       */
#define ADCHS_STATUS1_OVERRUN_4_Pos           24                                                      /*!< ADCHS STATUS1: OVERRUN_4 Position       */
#define ADCHS_STATUS1_OVERRUN_4_Msk           (0x01UL << ADCHS_STATUS1_OVERRUN_4_Pos)                 /*!< ADCHS STATUS1: OVERRUN_4 Mask           */
#define ADCHS_STATUS1_THCMP_BRANGE5_Pos       25                                                      /*!< ADCHS STATUS1: THCMP_BRANGE5 Position   */
#define ADCHS_STATUS1_THCMP_BRANGE5_Msk       (0x01UL << ADCHS_STATUS1_THCMP_BRANGE5_Pos)             /*!< ADCHS STATUS1: THCMP_BRANGE5 Mask       */
#define ADCHS_STATUS1_THCMP_ARANGE5_Pos       26                                                      /*!< ADCHS STATUS1: THCMP_ARANGE5 Position   */
#define ADCHS_STATUS1_THCMP_ARANGE5_Msk       (0x01UL << ADCHS_STATUS1_THCMP_ARANGE5_Pos)             /*!< ADCHS STATUS1: THCMP_ARANGE5 Mask       */
#define ADCHS_STATUS1_THCMP_DCROSS5_Pos       27                                                      /*!< ADCHS STATUS1: THCMP_DCROSS5 Position   */
#define ADCHS_STATUS1_THCMP_DCROSS5_Msk       (0x01UL << ADCHS_STATUS1_THCMP_DCROSS5_Pos)             /*!< ADCHS STATUS1: THCMP_DCROSS5 Mask       */
#define ADCHS_STATUS1_THCMP_UCROSS5_Pos       28                                                      /*!< ADCHS STATUS1: THCMP_UCROSS5 Position   */
#define ADCHS_STATUS1_THCMP_UCROSS5_Msk       (0x01UL << ADCHS_STATUS1_THCMP_UCROSS5_Pos)             /*!< ADCHS STATUS1: THCMP_UCROSS5 Mask       */
#define ADCHS_STATUS1_OVERRUN_5_Pos           29                                                      /*!< ADCHS STATUS1: OVERRUN_5 Position       */
#define ADCHS_STATUS1_OVERRUN_5_Msk           (0x01UL << ADCHS_STATUS1_OVERRUN_5_Pos)                 /*!< ADCHS STATUS1: OVERRUN_5 Mask           */

/* -------------------------------  ADCHS_CLR_STAT1  ------------------------------ */
#define ADCHS_CLR_STAT1_CSTAT1_Pos            0                                                       /*!< ADCHS CLR_STAT1: CSTAT1 Position        */
#define ADCHS_CLR_STAT1_CSTAT1_Msk            (0x3fffffffUL << ADCHS_CLR_STAT1_CSTAT1_Pos)            /*!< ADCHS CLR_STAT1: CSTAT1 Mask            */

/* -------------------------------  ADCHS_SET_STAT1  ------------------------------ */
#define ADCHS_SET_STAT1_SSTAT1_Pos            0                                                       /*!< ADCHS SET_STAT1: SSTAT1 Position        */
#define ADCHS_SET_STAT1_SSTAT1_Msk            (0x3fffffffUL << ADCHS_SET_STAT1_SSTAT1_Pos)            /*!< ADCHS SET_STAT1: SSTAT1 Mask            */


/* ================================================================================ */
/* ================       struct 'GPIO_PORT' Position & Mask       ================ */
/* ================================================================================ */


/* ---------------------------------  GPIO_PORT_B  -------------------------------- */
#define GPIO_PORT_B_PBYTE_Pos                 0                                                       /*!< GPIO_PORT B: PBYTE Position             */
#define GPIO_PORT_B_PBYTE_Msk                 (0x01UL << GPIO_PORT_B_PBYTE_Pos)                       /*!< GPIO_PORT B: PBYTE Mask                 */

/* ---------------------------------  GPIO_PORT_W  -------------------------------- */
#define GPIO_PORT_W_PWORD_Pos                 0                                                       /*!< GPIO_PORT W: PWORD Position             */
#define GPIO_PORT_W_PWORD_Msk                 (0xffffffffUL << GPIO_PORT_W_PWORD_Pos)                 /*!< GPIO_PORT W: PWORD Mask                 */

