MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -------------------------------  GPIO_PORT_MASK  ------------------------------- */
#define GPIO_PORT_MASK_MASKP0_Pos             0                                                       /*!< GPIO_PORT MASK: MASKP0 Position         */
#define GPIO_PORT_MASK_MASKP0_Msk             (0x01UL << GPIO_PORT_MASK_MASKP0_Pos)                   /*!< GPIO_PORT MASK: MASKP0 Mask             */
#define GPIO_PORT_MASK_MASKP1_Pos             1                                                       /*!< GPIO_PORT MASK: MASKP1 Position         */
#define GPIO_PORT_MASK_MASKP1_Msk             (0x01UL << GPIO_PORT_MASK_MASKP1_Pos)                   /*!< GPIO_PORT MASK: MASKP1 Mask             */
#define GPIO_PORT_MASK_MASKP2_Pos             2                                                       /*!< GPIO_PORT MASK: MASKP2 Position         */
#define GPIO_PORT_MASK_MASKP2_Msk             (0x01UL << GPIO_PORT_MASK_MASKP2_Pos)                   /*!< GPIO_PORT MASK: MASKP2 Mask             */
#define GPIO_PORT_MASK_MASKP3_Pos             3                                                       /*!< GPIO_PORT MASK: MASKP3 Position         */
#define GPIO_PORT_MASK_MASKP3_Msk             (0x01UL << GPIO_PORT_MASK_MASKP3_Pos)                   /*!< GPIO_PORT MASK: MASKP3 Mask             */
#define GPIO_PORT_MASK_MASKP4_Pos             4                                                       /*!< GPIO_PORT MASK: MASKP4 Position         */
#define GPIO_PORT_MASK_MASKP4_Msk             (0x01UL << GPIO_PORT_MASK_MASKP4_Pos)                   /*!< GPIO_PORT MASK: MASKP4 Mask             */
#define GPIO_PORT_MASK_MASKP5_Pos             5                                                       /*!< GPIO_PORT MASK: MASKP5 Position         */
#define GPIO_PORT_MASK_MASKP5_Msk             (0x01UL << GPIO_PORT_MASK_MASKP5_Pos)                   /*!< GPIO_PORT MASK: MASKP5 Mask             */
#define GPIO_PORT_MASK_MASKP6_Pos             6                                                       /*!< GPIO_PORT MASK: MASKP6 Position         */
#define GPIO_PORT_MASK_MASKP6_Msk             (0x01UL << GPIO_PORT_MASK_MASKP6_Pos)                   /*!< GPIO_PORT MASK: MASKP6 Mask             */
#define GPIO_PORT_MASK_MASKP7_Pos             7                                                       /*!< GPIO_PORT MASK: MASKP7 Position         */
#define GPIO_PORT_MASK_MASKP7_Msk             (0x01UL << GPIO_PORT_MASK_MASKP7_Pos)                   /*!< GPIO_PORT MASK: MASKP7 Mask             */
#define GPIO_PORT_MASK_MASKP8_Pos             8                                                       /*!< GPIO_PORT MASK: MASKP8 Position         */
#define GPIO_PORT_MASK_MASKP8_Msk             (0x01UL << GPIO_PORT_MASK_MASKP8_Pos)                   /*!< GPIO_PORT MASK: MASKP8 Mask             */
#define GPIO_PORT_MASK_MASKP9_Pos             9                                                       /*!< GPIO_PORT MASK: MASKP9 Position         */
#define GPIO_PORT_MASK_MASKP9_Msk             (0x01UL << GPIO_PORT_MASK_MASKP9_Pos)                   /*!< GPIO_PORT MASK: MASKP9 Mask             */
#define GPIO_PORT_MASK_MASKP10_Pos            10                                                      /*!< GPIO_PORT MASK: MASKP10 Position        */
#define GPIO_PORT_MASK_MASKP10_Msk            (0x01UL << GPIO_PORT_MASK_MASKP10_Pos)                  /*!< GPIO_PORT MASK: MASKP10 Mask            */
#define GPIO_PORT_MASK_MASKP11_Pos            11                                                      /*!< GPIO_PORT MASK: MASKP11 Position        */
#define GPIO_PORT_MASK_MASKP11_Msk            (0x01UL << GPIO_PORT_MASK_MASKP11_Pos)                  /*!< GPIO_PORT MASK: MASKP11 Mask            */
#define GPIO_PORT_MASK_MASKP12_Pos            12                                                      /*!< GPIO_PORT MASK: MASKP12 Position        */
#define GPIO_PORT_MASK_MASKP12_Msk            (0x01UL << GPIO_PORT_MASK_MASKP12_Pos)                  /*!< GPIO_PORT MASK: MASKP12 Mask            */
#define GPIO_PORT_MASK_MASKP13_Pos            13                                                      /*!< GPIO_PORT MASK: MASKP13 Position        */
#define GPIO_PORT_MASK_MASKP13_Msk            (0x01UL << GPIO_PORT_MASK_MASKP13_Pos)                  /*!< GPIO_PORT MASK: MASKP13 Mask            */
#define GPIO_PORT_MASK_MASKP14_Pos            14                                                      /*!< GPIO_PORT MASK: MASKP14 Position        */
#define GPIO_PORT_MASK_MASKP14_Msk            (0x01UL << GPIO_PORT_MASK_MASKP14_Pos)                  /*!< GPIO_PORT MASK: MASKP14 Mask            */
#define GPIO_PORT_MASK_MASKP15_Pos            15                                                      /*!< GPIO_PORT MASK: MASKP15 Position        */
#define GPIO_PORT_MASK_MASKP15_Msk            (0x01UL << GPIO_PORT_MASK_MASKP15_Pos)                  /*!< GPIO_PORT MASK: MASKP15 Mask            */
#define GPIO_PORT_MASK_MASKP16_Pos            16                                                      /*!< GPIO_PORT MASK: MASKP16 Position        */
#define GPIO_PORT_MASK_MASKP16_Msk            (0x01UL << GPIO_PORT_MASK_MASKP16_Pos)                  /*!< GPIO_PORT MASK: MASKP16 Mask            */
#define GPIO_PORT_MASK_MASKP17_Pos            17                                                      /*!< GPIO_PORT MASK: MASKP17 Position        */
#define GPIO_PORT_MASK_MASKP17_Msk            (0x01UL << GPIO_PORT_MASK_MASKP17_Pos)                  /*!< GPIO_PORT MASK: MASKP17 Mask            */
#define GPIO_PORT_MASK_MASKP18_Pos            18                                                      /*!< GPIO_PORT MASK: MASKP18 Position        */
#define GPIO_PORT_MASK_MASKP18_Msk            (0x01UL << GPIO_PORT_MASK_MASKP18_Pos)                  /*!< GPIO_PORT MASK: MASKP18 Mask            */
#define GPIO_PORT_MASK_MASKP19_Pos            19                                                      /*!< GPIO_PORT MASK: MASKP19 Position        */
#define GPIO_PORT_MASK_MASKP19_Msk            (0x01UL << GPIO_PORT_MASK_MASKP19_Pos)                  /*!< GPIO_PORT MASK: MASKP19 Mask            */
#define GPIO_PORT_MASK_MASKP20_Pos            20                                                      /*!< GPIO_PORT MASK: MASKP20 Position        */
#define GPIO_PORT_MASK_MASKP20_Msk            (0x01UL << GPIO_PORT_MASK_MASKP20_Pos)                  /*!< GPIO_PORT MASK: MASKP20 Mask            */
#define GPIO_PORT_MASK_MASKP21_Pos            21                                                      /*!< GPIO_PORT MASK: MASKP21 Position        */
#define GPIO_PORT_MASK_MASKP21_Msk            (0x01UL << GPIO_PORT_MASK_MASKP21_Pos)                  /*!< GPIO_PORT MASK: MASKP21 Mask            */
#define GPIO_PORT_MASK_MASKP22_Pos            22                                                      /*!< GPIO_PORT MASK: MASKP22 Position        */
#define GPIO_PORT_MASK_MASKP22_Msk            (0x01UL << GPIO_PORT_MASK_MASKP22_Pos)                  /*!< GPIO_PORT MASK: MASKP22 Mask            */
#define GPIO_PORT_MASK_MASKP23_Pos            23                                                      /*!< GPIO_PORT MASK: MASKP23 Position        */
#define GPIO_PORT_MASK_MASKP23_Msk            (0x01UL << GPIO_PORT_MASK_MASKP23_Pos)                  /*!< GPIO_PORT MASK: MASKP23 Mask            */
#define GPIO_PORT_MASK_MASKP24_Pos            24                                                      /*!< GPIO_PORT MASK: MASKP24 Position        */
#define GPIO_PORT_MASK_MASKP24_Msk            (0x01UL << GPIO_PORT_MASK_MASKP24_Pos)                  /*!< GPIO_PORT MASK: MASKP24 Mask            */
#define GPIO_PORT_MASK_MASKP25_Pos            25                                                      /*!< GPIO_PORT MASK: MASKP25 Position        */
#define GPIO_PORT_MASK_MASKP25_Msk            (0x01UL << GPIO_PORT_MASK_MASKP25_Pos)                  /*!< GPIO_PORT MASK: MASKP25 Mask            */
#define GPIO_PORT_MASK_MASKP26_Pos            26                                                      /*!< GPIO_PORT MASK: MASKP26 Position        */
#define GPIO_PORT_MASK_MASKP26_Msk            (0x01UL << GPIO_PORT_MASK_MASKP26_Pos)                  /*!< GPIO_PORT MASK: MASKP26 Mask            */
#define GPIO_PORT_MASK_MASKP27_Pos            27                                                      /*!< GPIO_PORT MASK: MASKP27 Position        */
#define GPIO_PORT_MASK_MASKP27_Msk            (0x01UL << GPIO_PORT_MASK_MASKP27_Pos)                  /*!< GPIO_PORT MASK: MASKP27 Mask            */
#define GPIO_PORT_MASK_MASKP28_Pos            28                                                      /*!< GPIO_PORT MASK: MASKP28 Position        */
#define GPIO_PORT_MASK_MASKP28_Msk            (0x01UL << GPIO_PORT_MASK_MASKP28_Pos)                  /*!< GPIO_PORT MASK: MASKP28 Mask            */
#define GPIO_PORT_MASK_MASKP29_Pos            29                                                      /*!< GPIO_PORT MASK: MASKP29 Position        */
#define GPIO_PORT_MASK_MASKP29_Msk            (0x01UL << GPIO_PORT_MASK_MASKP29_Pos)                  /*!< GPIO_PORT MASK: MASKP29 Mask            */
#define GPIO_PORT_MASK_MASKP30_Pos            30                                                      /*!< GPIO_PORT MASK: MASKP30 Position        */
#define GPIO_PORT_MASK_MASKP30_Msk            (0x01UL << GPIO_PORT_MASK_MASKP30_Pos)                  /*!< GPIO_PORT MASK: MASKP30 Mask            */
#define GPIO_PORT_MASK_MASKP31_Pos            31                                                      /*!< GPIO_PORT MASK: MASKP31 Position        */
#define GPIO_PORT_MASK_MASKP31_Msk            (0x01UL << GPIO_PORT_MASK_MASKP31_Pos)                  /*!< GPIO_PORT MASK: MASKP31 Mask            */

/* --------------------------------  GPIO_PORT_PIN  ------------------------------- */
#define GPIO_PORT_PIN_PORT0_Pos               0                                                       /*!< GPIO_PORT PIN: PORT0 Position           */
#define GPIO_PORT_PIN_PORT0_Msk               (0x01UL << GPIO_PORT_PIN_PORT0_Pos)                     /*!< GPIO_PORT PIN: PORT0 Mask               */
#define GPIO_PORT_PIN_PORT1_Pos               1                                                       /*!< GPIO_PORT PIN: PORT1 Position           */
#define GPIO_PORT_PIN_PORT1_Msk               (0x01UL << GPIO_PORT_PIN_PORT1_Pos)                     /*!< GPIO_PORT PIN: PORT1 Mask               */
#define GPIO_PORT_PIN_PORT2_Pos               2                                                       /*!< GPIO_PORT PIN: PORT2 Position           */
#define GPIO_PORT_PIN_PORT2_Msk               (0x01UL << GPIO_PORT_PIN_PORT2_Pos)                     /*!< GPIO_PORT PIN: PORT2 Mask               */
#define GPIO_PORT_PIN_PORT3_Pos               3                                                       /*!< GPIO_PORT PIN: PORT3 Position           */
#define GPIO_PORT_PIN_PORT3_Msk               (0x01UL << GPIO_PORT_PIN_PORT3_Pos)                     /*!< GPIO_PORT PIN: PORT3 Mask               */
#define GPIO_PORT_PIN_PORT4_Pos               4                                                       /*!< GPIO_PORT PIN: PORT4 Position           */
#define GPIO_PORT_PIN_PORT4_Msk               (0x01UL << GPIO_PORT_PIN_PORT4_Pos)                     /*!< GPIO_PORT PIN: PORT4 Mask               */
#define GPIO_PORT_PIN_PORT5_Pos               5                                                       /*!< GPIO_PORT PIN: PORT5 Position           */
#define GPIO_PORT_PIN_PORT5_Msk               (0x01UL << GPIO_PORT_PIN_PORT5_Pos)                     /*!< GPIO_PORT PIN: PORT5 Mask               */
#define GPIO_PORT_PIN_PORT6_Pos               6                                                       /*!< GPIO_PORT PIN: PORT6 Position           */
#define GPIO_PORT_PIN_PORT6_Msk               (0x01UL << GPIO_PORT_PIN_PORT6_Pos)                     /*!< GPIO_PORT PIN: PORT6 Mask               */
#define GPIO_PORT_PIN_PORT7_Pos               7                                                       /*!< GPIO_PORT PIN: PORT7 Position           */
#define GPIO_PORT_PIN_PORT7_Msk               (0x01UL << GPIO_PORT_PIN_PORT7_Pos)                     /*!< GPIO_PORT PIN: PORT7 Mask               */
#define GPIO_PORT_PIN_PORT8_Pos               8                                                       /*!< GPIO_PORT PIN: PORT8 Position           */
#define GPIO_PORT_PIN_PORT8_Msk               (0x01UL << GPIO_PORT_PIN_PORT8_Pos)                     /*!< GPIO_PORT PIN: PORT8 Mask               */
#define GPIO_PORT_PIN_PORT9_Pos               9                                                       /*!< GPIO_PORT PIN: PORT9 Position           */
#define GPIO_PORT_PIN_PORT9_Msk               (0x01UL << GPIO_PORT_PIN_PORT9_Pos)                     /*!< GPIO_PORT PIN: PORT9 Mask               */
#define GPIO_PORT_PIN_PORT10_Pos              10                                                      /*!< GPIO_PORT PIN: PORT10 Position          */
#define GPIO_PORT_PIN_PORT10_Msk              (0x01UL << GPIO_PORT_PIN_PORT10_Pos)                    /*!< GPIO_PORT PIN: PORT10 Mask              */
#define GPIO_PORT_PIN_PORT11_Pos              11                                                      /*!< GPIO_PORT PIN: PORT11 Position          */
#define GPIO_PORT_PIN_PORT11_Msk              (0x01UL << GPIO_PORT_PIN_PORT11_Pos)                    /*!< GPIO_PORT PIN: PORT11 Mask              */
#define GPIO_PORT_PIN_PORT12_Pos              12                                                      /*!< GPIO_PORT PIN: PORT12 Position          */
#define GPIO_PORT_PIN_PORT12_Msk              (0x01UL << GPIO_PORT_PIN_PORT12_Pos)                    /*!< GPIO_PORT PIN: PORT12 Mask              */
#define GPIO_PORT_PIN_PORT13_Pos              13                                                      /*!< GPIO_PORT PIN: PORT13 Position          */
#define GPIO_PORT_PIN_PORT13_Msk              (0x01UL << GPIO_PORT_PIN_PORT13_Pos)                    /*!< GPIO_PORT PIN: PORT13 Mask              */
#define GPIO_PORT_PIN_PORT14_Pos              14                                                      /*!< GPIO_PORT PIN: PORT14 Position          */
#define GPIO_PORT_PIN_PORT14_Msk              (0x01UL << GPIO_PORT_PIN_PORT14_Pos)                    /*!< GPIO_PORT PIN: PORT14 Mask              */
#define GPIO_PORT_PIN_PORT15_Pos              15                                                      /*!< GPIO_PORT PIN: PORT15 Position          */
#define GPIO_PORT_PIN_PORT15_Msk              (0x01UL << GPIO_PORT_PIN_PORT15_Pos)                    /*!< GPIO_PORT PIN: PORT15 Mask              */
#define GPIO_PORT_PIN_PORT16_Pos              16                                                      /*!< GPIO_PORT PIN: PORT16 Position          */
#define GPIO_PORT_PIN_PORT16_Msk              (0x01UL << GPIO_PORT_PIN_PORT16_Pos)                    /*!< GPIO_PORT PIN: PORT16 Mask              */
#define GPIO_PORT_PIN_PORT17_Pos              17                                                      /*!< GPIO_PORT PIN: PORT17 Position          */
#define GPIO_PORT_PIN_PORT17_Msk              (0x01UL << GPIO_PORT_PIN_PORT17_Pos)                    /*!< GPIO_PORT PIN: PORT17 Mask              */
#define GPIO_PORT_PIN_PORT18_Pos              18                                                      /*!< GPIO_PORT PIN: PORT18 Position          */
#define GPIO_PORT_PIN_PORT18_Msk              (0x01UL << GPIO_PORT_PIN_PORT18_Pos)                    /*!< GPIO_PORT PIN: PORT18 Mask              */
#define GPIO_PORT_PIN_PORT19_Pos              19                                                      /*!< GPIO_PORT PIN: PORT19 Position          */
#define GPIO_PORT_PIN_PORT19_Msk              (0x01UL << GPIO_PORT_PIN_PORT19_Pos)                    /*!< GPIO_PORT PIN: PORT19 Mask              */
#define GPIO_PORT_PIN_PORT20_Pos              20                                                      /*!< GPIO_PORT PIN: PORT20 Position          */
#define GPIO_PORT_PIN_PORT20_Msk              (0x01UL << GPIO_PORT_PIN_PORT20_Pos)                    /*!< GPIO_PORT PIN: PORT20 Mask              */
#define GPIO_PORT_PIN_PORT21_Pos              21                                                      /*!< GPIO_PORT PIN: PORT21 Position          */
#define GPIO_PORT_PIN_PORT21_Msk              (0x01UL << GPIO_PORT_PIN_PORT21_Pos)                    /*!< GPIO_PORT PIN: PORT21 Mask              */
#define GPIO_PORT_PIN_PORT22_Pos              22                                                      /*!< GPIO_PORT PIN: PORT22 Position          */
#define GPIO_PORT_PIN_PORT22_Msk              (0x01UL << GPIO_PORT_PIN_PORT22_Pos)                    /*!< GPIO_PORT PIN: PORT22 Mask              */
#define GPIO_PORT_PIN_PORT23_Pos              23                                                      /*!< GPIO_PORT PIN: PORT23 Position          */
#define GPIO_PORT_PIN_PORT23_Msk              (0x01UL << GPIO_PORT_PIN_PORT23_Pos)                    /*!< GPIO_PORT PIN: PORT23 Mask              */
#define GPIO_PORT_PIN_PORT24_Pos              24                                                      /*!< GPIO_PORT PIN: PORT24 Position          */
#define GPIO_PORT_PIN_PORT24_Msk              (0x01UL << GPIO_PORT_PIN_PORT24_Pos)                    /*!< GPIO_PORT PIN: PORT24 Mask              */
#define GPIO_PORT_PIN_PORT25_Pos              25                                                      /*!< GPIO_PORT PIN: PORT25 Position          */
#define GPIO_PORT_PIN_PORT25_Msk              (0x01UL << GPIO_PORT_PIN_PORT25_Pos)                    /*!< GPIO_PORT PIN: PORT25 Mask              */
#define GPIO_PORT_PIN_PORT26_Pos              26                                                      /*!< GPIO_PORT PIN: PORT26 Position          */
#define GPIO_PORT_PIN_PORT26_Msk              (0x01UL << GPIO_PORT_PIN_PORT26_Pos)                    /*!< GPIO_PORT PIN: PORT26 Mask              */
#define GPIO_PORT_PIN_PORT27_Pos              27                                                      /*!< GPIO_PORT PIN: PORT27 Position          */
#define GPIO_PORT_PIN_PORT27_Msk              (0x01UL << GPIO_PORT_PIN_PORT27_Pos)                    /*!< GPIO_PORT PIN: PORT27 Mask              */
#define GPIO_PORT_PIN_PORT28_Pos              28                                                      /*!< GPIO_PORT PIN: PORT28 Position          */
#define GPIO_PORT_PIN_PORT28_Msk              (0x01UL << GPIO_PORT_PIN_PORT28_Pos)                    /*!< GPIO_PORT PIN: PORT28 Mask              */
#define GPIO_PORT_PIN_PORT29_Pos              29                                                      /*!< GPIO_PORT PIN: PORT29 Position          */
#define GPIO_PORT_PIN_PORT29_Msk              (0x01UL << GPIO_PORT_PIN_PORT29_Pos)                    /*!< GPIO_PORT PIN: PORT29 Mask              */
#define GPIO_PORT_PIN_PORT30_Pos              30                                                      /*!< GPIO_PORT PIN: PORT30 Position          */
#define GPIO_PORT_PIN_PORT30_Msk              (0x01UL << GPIO_PORT_PIN_PORT30_Pos)                    /*!< GPIO_PORT PIN: PORT30 Mask              */
#define GPIO_PORT_PIN_PORT31_Pos              31                                                      /*!< GPIO_PORT PIN: PORT31 Position          */
#define GPIO_PORT_PIN_PORT31_Msk              (0x01UL << GPIO_PORT_PIN_PORT31_Pos)                    /*!< GPIO_PORT PIN: PORT31 Mask              */

