MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* --------------------------------  GPIO_PORT_CLR  ------------------------------- */
#define GPIO_PORT_CLR_CLRP00_Pos              0                                                       /*!< GPIO_PORT CLR: CLRP00 Position          */
#define GPIO_PORT_CLR_CLRP00_Msk              (0x01UL << GPIO_PORT_CLR_CLRP00_Pos)                    /*!< GPIO_PORT CLR: CLRP00 Mask              */
#define GPIO_PORT_CLR_CLRP01_Pos              1                                                       /*!< GPIO_PORT CLR: CLRP01 Position          */
#define GPIO_PORT_CLR_CLRP01_Msk              (0x01UL << GPIO_PORT_CLR_CLRP01_Pos)                    /*!< GPIO_PORT CLR: CLRP01 Mask              */
#define GPIO_PORT_CLR_CLRP02_Pos              2                                                       /*!< GPIO_PORT CLR: CLRP02 Position          */
#define GPIO_PORT_CLR_CLRP02_Msk              (0x01UL << GPIO_PORT_CLR_CLRP02_Pos)                    /*!< GPIO_PORT CLR: CLRP02 Mask              */
#define GPIO_PORT_CLR_CLRP03_Pos              3                                                       /*!< GPIO_PORT CLR: CLRP03 Position          */
#define GPIO_PORT_CLR_CLRP03_Msk              (0x01UL << GPIO_PORT_CLR_CLRP03_Pos)                    /*!< GPIO_PORT CLR: CLRP03 Mask              */
#define GPIO_PORT_CLR_CLRP04_Pos              4                                                       /*!< GPIO_PORT CLR: CLRP04 Position          */
#define GPIO_PORT_CLR_CLRP04_Msk              (0x01UL << GPIO_PORT_CLR_CLRP04_Pos)                    /*!< GPIO_PORT CLR: CLRP04 Mask              */
#define GPIO_PORT_CLR_CLRP05_Pos              5                                                       /*!< GPIO_PORT CLR: CLRP05 Position          */
#define GPIO_PORT_CLR_CLRP05_Msk              (0x01UL << GPIO_PORT_CLR_CLRP05_Pos)                    /*!< GPIO_PORT CLR: CLRP05 Mask              */
#define GPIO_PORT_CLR_CLRP06_Pos              6                                                       /*!< GPIO_PORT CLR: CLRP06 Position          */
#define GPIO_PORT_CLR_CLRP06_Msk              (0x01UL << GPIO_PORT_CLR_CLRP06_Pos)                    /*!< GPIO_PORT CLR: CLRP06 Mask              */
#define GPIO_PORT_CLR_CLRP07_Pos              7                                                       /*!< GPIO_PORT CLR: CLRP07 Position          */
#define GPIO_PORT_CLR_CLRP07_Msk              (0x01UL << GPIO_PORT_CLR_CLRP07_Pos)                    /*!< GPIO_PORT CLR: CLRP07 Mask              */
#define GPIO_PORT_CLR_CLRP08_Pos              8                                                       /*!< GPIO_PORT CLR: CLRP08 Position          */
#define GPIO_PORT_CLR_CLRP08_Msk              (0x01UL << GPIO_PORT_CLR_CLRP08_Pos)                    /*!< GPIO_PORT CLR: CLRP08 Mask              */
#define GPIO_PORT_CLR_CLRP09_Pos              9                                                       /*!< GPIO_PORT CLR: CLRP09 Position          */
#define GPIO_PORT_CLR_CLRP09_Msk              (0x01UL << GPIO_PORT_CLR_CLRP09_Pos)                    /*!< GPIO_PORT CLR: CLRP09 Mask              */
#define GPIO_PORT_CLR_CLRP010_Pos             10                                                      /*!< GPIO_PORT CLR: CLRP010 Position         */
#define GPIO_PORT_CLR_CLRP010_Msk             (0x01UL << GPIO_PORT_CLR_CLRP010_Pos)                   /*!< GPIO_PORT CLR: CLRP010 Mask             */
#define GPIO_PORT_CLR_CLRP011_Pos             11                                                      /*!< GPIO_PORT CLR: CLRP011 Position         */
#define GPIO_PORT_CLR_CLRP011_Msk             (0x01UL << GPIO_PORT_CLR_CLRP011_Pos)                   /*!< GPIO_PORT CLR: CLRP011 Mask             */
#define GPIO_PORT_CLR_CLRP012_Pos             12                                                      /*!< GPIO_PORT CLR: CLRP012 Position         */
#define GPIO_PORT_CLR_CLRP012_Msk             (0x01UL << GPIO_PORT_CLR_CLRP012_Pos)                   /*!< GPIO_PORT CLR: CLRP012 Mask             */
#define GPIO_PORT_CLR_CLRP013_Pos             13                                                      /*!< GPIO_PORT CLR: CLRP013 Position         */
#define GPIO_PORT_CLR_CLRP013_Msk             (0x01UL << GPIO_PORT_CLR_CLRP013_Pos)                   /*!< GPIO_PORT CLR: CLRP013 Mask             */
#define GPIO_PORT_CLR_CLRP014_Pos             14                                                      /*!< GPIO_PORT CLR: CLRP014 Position         */
#define GPIO_PORT_CLR_CLRP014_Msk             (0x01UL << GPIO_PORT_CLR_CLRP014_Pos)                   /*!< GPIO_PORT CLR: CLRP014 Mask             */
#define GPIO_PORT_CLR_CLRP015_Pos             15                                                      /*!< GPIO_PORT CLR: CLRP015 Position         */
#define GPIO_PORT_CLR_CLRP015_Msk             (0x01UL << GPIO_PORT_CLR_CLRP015_Pos)                   /*!< GPIO_PORT CLR: CLRP015 Mask             */
#define GPIO_PORT_CLR_CLRP016_Pos             16                                                      /*!< GPIO_PORT CLR: CLRP016 Position         */
#define GPIO_PORT_CLR_CLRP016_Msk             (0x01UL << GPIO_PORT_CLR_CLRP016_Pos)                   /*!< GPIO_PORT CLR: CLRP016 Mask             */
#define GPIO_PORT_CLR_CLRP017_Pos             17                                                      /*!< GPIO_PORT CLR: CLRP017 Position         */
#define GPIO_PORT_CLR_CLRP017_Msk             (0x01UL << GPIO_PORT_CLR_CLRP017_Pos)                   /*!< GPIO_PORT CLR: CLRP017 Mask             */
#define GPIO_PORT_CLR_CLRP018_Pos             18                                                      /*!< GPIO_PORT CLR: CLRP018 Position         */
#define GPIO_PORT_CLR_CLRP018_Msk             (0x01UL << GPIO_PORT_CLR_CLRP018_Pos)                   /*!< GPIO_PORT CLR: CLRP018 Mask             */
#define GPIO_PORT_CLR_CLRP019_Pos             19                                                      /*!< GPIO_PORT CLR: CLRP019 Position         */
#define GPIO_PORT_CLR_CLRP019_Msk             (0x01UL << GPIO_PORT_CLR_CLRP019_Pos)                   /*!< GPIO_PORT CLR: CLRP019 Mask             */
#define GPIO_PORT_CLR_CLRP020_Pos             20                                                      /*!< GPIO_PORT CLR: CLRP020 Position         */
#define GPIO_PORT_CLR_CLRP020_Msk             (0x01UL << GPIO_PORT_CLR_CLRP020_Pos)                   /*!< GPIO_PORT CLR: CLRP020 Mask             */
#define GPIO_PORT_CLR_CLRP021_Pos             21                                                      /*!< GPIO_PORT CLR: CLRP021 Position         */
#define GPIO_PORT_CLR_CLRP021_Msk             (0x01UL << GPIO_PORT_CLR_CLRP021_Pos)                   /*!< GPIO_PORT CLR: CLRP021 Mask             */
#define GPIO_PORT_CLR_CLRP022_Pos             22                                                      /*!< GPIO_PORT CLR: CLRP022 Position         */
#define GPIO_PORT_CLR_CLRP022_Msk             (0x01UL << GPIO_PORT_CLR_CLRP022_Pos)                   /*!< GPIO_PORT CLR: CLRP022 Mask             */
#define GPIO_PORT_CLR_CLRP023_Pos             23                                                      /*!< GPIO_PORT CLR: CLRP023 Position         */
#define GPIO_PORT_CLR_CLRP023_Msk             (0x01UL << GPIO_PORT_CLR_CLRP023_Pos)                   /*!< GPIO_PORT CLR: CLRP023 Mask             */
#define GPIO_PORT_CLR_CLRP024_Pos             24                                                      /*!< GPIO_PORT CLR: CLRP024 Position         */
#define GPIO_PORT_CLR_CLRP024_Msk             (0x01UL << GPIO_PORT_CLR_CLRP024_Pos)                   /*!< GPIO_PORT CLR: CLRP024 Mask             */
#define GPIO_PORT_CLR_CLRP025_Pos             25                                                      /*!< GPIO_PORT CLR: CLRP025 Position         */
#define GPIO_PORT_CLR_CLRP025_Msk             (0x01UL << GPIO_PORT_CLR_CLRP025_Pos)                   /*!< GPIO_PORT CLR: CLRP025 Mask             */
#define GPIO_PORT_CLR_CLRP026_Pos             26                                                      /*!< GPIO_PORT CLR: CLRP026 Position         */
#define GPIO_PORT_CLR_CLRP026_Msk             (0x01UL << GPIO_PORT_CLR_CLRP026_Pos)                   /*!< GPIO_PORT CLR: CLRP026 Mask             */
#define GPIO_PORT_CLR_CLRP027_Pos             27                                                      /*!< GPIO_PORT CLR: CLRP027 Position         */
#define GPIO_PORT_CLR_CLRP027_Msk             (0x01UL << GPIO_PORT_CLR_CLRP027_Pos)                   /*!< GPIO_PORT CLR: CLRP027 Mask             */
#define GPIO_PORT_CLR_CLRP028_Pos             28                                                      /*!< GPIO_PORT CLR: CLRP028 Position         */
#define GPIO_PORT_CLR_CLRP028_Msk             (0x01UL << GPIO_PORT_CLR_CLRP028_Pos)                   /*!< GPIO_PORT CLR: CLRP028 Mask             */
#define GPIO_PORT_CLR_CLRP029_Pos             29                                                      /*!< GPIO_PORT CLR: CLRP029 Position         */
#define GPIO_PORT_CLR_CLRP029_Msk             (0x01UL << GPIO_PORT_CLR_CLRP029_Pos)                   /*!< GPIO_PORT CLR: CLRP029 Mask             */
#define GPIO_PORT_CLR_CLRP030_Pos             30                                                      /*!< GPIO_PORT CLR: CLRP030 Position         */
#define GPIO_PORT_CLR_CLRP030_Msk             (0x01UL << GPIO_PORT_CLR_CLRP030_Pos)                   /*!< GPIO_PORT CLR: CLRP030 Mask             */
#define GPIO_PORT_CLR_CLRP031_Pos             31                                                      /*!< GPIO_PORT CLR: CLRP031 Position         */
#define GPIO_PORT_CLR_CLRP031_Msk             (0x01UL << GPIO_PORT_CLR_CLRP031_Pos)                   /*!< GPIO_PORT CLR: CLRP031 Mask             */

/* --------------------------------  GPIO_PORT_NOT  ------------------------------- */
#define GPIO_PORT_NOT_NOTP0_Pos               0                                                       /*!< GPIO_PORT NOT: NOTP0 Position           */
#define GPIO_PORT_NOT_NOTP0_Msk               (0x01UL << GPIO_PORT_NOT_NOTP0_Pos)                     /*!< GPIO_PORT NOT: NOTP0 Mask               */
#define GPIO_PORT_NOT_NOTP1_Pos               1                                                       /*!< GPIO_PORT NOT: NOTP1 Position           */
#define GPIO_PORT_NOT_NOTP1_Msk               (0x01UL << GPIO_PORT_NOT_NOTP1_Pos)                     /*!< GPIO_PORT NOT: NOTP1 Mask               */
#define GPIO_PORT_NOT_NOTP2_Pos               2                                                       /*!< GPIO_PORT NOT: NOTP2 Position           */
#define GPIO_PORT_NOT_NOTP2_Msk               (0x01UL << GPIO_PORT_NOT_NOTP2_Pos)                     /*!< GPIO_PORT NOT: NOTP2 Mask               */
#define GPIO_PORT_NOT_NOTP3_Pos               3                                                       /*!< GPIO_PORT NOT: NOTP3 Position           */
#define GPIO_PORT_NOT_NOTP3_Msk               (0x01UL << GPIO_PORT_NOT_NOTP3_Pos)                     /*!< GPIO_PORT NOT: NOTP3 Mask               */
#define GPIO_PORT_NOT_NOTP4_Pos               4                                                       /*!< GPIO_PORT NOT: NOTP4 Position           */
#define GPIO_PORT_NOT_NOTP4_Msk               (0x01UL << GPIO_PORT_NOT_NOTP4_Pos)                     /*!< GPIO_PORT NOT: NOTP4 Mask               */
#define GPIO_PORT_NOT_NOTP5_Pos               5                                                       /*!< GPIO_PORT NOT: NOTP5 Position           */
#define GPIO_PORT_NOT_NOTP5_Msk               (0x01UL << GPIO_PORT_NOT_NOTP5_Pos)                     /*!< GPIO_PORT NOT: NOTP5 Mask               */
#define GPIO_PORT_NOT_NOTP6_Pos               6                                                       /*!< GPIO_PORT NOT: NOTP6 Position           */
#define GPIO_PORT_NOT_NOTP6_Msk               (0x01UL << GPIO_PORT_NOT_NOTP6_Pos)                     /*!< GPIO_PORT NOT: NOTP6 Mask               */
#define GPIO_PORT_NOT_NOTP7_Pos               7                                                       /*!< GPIO_PORT NOT: NOTP7 Position           */
#define GPIO_PORT_NOT_NOTP7_Msk               (0x01UL << GPIO_PORT_NOT_NOTP7_Pos)                     /*!< GPIO_PORT NOT: NOTP7 Mask               */
#define GPIO_PORT_NOT_NOTP8_Pos               8                                                       /*!< GPIO_PORT NOT: NOTP8 Position           */
#define GPIO_PORT_NOT_NOTP8_Msk               (0x01UL << GPIO_PORT_NOT_NOTP8_Pos)                     /*!< GPIO_PORT NOT: NOTP8 Mask               */
#define GPIO_PORT_NOT_NOTP9_Pos               9                                                       /*!< GPIO_PORT NOT: NOTP9 Position           */
#define GPIO_PORT_NOT_NOTP9_Msk               (0x01UL << GPIO_PORT_NOT_NOTP9_Pos)                     /*!< GPIO_PORT NOT: NOTP9 Mask               */
#define GPIO_PORT_NOT_NOTP10_Pos              10                                                      /*!< GPIO_PORT NOT: NOTP10 Position          */
#define GPIO_PORT_NOT_NOTP10_Msk              (0x01UL << GPIO_PORT_NOT_NOTP10_Pos)                    /*!< GPIO_PORT NOT: NOTP10 Mask              */
#define GPIO_PORT_NOT_NOTP11_Pos              11                                                      /*!< GPIO_PORT NOT: NOTP11 Position          */
#define GPIO_PORT_NOT_NOTP11_Msk              (0x01UL << GPIO_PORT_NOT_NOTP11_Pos)                    /*!< GPIO_PORT NOT: NOTP11 Mask              */
#define GPIO_PORT_NOT_NOTP12_Pos              12                                                      /*!< GPIO_PORT NOT: NOTP12 Position          */
#define GPIO_PORT_NOT_NOTP12_Msk              (0x01UL << GPIO_PORT_NOT_NOTP12_Pos)                    /*!< GPIO_PORT NOT: NOTP12 Mask              */
#define GPIO_PORT_NOT_NOTP13_Pos              13                                                      /*!< GPIO_PORT NOT: NOTP13 Position          */
#define GPIO_PORT_NOT_NOTP13_Msk              (0x01UL << GPIO_PORT_NOT_NOTP13_Pos)                    /*!< GPIO_PORT NOT: NOTP13 Mask              */
#define GPIO_PORT_NOT_NOTP14_Pos              14                                                      /*!< GPIO_PORT NOT: NOTP14 Position          */
#define GPIO_PORT_NOT_NOTP14_Msk              (0x01UL << GPIO_PORT_NOT_NOTP14_Pos)                    /*!< GPIO_PORT NOT: NOTP14 Mask              */
#define GPIO_PORT_NOT_NOTP15_Pos              15                                                      /*!< GPIO_PORT NOT: NOTP15 Position          */
#define GPIO_PORT_NOT_NOTP15_Msk              (0x01UL << GPIO_PORT_NOT_NOTP15_Pos)                    /*!< GPIO_PORT NOT: NOTP15 Mask              */
#define GPIO_PORT_NOT_NOTP16_Pos              16                                                      /*!< GPIO_PORT NOT: NOTP16 Position          */
#define GPIO_PORT_NOT_NOTP16_Msk              (0x01UL << GPIO_PORT_NOT_NOTP16_Pos)                    /*!< GPIO_PORT NOT: NOTP16 Mask              */
#define GPIO_PORT_NOT_NOTP17_Pos              17                                                      /*!< GPIO_PORT NOT: NOTP17 Position          */
#define GPIO_PORT_NOT_NOTP17_Msk              (0x01UL << GPIO_PORT_NOT_NOTP17_Pos)                    /*!< GPIO_PORT NOT: NOTP17 Mask              */
#define GPIO_PORT_NOT_NOTP18_Pos              18                                                      /*!< GPIO_PORT NOT: NOTP18 Position          */
#define GPIO_PORT_NOT_NOTP18_Msk              (0x01UL << GPIO_PORT_NOT_NOTP18_Pos)                    /*!< GPIO_PORT NOT: NOTP18 Mask              */
#define GPIO_PORT_NOT_NOTP19_Pos              19                                                      /*!< GPIO_PORT NOT: NOTP19 Position          */
#define GPIO_PORT_NOT_NOTP19_Msk              (0x01UL << GPIO_PORT_NOT_NOTP19_Pos)                    /*!< GPIO_PORT NOT: NOTP19 Mask              */
#define GPIO_PORT_NOT_NOTP20_Pos              20                                                      /*!< GPIO_PORT NOT: NOTP20 Position          */
#define GPIO_PORT_NOT_NOTP20_Msk              (0x01UL << GPIO_PORT_NOT_NOTP20_Pos)                    /*!< GPIO_PORT NOT: NOTP20 Mask              */
#define GPIO_PORT_NOT_NOTP21_Pos              21                                                      /*!< GPIO_PORT NOT: NOTP21 Position          */
#define GPIO_PORT_NOT_NOTP21_Msk              (0x01UL << GPIO_PORT_NOT_NOTP21_Pos)                    /*!< GPIO_PORT NOT: NOTP21 Mask              */
#define GPIO_PORT_NOT_NOTP22_Pos              22                                                      /*!< GPIO_PORT NOT: NOTP22 Position          */
#define GPIO_PORT_NOT_NOTP22_Msk              (0x01UL << GPIO_PORT_NOT_NOTP22_Pos)                    /*!< GPIO_PORT NOT: NOTP22 Mask              */
#define GPIO_PORT_NOT_NOTP23_Pos              23                                                      /*!< GPIO_PORT NOT: NOTP23 Position          */
#define GPIO_PORT_NOT_NOTP23_Msk              (0x01UL << GPIO_PORT_NOT_NOTP23_Pos)                    /*!< GPIO_PORT NOT: NOTP23 Mask              */
#define GPIO_PORT_NOT_NOTP24_Pos              24                                                      /*!< GPIO_PORT NOT: NOTP24 Position          */
#define GPIO_PORT_NOT_NOTP24_Msk              (0x01UL << GPIO_PORT_NOT_NOTP24_Pos)                    /*!< GPIO_PORT NOT: NOTP24 Mask              */
#define GPIO_PORT_NOT_NOTP25_Pos              25                                                      /*!< GPIO_PORT NOT: NOTP25 Position          */
#define GPIO_PORT_NOT_NOTP25_Msk              (0x01UL << GPIO_PORT_NOT_NOTP25_Pos)                    /*!< GPIO_PORT NOT: NOTP25 Mask              */
#define GPIO_PORT_NOT_NOTP26_Pos              26                                                      /*!< GPIO_PORT NOT: NOTP26 Position          */
#define GPIO_PORT_NOT_NOTP26_Msk              (0x01UL << GPIO_PORT_NOT_NOTP26_Pos)                    /*!< GPIO_PORT NOT: NOTP26 Mask              */
#define GPIO_PORT_NOT_NOTP27_Pos              27                                                      /*!< GPIO_PORT NOT: NOTP27 Position          */
#define GPIO_PORT_NOT_NOTP27_Msk              (0x01UL << GPIO_PORT_NOT_NOTP27_Pos)                    /*!< GPIO_PORT NOT: NOTP27 Mask              */
#define GPIO_PORT_NOT_NOTP28_Pos              28                                                      /*!< GPIO_PORT NOT: NOTP28 Position          */
#define GPIO_PORT_NOT_NOTP28_Msk              (0x01UL << GPIO_PORT_NOT_NOTP28_Pos)                    /*!< GPIO_PORT NOT: NOTP28 Mask              */
#define GPIO_PORT_NOT_NOTP29_Pos              29                                                      /*!< GPIO_PORT NOT: NOTP29 Position          */
#define GPIO_PORT_NOT_NOTP29_Msk              (0x01UL << GPIO_PORT_NOT_NOTP29_Pos)                    /*!< GPIO_PORT NOT: NOTP29 Mask              */
#define GPIO_PORT_NOT_NOTP30_Pos              30                                                      /*!< GPIO_PORT NOT: NOTP30 Position          */
#define GPIO_PORT_NOT_NOTP30_Msk              (0x01UL << GPIO_PORT_NOT_NOTP30_Pos)                    /*!< GPIO_PORT NOT: NOTP30 Mask              */
#define GPIO_PORT_NOT_NOTP31_Pos              31                                                      /*!< GPIO_PORT NOT: NOTP31 Position          */
#define GPIO_PORT_NOT_NOTP31_Msk              (0x01UL << GPIO_PORT_NOT_NOTP31_Pos)                    /*!< GPIO_PORT NOT: NOTP31 Mask              */


/* ================================================================================ */
/* ================          struct 'SPI' Position & Mask          ================ */
/* ================================================================================ */


/* -----------------------------------  SPI_CR  ----------------------------------- */
#define SPI_CR_BITENABLE_Pos                  2                                                       /*!< SPI CR: BITENABLE Position              */
#define SPI_CR_BITENABLE_Msk                  (0x01UL << SPI_CR_BITENABLE_Pos)                        /*!< SPI CR: BITENABLE Mask                  */
#define SPI_CR_CPHA_Pos                       3                                                       /*!< SPI CR: CPHA Position                   */
#define SPI_CR_CPHA_Msk                       (0x01UL << SPI_CR_CPHA_Pos)                             /*!< SPI CR: CPHA Mask                       */
#define SPI_CR_CPOL_Pos                       4                                                       /*!< SPI CR: CPOL Position                   */
#define SPI_CR_CPOL_Msk                       (0x01UL << SPI_CR_CPOL_Pos)                             /*!< SPI CR: CPOL Mask                       */
#define SPI_CR_MSTR_Pos                       5                                                       /*!< SPI CR: MSTR Position                   */
#define SPI_CR_MSTR_Msk                       (0x01UL << SPI_CR_MSTR_Pos)                             /*!< SPI CR: MSTR Mask                       */
#define SPI_CR_LSBF_Pos                       6                                                       /*!< SPI CR: LSBF Position                   */
#define SPI_CR_LSBF_Msk                       (0x01UL << SPI_CR_LSBF_Pos)                             /*!< SPI CR: LSBF Mask                       */
#define SPI_CR_SPIE_Pos                       7                                                       /*!< SPI CR: SPIE Position                   */
#define SPI_CR_SPIE_Msk                       (0x01UL << SPI_CR_SPIE_Pos)                             /*!< SPI CR: SPIE Mask                       */
#define SPI_CR_BITS_Pos                       8                                                       /*!< SPI CR: BITS Position                   */
#define SPI_CR_BITS_Msk                       (0x0fUL << SPI_CR_BITS_Pos)                             /*!< SPI CR: BITS Mask                       */

/* -----------------------------------  SPI_SR  ----------------------------------- */
#define SPI_SR_ABRT_Pos                       3                                                       /*!< SPI SR: ABRT Position                   */
#define SPI_SR_ABRT_Msk                       (0x01UL << SPI_SR_ABRT_Pos)                             /*!< SPI SR: ABRT Mask                       */
#define SPI_SR_MODF_Pos                       4                                                       /*!< SPI SR: MODF Position                   */
#define SPI_SR_MODF_Msk                       (0x01UL << SPI_SR_MODF_Pos)                             /*!< SPI SR: MODF Mask                       */
#define SPI_SR_ROVR_Pos                       5                                                       /*!< SPI SR: ROVR Position                   */
#define SPI_SR_ROVR_Msk                       (0x01UL << SPI_SR_ROVR_Pos)                             /*!< SPI SR: ROVR Mask                       */
#define SPI_SR_WCOL_Pos                       6                                                       /*!< SPI SR: WCOL Position                   */
#define SPI_SR_WCOL_Msk                       (0x01UL << SPI_SR_WCOL_Pos)                             /*!< SPI SR: WCOL Mask                       */
#define SPI_SR_SPIF_Pos                       7                                                       /*!< SPI SR: SPIF Position                   */
#define SPI_SR_SPIF_Msk                       (0x01UL << SPI_SR_SPIF_Pos)                             /*!< SPI SR: SPIF Mask                       */

