MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -----------------------------------  SPI_DR  ----------------------------------- */
#define SPI_DR_DATALOW_Pos                    0                                                       /*!< SPI DR: DATALOW Position                */
#define SPI_DR_DATALOW_Msk                    (0x000000ffUL << SPI_DR_DATALOW_Pos)                    /*!< SPI DR: DATALOW Mask                    */
#define SPI_DR_DATAHIGH_Pos                   8                                                       /*!< SPI DR: DATAHIGH Position               */
#define SPI_DR_DATAHIGH_Msk                   (0x000000ffUL << SPI_DR_DATAHIGH_Pos)                   /*!< SPI DR: DATAHIGH Mask                   */

/* -----------------------------------  SPI_CCR  ---------------------------------- */
#define SPI_CCR_COUNTER_Pos                   0                                                       /*!< SPI CCR: COUNTER Position               */
#define SPI_CCR_COUNTER_Msk                   (0x000000ffUL << SPI_CCR_COUNTER_Pos)                   /*!< SPI CCR: COUNTER Mask                   */

/* -----------------------------------  SPI_TCR  ---------------------------------- */
#define SPI_TCR_TEST_Pos                      1                                                       /*!< SPI TCR: TEST Position                  */
#define SPI_TCR_TEST_Msk                      (0x7fUL << SPI_TCR_TEST_Pos)                            /*!< SPI TCR: TEST Mask                      */

/* -----------------------------------  SPI_TSR  ---------------------------------- */
#define SPI_TSR_ABRT_Pos                      3                                                       /*!< SPI TSR: ABRT Position                  */
#define SPI_TSR_ABRT_Msk                      (0x01UL << SPI_TSR_ABRT_Pos)                            /*!< SPI TSR: ABRT Mask                      */
#define SPI_TSR_MODF_Pos                      4                                                       /*!< SPI TSR: MODF Position                  */
#define SPI_TSR_MODF_Msk                      (0x01UL << SPI_TSR_MODF_Pos)                            /*!< SPI TSR: MODF Mask                      */
#define SPI_TSR_ROVR_Pos                      5                                                       /*!< SPI TSR: ROVR Position                  */
#define SPI_TSR_ROVR_Msk                      (0x01UL << SPI_TSR_ROVR_Pos)                            /*!< SPI TSR: ROVR Mask                      */
#define SPI_TSR_WCOL_Pos                      6                                                       /*!< SPI TSR: WCOL Position                  */
#define SPI_TSR_WCOL_Msk                      (0x01UL << SPI_TSR_WCOL_Pos)                            /*!< SPI TSR: WCOL Mask                      */
#define SPI_TSR_SPIF_Pos                      7                                                       /*!< SPI TSR: SPIF Position                  */
#define SPI_TSR_SPIF_Msk                      (0x01UL << SPI_TSR_SPIF_Pos)                            /*!< SPI TSR: SPIF Mask                      */

/* -----------------------------------  SPI_INT  ---------------------------------- */
#define SPI_INT_SPIF_Pos                      0                                                       /*!< SPI INT: SPIF Position                  */
#define SPI_INT_SPIF_Msk                      (0x01UL << SPI_INT_SPIF_Pos)                            /*!< SPI INT: SPIF Mask                      */


/* ================================================================================ */
/* ================         struct 'SGPIO' Position & Mask         ================ */
/* ================================================================================ */


/* ------------------------------  SGPIO_OUT_MUX_CFG  ----------------------------- */
#define SGPIO_OUT_MUX_CFG_P_OUT_CFG_Pos       0                                                       /*!< SGPIO OUT_MUX_CFG: P_OUT_CFG Position   */
#define SGPIO_OUT_MUX_CFG_P_OUT_CFG_Msk       (0x0fUL << SGPIO_OUT_MUX_CFG_P_OUT_CFG_Pos)             /*!< SGPIO OUT_MUX_CFG: P_OUT_CFG Mask       */
#define SGPIO_OUT_MUX_CFG_P_OE_CFG_Pos        4                                                       /*!< SGPIO OUT_MUX_CFG: P_OE_CFG Position    */
#define SGPIO_OUT_MUX_CFG_P_OE_CFG_Msk        (0x07UL << SGPIO_OUT_MUX_CFG_P_OE_CFG_Pos)              /*!< SGPIO OUT_MUX_CFG: P_OE_CFG Mask        */

/* -----------------------------  SGPIO_SGPIO_MUX_CFG  ---------------------------- */
#define SGPIO_SGPIO_MUX_CFG_EXT_CLK_ENABLE_Pos 0                                                      /*!< SGPIO SGPIO_MUX_CFG: EXT_CLK_ENABLE Position */
#define SGPIO_SGPIO_MUX_CFG_EXT_CLK_ENABLE_Msk (0x01UL << SGPIO_SGPIO_MUX_CFG_EXT_CLK_ENABLE_Pos)     /*!< SGPIO SGPIO_MUX_CFG: EXT_CLK_ENABLE Mask */
#define SGPIO_SGPIO_MUX_CFG_CLK_SOURCE_PIN_MODE_Pos 1                                                 /*!< SGPIO SGPIO_MUX_CFG: CLK_SOURCE_PIN_MODE Position */
#define SGPIO_SGPIO_MUX_CFG_CLK_SOURCE_PIN_MODE_Msk (0x03UL << SGPIO_SGPIO_MUX_CFG_CLK_SOURCE_PIN_MODE_Pos)/*!< SGPIO SGPIO_MUX_CFG: CLK_SOURCE_PIN_MODE Mask */
#define SGPIO_SGPIO_MUX_CFG_CLK_SOURCE_SLICE_MODE_Pos 3                                               /*!< SGPIO SGPIO_MUX_CFG: CLK_SOURCE_SLICE_MODE Position */
#define SGPIO_SGPIO_MUX_CFG_CLK_SOURCE_SLICE_MODE_Msk (0x03UL << SGPIO_SGPIO_MUX_CFG_CLK_SOURCE_SLICE_MODE_Pos)/*!< SGPIO SGPIO_MUX_CFG: CLK_SOURCE_SLICE_MODE Mask */
#define SGPIO_SGPIO_MUX_CFG_QUALIFIER_MODE_Pos 5                                                      /*!< SGPIO SGPIO_MUX_CFG: QUALIFIER_MODE Position */
#define SGPIO_SGPIO_MUX_CFG_QUALIFIER_MODE_Msk (0x03UL << SGPIO_SGPIO_MUX_CFG_QUALIFIER_MODE_Pos)     /*!< SGPIO SGPIO_MUX_CFG: QUALIFIER_MODE Mask */
#define SGPIO_SGPIO_MUX_CFG_QUALIFIER_PIN_MODE_Pos 7                                                  /*!< SGPIO SGPIO_MUX_CFG: QUALIFIER_PIN_MODE Position */
#define SGPIO_SGPIO_MUX_CFG_QUALIFIER_PIN_MODE_Msk (0x03UL << SGPIO_SGPIO_MUX_CFG_QUALIFIER_PIN_MODE_Pos)/*!< SGPIO SGPIO_MUX_CFG: QUALIFIER_PIN_MODE Mask */
#define SGPIO_SGPIO_MUX_CFG_QUALIFIER_SLICE_MODE_Pos 9                                                /*!< SGPIO SGPIO_MUX_CFG: QUALIFIER_SLICE_MODE Position */
#define SGPIO_SGPIO_MUX_CFG_QUALIFIER_SLICE_MODE_Msk (0x03UL << SGPIO_SGPIO_MUX_CFG_QUALIFIER_SLICE_MODE_Pos)/*!< SGPIO SGPIO_MUX_CFG: QUALIFIER_SLICE_MODE Mask */
#define SGPIO_SGPIO_MUX_CFG_CONCAT_ENABLE_Pos 11                                                      /*!< SGPIO SGPIO_MUX_CFG: CONCAT_ENABLE Position */
#define SGPIO_SGPIO_MUX_CFG_CONCAT_ENABLE_Msk (0x01UL << SGPIO_SGPIO_MUX_CFG_CONCAT_ENABLE_Pos)       /*!< SGPIO SGPIO_MUX_CFG: CONCAT_ENABLE Mask */
#define SGPIO_SGPIO_MUX_CFG_CONCAT_ORDER_Pos  12                                                      /*!< SGPIO SGPIO_MUX_CFG: CONCAT_ORDER Position */
#define SGPIO_SGPIO_MUX_CFG_CONCAT_ORDER_Msk  (0x03UL << SGPIO_SGPIO_MUX_CFG_CONCAT_ORDER_Pos)        /*!< SGPIO SGPIO_MUX_CFG: CONCAT_ORDER Mask  */

/* -----------------------------  SGPIO_SLICE_MUX_CFG  ---------------------------- */
#define SGPIO_SLICE_MUX_CFG_MATCH_MODE_Pos    0                                                       /*!< SGPIO SLICE_MUX_CFG: MATCH_MODE Position */
#define SGPIO_SLICE_MUX_CFG_MATCH_MODE_Msk    (0x01UL << SGPIO_SLICE_MUX_CFG_MATCH_MODE_Pos)          /*!< SGPIO SLICE_MUX_CFG: MATCH_MODE Mask    */
#define SGPIO_SLICE_MUX_CFG_CLK_CAPTURE_MODE_Pos 1                                                    /*!< SGPIO SLICE_MUX_CFG: CLK_CAPTURE_MODE Position */
#define SGPIO_SLICE_MUX_CFG_CLK_CAPTURE_MODE_Msk (0x01UL << SGPIO_SLICE_MUX_CFG_CLK_CAPTURE_MODE_Pos) /*!< SGPIO SLICE_MUX_CFG: CLK_CAPTURE_MODE Mask */
#define SGPIO_SLICE_MUX_CFG_CLKGEN_MODE_Pos   2                                                       /*!< SGPIO SLICE_MUX_CFG: CLKGEN_MODE Position */
#define SGPIO_SLICE_MUX_CFG_CLKGEN_MODE_Msk   (0x01UL << SGPIO_SLICE_MUX_CFG_CLKGEN_MODE_Pos)         /*!< SGPIO SLICE_MUX_CFG: CLKGEN_MODE Mask   */
#define SGPIO_SLICE_MUX_CFG_INV_OUT_CLK_Pos   3                                                       /*!< SGPIO SLICE_MUX_CFG: INV_OUT_CLK Position */
#define SGPIO_SLICE_MUX_CFG_INV_OUT_CLK_Msk   (0x01UL << SGPIO_SLICE_MUX_CFG_INV_OUT_CLK_Pos)         /*!< SGPIO SLICE_MUX_CFG: INV_OUT_CLK Mask   */
#define SGPIO_SLICE_MUX_CFG_DATA_CAPTURE_MODE_Pos 4                                                   /*!< SGPIO SLICE_MUX_CFG: DATA_CAPTURE_MODE Position */
#define SGPIO_SLICE_MUX_CFG_DATA_CAPTURE_MODE_Msk (0x03UL << SGPIO_SLICE_MUX_CFG_DATA_CAPTURE_MODE_Pos)/*!< SGPIO SLICE_MUX_CFG: DATA_CAPTURE_MODE Mask */
#define SGPIO_SLICE_MUX_CFG_PARALLEL_MODE_Pos 6                                                       /*!< SGPIO SLICE_MUX_CFG: PARALLEL_MODE Position */
#define SGPIO_SLICE_MUX_CFG_PARALLEL_MODE_Msk (0x03UL << SGPIO_SLICE_MUX_CFG_PARALLEL_MODE_Pos)       /*!< SGPIO SLICE_MUX_CFG: PARALLEL_MODE Mask */
#define SGPIO_SLICE_MUX_CFG_INV_QUALIFIER_Pos 8                                                       /*!< SGPIO SLICE_MUX_CFG: INV_QUALIFIER Position */
#define SGPIO_SLICE_MUX_CFG_INV_QUALIFIER_Msk (0x01UL << SGPIO_SLICE_MUX_CFG_INV_QUALIFIER_Pos)       /*!< SGPIO SLICE_MUX_CFG: INV_QUALIFIER Mask */

