MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC4322JBD144/mcu.h
/* -------------------------------  SGPIO_CLR_EN_1  ------------------------------- */
#define SGPIO_CLR_EN_1_CLR_EN_CCI_Pos         0                                                       /*!< SGPIO CLR_EN_1: CLR_EN_CCI Position     */
#define SGPIO_CLR_EN_1_CLR_EN_CCI_Msk         (0x0000ffffUL << SGPIO_CLR_EN_1_CLR_EN_CCI_Pos)         /*!< SGPIO CLR_EN_1: CLR_EN_CCI Mask         */

/* -------------------------------  SGPIO_SET_EN_1  ------------------------------- */
#define SGPIO_SET_EN_1_SET_EN_CCI_Pos         0                                                       /*!< SGPIO SET_EN_1: SET_EN_CCI Position     */
#define SGPIO_SET_EN_1_SET_EN_CCI_Msk         (0x0000ffffUL << SGPIO_SET_EN_1_SET_EN_CCI_Pos)         /*!< SGPIO SET_EN_1: SET_EN_CCI Mask         */

/* -------------------------------  SGPIO_ENABLE_1  ------------------------------- */
#define SGPIO_ENABLE_1_ENABLE_CCI_Pos         0                                                       /*!< SGPIO ENABLE_1: ENABLE_CCI Position     */
#define SGPIO_ENABLE_1_ENABLE_CCI_Msk         (0x0000ffffUL << SGPIO_ENABLE_1_ENABLE_CCI_Pos)         /*!< SGPIO ENABLE_1: ENABLE_CCI Mask         */

/* -------------------------------  SGPIO_STATUS_1  ------------------------------- */
#define SGPIO_STATUS_1_STATUS_CCI_Pos         0                                                       /*!< SGPIO STATUS_1: STATUS_CCI Position     */
#define SGPIO_STATUS_1_STATUS_CCI_Msk         (0x0000ffffUL << SGPIO_STATUS_1_STATUS_CCI_Pos)         /*!< SGPIO STATUS_1: STATUS_CCI Mask         */

/* -----------------------------  SGPIO_CLR_STATUS_1  ----------------------------- */
#define SGPIO_CLR_STATUS_1_CLR_STATUS_CCI_Pos 0                                                       /*!< SGPIO CLR_STATUS_1: CLR_STATUS_CCI Position */
#define SGPIO_CLR_STATUS_1_CLR_STATUS_CCI_Msk (0x0000ffffUL << SGPIO_CLR_STATUS_1_CLR_STATUS_CCI_Pos) /*!< SGPIO CLR_STATUS_1: CLR_STATUS_CCI Mask */

/* -----------------------------  SGPIO_SET_STATUS_1  ----------------------------- */
#define SGPIO_SET_STATUS_1_SET_STATUS_CCI_Pos 0                                                       /*!< SGPIO SET_STATUS_1: SET_STATUS_CCI Position */
#define SGPIO_SET_STATUS_1_SET_STATUS_CCI_Msk (0x0000ffffUL << SGPIO_SET_STATUS_1_SET_STATUS_CCI_Pos) /*!< SGPIO SET_STATUS_1: SET_STATUS_CCI Mask */

/* -------------------------------  SGPIO_CLR_EN_2  ------------------------------- */
#define SGPIO_CLR_EN_2_CLR_EN2_PMI_Pos        0                                                       /*!< SGPIO CLR_EN_2: CLR_EN2_PMI Position    */
#define SGPIO_CLR_EN_2_CLR_EN2_PMI_Msk        (0x0000ffffUL << SGPIO_CLR_EN_2_CLR_EN2_PMI_Pos)        /*!< SGPIO CLR_EN_2: CLR_EN2_PMI Mask        */

/* -------------------------------  SGPIO_SET_EN_2  ------------------------------- */
#define SGPIO_SET_EN_2_SET_EN_PMI_Pos         0                                                       /*!< SGPIO SET_EN_2: SET_EN_PMI Position     */
#define SGPIO_SET_EN_2_SET_EN_PMI_Msk         (0x0000ffffUL << SGPIO_SET_EN_2_SET_EN_PMI_Pos)         /*!< SGPIO SET_EN_2: SET_EN_PMI Mask         */

/* -------------------------------  SGPIO_ENABLE_2  ------------------------------- */
#define SGPIO_ENABLE_2_ENABLE_PMI_Pos         0                                                       /*!< SGPIO ENABLE_2: ENABLE_PMI Position     */
#define SGPIO_ENABLE_2_ENABLE_PMI_Msk         (0x0000ffffUL << SGPIO_ENABLE_2_ENABLE_PMI_Pos)         /*!< SGPIO ENABLE_2: ENABLE_PMI Mask         */

/* -------------------------------  SGPIO_STATUS_2  ------------------------------- */
#define SGPIO_STATUS_2_STATUS_PMI_Pos         0                                                       /*!< SGPIO STATUS_2: STATUS_PMI Position     */
#define SGPIO_STATUS_2_STATUS_PMI_Msk         (0x0000ffffUL << SGPIO_STATUS_2_STATUS_PMI_Pos)         /*!< SGPIO STATUS_2: STATUS_PMI Mask         */

/* -----------------------------  SGPIO_CLR_STATUS_2  ----------------------------- */
#define SGPIO_CLR_STATUS_2_CLR_STATUS_PMI_Pos 0                                                       /*!< SGPIO CLR_STATUS_2: CLR_STATUS_PMI Position */
#define SGPIO_CLR_STATUS_2_CLR_STATUS_PMI_Msk (0x0000ffffUL << SGPIO_CLR_STATUS_2_CLR_STATUS_PMI_Pos) /*!< SGPIO CLR_STATUS_2: CLR_STATUS_PMI Mask */

/* -----------------------------  SGPIO_SET_STATUS_2  ----------------------------- */
#define SGPIO_SET_STATUS_2_SET_STATUS_PMI_Pos 0                                                       /*!< SGPIO SET_STATUS_2: SET_STATUS_PMI Position */
#define SGPIO_SET_STATUS_2_SET_STATUS_PMI_Msk (0x0000ffffUL << SGPIO_SET_STATUS_2_SET_STATUS_PMI_Pos) /*!< SGPIO SET_STATUS_2: SET_STATUS_PMI Mask */

/* -------------------------------  SGPIO_CLR_EN_3  ------------------------------- */
#define SGPIO_CLR_EN_3_CLR_EN_INPI_Pos        0                                                       /*!< SGPIO CLR_EN_3: CLR_EN_INPI Position    */
#define SGPIO_CLR_EN_3_CLR_EN_INPI_Msk        (0x0000ffffUL << SGPIO_CLR_EN_3_CLR_EN_INPI_Pos)        /*!< SGPIO CLR_EN_3: CLR_EN_INPI Mask        */

/* -------------------------------  SGPIO_SET_EN_3  ------------------------------- */
#define SGPIO_SET_EN_3_SET_EN_INPI_Pos        0                                                       /*!< SGPIO SET_EN_3: SET_EN_INPI Position    */
#define SGPIO_SET_EN_3_SET_EN_INPI_Msk        (0x0000ffffUL << SGPIO_SET_EN_3_SET_EN_INPI_Pos)        /*!< SGPIO SET_EN_3: SET_EN_INPI Mask        */

/* -------------------------------  SGPIO_ENABLE_3  ------------------------------- */
#define SGPIO_ENABLE_3_ENABLE3_INPI_Pos       0                                                       /*!< SGPIO ENABLE_3: ENABLE3_INPI Position   */
#define SGPIO_ENABLE_3_ENABLE3_INPI_Msk       (0x0000ffffUL << SGPIO_ENABLE_3_ENABLE3_INPI_Pos)       /*!< SGPIO ENABLE_3: ENABLE3_INPI Mask       */

/* -------------------------------  SGPIO_STATUS_3  ------------------------------- */
#define SGPIO_STATUS_3_STATUS_INPI_Pos        0                                                       /*!< SGPIO STATUS_3: STATUS_INPI Position    */
#define SGPIO_STATUS_3_STATUS_INPI_Msk        (0x0000ffffUL << SGPIO_STATUS_3_STATUS_INPI_Pos)        /*!< SGPIO STATUS_3: STATUS_INPI Mask        */

/* -----------------------------  SGPIO_CLR_STATUS_3  ----------------------------- */
#define SGPIO_CLR_STATUS_3_CLR_STATUS_INPI_Pos 0                                                      /*!< SGPIO CLR_STATUS_3: CLR_STATUS_INPI Position */
#define SGPIO_CLR_STATUS_3_CLR_STATUS_INPI_Msk (0x0000ffffUL << SGPIO_CLR_STATUS_3_CLR_STATUS_INPI_Pos)/*!< SGPIO CLR_STATUS_3: CLR_STATUS_INPI Mask */

